-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主机： 127.0.0.1
-- 生成日期： 2025-08-15 05:02:01
-- 服务器版本： 10.4.32-MariaDB
-- PHP 版本： 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `lp`
--
CREATE DATABASE IF NOT EXISTS `lp` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `lp`;

-- --------------------------------------------------------

--
-- 表的结构 `bulletin`
--

CREATE TABLE `bulletin` (
  `date` int(11) NOT NULL,
  `clientId` int(11) NOT NULL,
  `content` int(11) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 表的结构 `convension`
--

CREATE TABLE `convension` (
  `account` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL,
  `height` varchar(10) NOT NULL,
  `weight` varchar(10) NOT NULL,
  `xw` varchar(10) NOT NULL,
  `job` varchar(20) NOT NULL,
  `video` varchar(50) NOT NULL,
  `avatar` varchar(50) NOT NULL,
  `jj` varchar(300) NOT NULL,
  `id` int(11) NOT NULL,
  `city` varchar(20) NOT NULL,
  `gender` varchar(20) NOT NULL,
  `country` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `convension`
--

INSERT INTO `convension` (`account`, `name`, `height`, `weight`, `xw`, `job`, `video`, `avatar`, `jj`, `id`, `city`, `gender`, `country`) VALUES
('01', 'すずき なな', '165', '51', 'D', 'ひしょかん', 'IMG_0358.MP4', 'photo_2025-03-06_01-00-23 (2).jpg', '', 1, '東京', '0', 'jp'),
('02', 'さくらい みさき', '165', '45', 'C', 'おんがく きょうし', 'IMG_6659.MP4', 'photo_2025-03-04_06-23-48.jpg', '', 2, '東京', '0', 'jp'),
('03', 'ほしの ちなつ', '163', '45', 'C', 'しょくいん', 'IMG_3936.MP4', 'Snipaste_2025-02-28_22-13-tx58.jpg', '', 4, 'なごや', '0', 'jp'),
('04', '김태희', '168', '45', 'C', '메이크업 아티스트', 'video_2025-03-04_03-11-32.mp4', 'Snipaste_2025-03-08_14-35-03.jpg', '韓國', 5, '한국 서울', '0', 'jp'),
('05', 'Nguyễn Thị Phương', '162', '47', 'B', 'y tá nữ', '1video_2025-03-08_15-23-30.mp4', '1photo_2024-12-14_03-08-36.jpg', '', 6, 'Nha Trang, Việt Nam', '0', 'jp'),
('06', '이민호', '170', '51', 'C', '모델러', 'video_2025-03-06_01-49-40.mp4', 'photo_2025-03-06_01-20-48.jpg', '', 7, '서울', '0', 'jp'),
('07', 'Lam Shi Yun', '170', '50', 'B', 'Guru Yoga', '3video_2025-03-08_15-24-16.mp4', '3photo_2024-12-28_13-04-40.jpg', '', 8, 'Kuala Lumpur', '0', 'jp'),
('08', 'やまぐち ももえ', '165', '50', 'B', 'おんがく きょうし', '5video_2025-03-08_15-24-58.mp4', '5photo_2025-02-11_02-22-01.jpg', '', 9, '福岡県', '0', 'jp'),
('09', 'いしはら さとみ', '168', '49', 'B', 'ひしょかん', '6video_2025-03-08_15-25-13.mp4', '6photo_2025-02-26_03-34-08.jpg', '', 10, '東京', '0', 'jp'),
('10', 'ほしの みゆき', '160', '45', 'C', '社員', '日本21.mp4', '日本21.png', '', 11, '横浜', '0', 'jp'),
('11', 'さき ゆうな', '162', '45', 'B', 'がくせい', '日本20.mp4', '日本20.jpg', '', 12, '青森県', '0', 'jp'),
('12', '김서영', '165', '48', 'B', '요가 코치', '地区  韩国13.mp4', '地区  韩国13.png', '', 13, '서울', '0', 'jp'),
('13', '이하늘', '165', '47', 'C', '비서 ', '地区  韩国14.mp4', '地区  韩国14.png', '', 14, '서울”', '0', 'jp'),
('14', 'Amira Harris', '165', '49', 'B', 'jurulatih renang', '地区  上海15.mp4', 'photo_2025-03-04_20-26-19.jpg', '', 15, 'Kuala Lumpur', '0', 'jp'),
('15', 'みやざき りな', '163', '52', 'C', 'けいえいたんとうしゃ', '地区  韩国18.mp4', '地区  韩国18.png', '', 16, '広島県', '0', 'jp'),
('16', 'Olivia White', '165', '52', 'B', 'stylist model', '地区 荷兰11.mp4', '地区 荷兰11.png', '', 17, 'London', '0', 'jp'),
('17', 'さくらい あやか', '163', '51', 'B', 'そつぎょうせい', '13.19.mp4', 'photo_2025-02-12_14-30-36.jpg', '', 18, '鹿児島県', '0', 'jp'),
('18', 'Ava Johnson', '165', '52', 'B', 'manikin', '地区 乌克兰3.mp4', '地区 乌克兰3.png', '', 19, 'Kharkiv', '0', 'jp'),
('19', 'Emma', '170', '55', 'B', 'chorine', '地区  韩国17.mp4', 'photo_2025-03-10_17-59-01.jpg', '', 20, 'New York', '0', 'jp'),
('20', 'やまもと たくや', '175', '68', '1', 'カヌーコーチ', '地区  台湾.mp4', '地区  台湾.png', '', 21, '宮崎県', '1', 'jp'),
('21', 'わたなべ たくや ', '175', '73', '1', 'いりょうぎょうかい', '地区 新加坡2.mp4', 'photo_2025-03-08_19-01-13.jpg', '', 22, 'きょうとふ', '1', 'jp'),
('22', 'わたなべ たくや ', '175', '75', '1', '金融セクター', '地区 越南.mp4', 'photo_2025-03-08_19-01-24.jpg', '', 23, 'いばらきけん', '1', 'jp'),
('23', 'William', '180', '80', '1', 'boxing', '地区  阿联酋.mp4', 'photo_2025-03-08_19-01-39.jpg', '', 24, 'London', '1', 'jp'),
('24', 'Oliver', '180', '95', '1', 'fitness coach', '地区  美国.mp4', 'photo_2025-03-08_19-01-44.jpg', '', 25, 'Edinburgh', '1', 'jp'),
('25', 'ろばね ゆうき', '178', '79', '1', 'ソフトウェア開発エンジニア', '地区 新加坡.mp4', 'photo_2025-03-08_19-03-06.jpg', '', 26, 'きょうとふ', '1', 'jp'),
('26', 'みやざき はやと', '178', '75', '1', '室内デザイナー', '地区 泰国3.mp4', 'photo_2025-03-08_19-03-03.jpg', '', 27, 'あきたけん', '1', 'jp'),
('27', 'さいとう かずや', '178', '79', '', 'データ解析師', '日本21.mp4', 'photo_2025-03-08_19-02-53.jpg', '', 28, '奈良県', '1', 'jp'),
('28', 'たかはし ゆうた', '178', '72', '1', '資産管理顧問', '地区 马来西亚.mp4', 'photo_2025-03-08_19-02-48.jpg', '', 29, '茨城県', '1', 'jp'),
('29', 'いとう たくしん', '178', '78', '1', '監理エンジニア', '地区  中国.mp4', 'photo_2025-03-08_19-02-41.jpg', '', 30, '愛知県', '1', 'jp'),
('30', '박지훈', '179', '80', '1', '건축사', '地区  泰国1.mp4', 'photo_2025-03-08_22-00-45.jpg', '', 31, '부산”', '1', 'jp'),
('31', 'Leo', '179', '85', '1', 'spécialiste juridiqu', '地区  意大利.mp4', 'photo_2025-03-08_22-04-26.jpg', '', 32, 'Paris', '1', 'jp'),
('32', 'Lucas', '180', '80', '1', 'médeci', '地区  伊拉克.mp4', 'photo_2025-03-08_19-01-54.jpg', '', 33, 'Marseille', '1', 'jp');

-- --------------------------------------------------------

--
-- 表的结构 `dating`
--

CREATE TABLE `dating` (
  `account` varchar(20) NOT NULL,
  `vipGrade` varchar(10) NOT NULL,
  `name` varchar(20) NOT NULL,
  `money` varchar(20) NOT NULL,
  `type` varchar(10) NOT NULL,
  `country` varchar(20) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `dating`
--

INSERT INTO `dating` (`account`, `vipGrade`, `name`, `money`, `type`, `country`, `id`) VALUES
('513203', '1', '한준석', '1200000원', '1', 'jp', 1),
('5132031', '1', '정유나', '1560000원', '1', 'jp', 2),
('5132033', '0', 'たかはし しょうた', '150000円', '0', 'jp', 3),
('5132034', '1', 'たなか あおい', '330000円', '2', 'jp', 4),
('5132035', '0', '박서연', '550000원', '2', 'jp', 5),
('5132036', '2', 'いとう しおり', '650000円', '1', 'jp', 6),
('5132037', '3', 'さき かずや', '1200000円', '0', 'jp', 7),
('5132037', '3', 'さき かずや', '100000円', '0', 'jp', 8),
('65165106520', '1', 'ほしの えり', '600000円', '1', 'jp', 9),
('65165106521', '2', 'さとう さくら', '150000円', '1', 'jp', 10),
('65165106523', '2', 'たかはし しょうた', '150000円', '1', 'jp', 11),
('65165106524', '3', 'William Thompson', '3000USTD', '1', 'jp', 12),
('65165106525', '1', 'わたなべ みほ', '120000円', '0', 'jp', 13),
('65165106526', '1', 'やまもと ゆうき', '36000円', '1', 'jp', 14),
('65165106527', '1', 'くろばね れいな', '100000円', '0', 'jp', 15),
('65169419615', '2', 'くすのき しおり', '50000円', '0', 'jp', 16),
('5132038', '3', 'Emma Müller', '6000US', '2', 'jp', 17),
('5132038', '3', 'Emma Müller', '5000US', '1', 'en', 18),
('15612', '0', 'さとう けん', '15000円', '1', 'jp', 19);

-- --------------------------------------------------------

--
-- 表的结构 `gift`
--

CREATE TABLE `gift` (
  `id` int(11) NOT NULL,
  `src` varchar(20) DEFAULT NULL,
  `name` varchar(20) NOT NULL,
  `vote` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `gift`
--

INSERT INTO `gift` (`id`, `src`, `name`, `vote`) VALUES
(1, '3.jpg', '889', '2382965'),
(2, '9.jpg', '686', '2145461'),
(3, 'om1.jpg', '996', '2084694'),
(4, 'xjp.jpg', '886', '1684344'),
(5, 'om3.jpg', '776', '606167'),
(6, 'ko1.jpg', '102', '978900');

-- --------------------------------------------------------

--
-- 表的结构 `lang`
--

CREATE TABLE `lang` (
  `lang` varchar(20) NOT NULL,
  `flag` varchar(10) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `lang`
--

INSERT INTO `lang` (`lang`, `flag`, `id`) VALUES
('日语', '1', 1),
('韩语', '1', 2),
('英语', '1', 3),
('越南语', '1', 4),
('繁体中文', '1', 5);

-- --------------------------------------------------------

--
-- 表的结构 `letter`
--

CREATE TABLE `letter` (
  `id` int(11) NOT NULL,
  `account` varchar(20) NOT NULL,
  `content` varchar(500) NOT NULL,
  `img` varchar(50) NOT NULL,
  `date` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `letter`
--

INSERT INTO `letter` (`id`, `account`, `content`, `img`, `date`, `name`) VALUES
(1, 'asdsdd', '心いっぱいの感謝の気持ちを込めて、この手紙を書かせていただきます。少し前まで、私は貴プラットフォームを通じて、今の彼女と出会うことができました。彼女の現れは私の生活を明るく照らしました。プラットフォームの正確なマッチングと思いやりのあるサービスのおかげで、私たちは広い人ごみの中を越えて、一緒になることができました。\r\n\r\n最初のオンライン交流から、オフラインでのデートのときのドキドキする瞬間まで、どの一歩もプラットフォームの力なしには成り立ちませんでした。今、私たちの関係は安定しており、未来に向かって大いに期待しています。心から貴プラットフォームが提供してくれた素敵な交友環境に感謝いたします。これにより、愛の花がきれいに咲きました。プラットフォームがますます素敵なものになり、もっと多くの人が幸せを手に入れられるように、心から願っています 。', '', '2025-02-23', 'くすのき しおり'),
(2, 'asdasd', '貴プラットフォームに加入する前は、私はずっと広い人ごみの中で、生涯一緒にいる相手を見つけることを期待していました。思いも寄らなかったことに、プラットフォームが巧みに私と私の夫をつないでくれました。初めてプラットフォームで彼の情報を見たとき、妙な感じが自然に湧いてきました。チャットを始めてから、私たちは驚いたことに、たくさんの共感を見つけました。', '', '2021-05-25', 'たなか あおい'),
(3, '65165106525', 'オンラインでのやり取りの盛んな交流から、オフラインで会ったときの彼の暖かい笑顔や思いやりのある行動まで、どの瞬間もプラットフォームの存在によって可能になりました。付き合いが深まるにつれて、私たちの愛情はますます厚くなりました。今、私たちは未来の生活に満ち溢れた期待を抱いており、たくさんの素敵な未来の計画を立てています。', '', '2019-6-19', 'たかはし しょうた'),
(4, 'asdasddd', 'こんにちは！心からの感謝の気持ちを皆さんにお伝えしたいと思います。貴プラットフォームを通じて、イギリスに住んでいる彼氏と出会うことができました。彼の登場により、私の世界はこれまで以上に輝き始めました。\r\n\r\n元々は遠く離れていた私たちが、プラットフォームの正確なマッチングと心のこもったサービスを通じて、素敵な縁をつなぐことができました。オンラインで時差を越えた盛り上がったチャットから、オフラインで国境を越えて会ったときのドキドキする瞬間まで、どの一歩もプラットフォームのおかげです。今、私たちの関係は安定しており、未来に対して大いに期待を抱いています。', '', '2021-05-25', '樱井 葵'),
(5, '65165106525', 'When I first saw her profile on the platform, it was as if I had been enchanted, and my heart rate unconsciously accelerated. During our online communication, we were like two people who had opened a chatterbox and just couldn\'t stop. From those strange and niche hobbies to our wild fantasies about the future, every conversation was like exploring a whole new world, full of constant surprises.\r\n\r\nFinally, the day of our offline date arrived. I was so nervous that I didn\'t know what to do with my', '', '2022-09-24', 'William'),
(6, 'asdasdddd', '제 마음 가득 감사의 마음이 넘쳐서, 빨리 이야기하고 싶습니다. 귀하의 플랫폼에 가입하기 전에 제가 사랑을 찾는 길은 아주 길었고, 자주 실망했습니다. 하지만 가입한 후에는 모든 게 달라졌습니다.\r\n\r\n플랫폼의 정확한 필터 기능이 너무 강력합니다. 제가 취미, 성격 취향 등 조건을 설정하자 곧 그녀의 프로필을 볼 수 있었습니다. 첫 번째 온라인 소통할 때 제가 문제를 만났는데, 플랫폼 고객센터가 신속하게 대응하고, 인내심 있게 안내해줘서 소통이 원활하게 이어질 수 있었습니다. 오프라인 데이트 때는 플랫폼에서 추천한 장소가 너무 낭만적이고 적절해서 우리 만남이 특히나 아름답게 됐습니다.', '', '2024-05-15', '박지원'),
(7, '65165106525', 'With a heart full of gratitude, I am earnestly writing this letter. \"May I find a heart - to - heart person and stay with him until the end of our days.\" The once - beautiful expectation for love has now become a reality on your platform. Not long ago, with the help of the platform\'s precise matching and meticulous and considerate services, I met my current girlfriend. She is like a warm sun, instantly lighting up my life.', '', '2023-07-18', 'Sophia'),
(8, 'asdasddddd', 'From the instant sense of familiarity in our first online conversation to the heart - pounding moment during our offline date, along the way, the platform has played an extremely important role. Now, our relationship is firm, and we are full of anticipation for the future. I sincerely thank your platform for creating a high - quality dating environment, allowing the flower of love to bloom brightly. May the platform thrive and help more people encounter good fortune and harvest happiness.', '', '2024-07-13', 'Rossi'),
(9, '65165106525', '감사합니다! 귀하의 플랫폼을 통해 제 여자친구와 만났습니다. 온라인으로 열심히 소통하고, 오프라인 데이트에서 설레는 감정을 느끼는데, 모두 플랫폼의 도움 덕분입니다. 지금 우리 사이의 감정은 안정적이고, 미래에 대한 기대감이 넘쳐납니다. 플랫폼이 제공하는 우수한 환경에 감사드립니다. 이로 인해 사랑이 피어나게 된 것입니다. 플랫폼이 더욱 더 발전해 더 많은 사람들이 행복을 가질 수 있도록 기원합니다. ', '', '2023-03-28', '김지윤');

-- --------------------------------------------------------

--
-- 表的结构 `line`
--

CREATE TABLE `line` (
  `name` varchar(20) NOT NULL,
  `line` varchar(20) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 表的结构 `manage`
--

CREATE TABLE `manage` (
  `account` varchar(20) NOT NULL,
  `password` varchar(20) NOT NULL,
  `loginFlag` varchar(10) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='			weight: '''', 			xw: '''', 			job';

--
-- 转存表中的数据 `manage`
--

INSERT INTO `manage` (`account`, `password`, `loginFlag`, `id`) VALUES
('xiaohu', 'xiaohu123', '1', 1);

-- --------------------------------------------------------

--
-- 表的结构 `operator`
--

CREATE TABLE `operator` (
  `account` varchar(20) NOT NULL,
  `content` varchar(255) NOT NULL,
  `doing` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 表的结构 `orderlist`
--

CREATE TABLE `orderlist` (
  `id` int(11) NOT NULL,
  `account` varchar(20) NOT NULL,
  `makeMoney` varchar(20) NOT NULL,
  `type` varchar(10) NOT NULL,
  `date` varchar(30) NOT NULL,
  `status` varchar(10) NOT NULL DEFAULT '0' COMMENT '0待审核 1已通过 2已拒绝'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `orderlist`
--

INSERT INTO `orderlist` (`id`, `account`, `makeMoney`, `type`, `date`, `status`) VALUES
(16, 'TETU0523', '6000', '1', '2025-03-14 17:06:20', '1'),
(18, '1234', '1000', '0', '2025-03-14 17:33:12', '1'),
(19, 'ニシダサネヒト', '6000', '0', '2025-03-17 11:58:29', '1'),
(20, 'ニシダサネヒト', '24000', '0', '2025-03-17 14:06:29', '1'),
(21, 'エルヴィン　スミス', '6000', '1', '2025-03-17 17:29:05', '1'),
(22, '08018458895', '6000', '1', '2025-03-17 17:54:13', '1'),
(23, 'エルヴィン　スミス', '20000', '0', '2025-03-18 12:16:44', '1'),
(24, 'エルヴィン　スミス', '25000', '1', '2025-03-18 18:19:51', '1'),
(25, '08018458895', '24000', '0', '2025-03-18 18:41:35', '1'),
(26, 'Aung san lin', '7000', '1', '2025-03-19 10:36:22', '1'),
(27, '08018458895', '24000', '1', '2025-03-19 11:21:21', '2'),
(28, 'izumis18', '6000', '1', '2025-03-20 10:21:43', '1'),
(29, '08018458895', '120000', '0', '2025-03-21 19:43:35', '1'),
(30, 'Aung san lin', '20000', '0', '2025-03-22 15:57:28', '1'),
(31, 'なおきいしかわ', '5000', '0', '2025-03-22 16:03:21', '1'),
(32, 'なおきいしかわ', '6000', '1', '2025-03-22 16:23:47', '1'),
(33, 'Aung san lin', '24000', '1', '2025-03-22 18:13:38', '1'),
(34, '08018458895', '144000', '1', '2025-03-22 23:35:24', '2'),
(35, 'fukuda', '5000', '0', '2025-03-23 17:54:34', '1'),
(36, 'fukuda', '6000', '1', '2025-03-23 18:02:41', '0'),
(37, 'ユタユタゆたか', '5000', '0', '2025-03-25 12:40:44', '1'),
(38, 'ユタユタゆたか', '6000', '1', '2025-03-25 13:17:32', '1'),
(39, '09074334179', '5000', '0', '2025-03-25 15:30:32', '1'),
(40, '09074334179', '30000', '0', '2025-03-26 11:15:04', '1'),
(41, '09074334179', '42000', '1', '2025-03-26 11:21:46', '2'),
(42, '09074334179', '36000', '1', '2025-03-26 11:26:38', '1'),
(43, 'ユタユタゆたか', '30000', '0', '2025-03-26 14:41:33', '1'),
(44, 'ユタユタゆたか', '36000', '1', '2025-03-26 16:23:09', '1'),
(45, 'ユタユタゆたか', '50000', '0', '2025-03-26 16:59:47', '1'),
(46, 'ユタユタゆたか', '60000', '1', '2025-03-26 17:09:21', '1'),
(47, '08060931376', '5000', '0', '2025-03-28 14:42:34', '1'),
(48, '08060931376', '6000', '1', '2025-03-28 15:16:04', '1'),
(49, 'ユタユタゆたか', '500000', '0', '2025-03-28 15:25:47', '1'),
(50, 'ユタユタゆたか', '100000', '1', '2025-03-28 15:29:02', '1'),
(51, 'ユタユタゆたか', '720000', '0', '2025-03-28 15:45:38', '2'),
(52, '1234', '100', '0', '2025-03-28 16:55:37', '2'),
(53, '6389547048', '100000', '1', '2025-03-28 17:08:05', '2'),
(54, '08060931376', '30000', '0', '2025-03-28 17:09:56', '1'),
(55, '孤独なこうじ', '5000', '0', '2025-03-28 17:10:25', '1'),
(56, 'snari3', '5000', '0', '2025-03-28 17:20:01', '1'),
(57, '08060931376', '6000', '1', '2025-03-28 18:05:32', '2'),
(58, 'コナンキュウ', '5000', '0', '2025-03-28 18:22:34', '1'),
(59, 'コナンキュウ', '5000', '1', '2025-03-29 10:26:46', '1'),
(60, 'snari3', '30000', '0', '2025-03-29 11:11:12', '1'),
(61, 'snari3', '36000', '1', '2025-03-29 12:00:44', '1'),
(63, 'snari3', '60000', '1', '2025-03-29 13:51:11', '1'),
(64, '08018458895', '144000', '1', '2025-03-29 15:26:29', '0'),
(65, '090-7852-5619', '6000', '1', '2025-03-30 12:45:57', '1'),
(66, 'Boohfree', '6000', '0', '2025-03-31 10:42:23', '1'),
(67, 'Boohfree', '6000', '1', '2025-03-31 10:51:52', '1'),
(68, 'Boohfree', '36000', '1', '2025-03-31 17:43:45', '1'),
(69, 'Boohfree', '50000', '0', '2025-04-01 12:40:31', '1'),
(70, 'Boohfree', '60000', '1', '2025-04-01 13:25:41', '1'),
(71, 'エルヴィン　スミス', '60000', '1', '2025-04-01 15:26:20', '1'),
(72, 'エルヴィン　スミス', '100000', '0', '2025-04-02 14:53:41', '1'),
(73, 'takahara', '6000', '1', '2025-04-03 20:42:36', '1'),
(74, 'アグニシゲヤ', '1000', '0', '2025-04-05 17:42:04', '2'),
(75, '86112311', '6000', '1', '2025-04-05 18:53:33', '1'),
(76, 'アグニシゲヤ', '5000', '1', '2025-04-05 19:59:10', '2'),
(77, '08060931376', '48000', '0', '2025-04-06 10:16:21', '1'),
(78, 'アグニシゲヤ', '6000', '1', '2025-04-06 10:38:07', '0'),
(79, '08060931376', '178000', '1', '2025-04-06 15:39:58', '2'),
(80, 'KOHMIYA', '6000', '1', '2025-04-06 17:02:13', '1'),
(81, 'KOHMIYA', '30000', '0', '2025-04-06 17:40:33', '1'),
(82, 'noboru', '6000', '1', '2025-04-07 17:41:09', '1'),
(83, 'KOHMIYA', '36000', '1', '2025-04-09 11:40:03', '0'),
(84, 'ウエハラ1945', '1000', '1', '2025-04-09 13:46:36', '2'),
(85, 'ウエハラ1945', '5000', '1', '2025-04-09 14:10:21', '2'),
(86, 'ウエハラ1945', '6000', '1', '2025-04-09 14:13:29', '1'),
(89, 'michiaki1496', '6000', '1', '2025-04-10 14:09:05', '1'),
(90, 'もも19940720', '120000', '1', '2025-04-10 14:50:51', '1'),
(91, '08095325189', '30000', '0', '2025-04-10 20:24:01', '2'),
(92, 'クサノケンジ', '6000', '1', '2025-04-11 10:57:46', '1'),
(93, 'michiaki1496', '36000', '1', '2025-04-11 15:52:37', '1'),
(94, 'michiaki1496', '60000', '1', '2025-04-11 17:49:28', '1'),
(95, 'abc123', '6000', '1', '2025-04-11 17:49:46', '1'),
(96, 'abc123', '30000', '0', '2025-04-12 10:16:59', '1'),
(97, 'abc123', '36000', '1', '2025-04-12 10:56:43', '1'),
(98, 'abc123', '50000', '0', '2025-04-12 11:37:06', '2'),
(99, 'クサノケンジ', '36000', '1', '2025-04-12 11:46:54', '1'),
(100, 'abc123', '60000', '1', '2025-04-12 11:51:54', '1'),
(101, 'クサノケンジ', '60000', '1', '2025-04-12 15:21:58', '1'),
(102, '111111', '5000', '0', '2025-04-12 20:28:58', '1'),
(103, '111111', '3000', '0', '2025-04-12 20:30:07', '1'),
(104, '111111', '50000', '0', '2025-04-13 17:43:39', '1'),
(105, '111111', '30000', '0', '2025-04-13 17:47:18', '1'),
(106, '999999', '6000', '1', '2025-04-16 11:59:38', '1'),
(107, 'ずもとこういち', '36000', '1', '2025-04-16 15:12:58', '1'),
(108, '090-7852-5619', '120000', '1', '2025-04-16 16:16:19', '2'),
(109, '999999', '36000', '1', '2025-04-16 18:13:12', '1'),
(110, 'ずもとこういち', '60000', '1', '2025-04-17 14:58:47', '1'),
(111, '999999', '60000', '1', '2025-04-18 05:37:44', '1'),
(112, '09024307925', '6000', '1', '2025-04-19 15:11:41', '1'),
(113, 'kohaku39', '6000', '1', '2025-04-20 09:14:22', '1'),
(114, '09024307925', '30000', '0', '2025-04-20 12:07:37', '1'),
(116, '09024307925', '36000', '1', '2025-04-20 12:21:58', '1'),
(117, 'はやし　てつあき', '6000', '1', '2025-04-20 13:52:43', '1'),
(118, 'タケノコダヨ', '6000', '1', '2025-04-20 17:25:07', '1'),
(119, 'ⅠⅨⅦⅨ0Ⅴ', '5000', '0', '2025-04-23 12:13:21', '1'),
(120, 'ⅠⅨⅦⅨ0Ⅴ', '6000', '1', '2025-04-23 12:22:14', '1'),
(121, 'michiaki1496', '840000', '1', '2025-04-23 13:38:39', '2'),
(122, 'ⅠⅨⅦⅨ0Ⅴ', '36000', '1', '2025-04-23 15:00:46', '1'),
(123, 'ⅠⅨⅦⅨ0Ⅴ', '60000', '1', '2025-04-23 16:00:26', '1'),
(124, '72881276', '6000', '1', '2025-04-23 18:02:44', '1'),
(125, '72881276', '36000', '1', '2025-04-23 19:17:15', '1'),
(126, 'アキラアキラ', '36000', '1', '2025-04-23 19:44:58', '1'),
(127, 'michiaki1496', '2640000', '1', '2025-04-24 10:14:06', '2'),
(129, 'マサミナリタ', '6000', '1', '2025-04-24 13:05:38', '1'),
(131, '72881276', '60000', '1', '2025-04-24 11:58:36', '1'),
(132, 'yoshi0606', '6000', '1', '2025-04-24 15:14:46', '1'),
(133, '1', '1', '0', '2025-04-24 15:49:01', '2'),
(134, '1', '1', '0', '2025-04-24 15:50:50', '2'),
(135, '1', '1', '1', '2025-04-24 15:51:10', '1'),
(136, '81865284731', '1000', '0', '2025-04-24 19:54:31', '0'),
(137, '09024307925', '36000', '1', '2025-04-24 20:14:46', '1'),
(138, 'michiaki1496', '3840000', '1', '2025-04-25 10:29:02', '2'),
(139, '1254KE', '6000', '1', '2025-04-25 15:44:34', '1'),
(140, 'ナカムラ　シゲミツ', '6000', '1', '2025-04-26 12:14:08', '1'),
(141, '090-7852-5619', '120000', '1', '2025-04-26 12:29:27', '2'),
(142, 'ナカムラ　シゲミツ', '36000', '1', '2025-04-26 13:24:52', '2'),
(143, 'アオヤギイオリ', '6000', '1', '2025-04-26 16:28:20', '1'),
(145, 'ナカムラ　シゲミツ', '50000', '1', '2025-04-26 18:26:48', '2'),
(146, 'ナカムラ　シゲミツ', '36000', '1', '2025-04-26 18:22:16', '1'),
(147, 'ナカムラ　シゲミツ', '60000', '1', '2025-04-26 18:37:42', '1'),
(148, 'ナカムラ　シゲミツ', '100000', '1', '2025-04-26 19:23:22', '2'),
(149, 'ナカムラ　シゲミツ', '100000', '1', '2025-04-26 19:31:35', '2'),
(150, 'アオヤギイオリ', '30000', '1', '2025-04-27 10:18:38', '2'),
(151, 'アオヤギイオリ', '36000', '1', '2025-04-27 10:55:35', '1'),
(152, 'アオヤギイオリ', '60000', '1', '2025-04-27 11:48:18', '2'),
(153, 'MARUYAMA', '6000', '1', '2025-04-27 20:59:28', '1'),
(154, 'michiaki1496', '8232000', '1', '2025-04-28 13:42:42', '2'),
(155, 'michiaki1496', '8232000', '1', '2025-04-28 15:21:54', '2'),
(156, 'michiaki1496', '8232000', '1', '2025-04-28 15:27:16', '2'),
(157, 'michiaki1496', '100000', '1', '2025-04-28 16:08:05', '1'),
(158, 'MARUYAMA', '30000', '0', '2025-04-28 16:29:47', '1'),
(159, 'MARUYAMA', '36000', '1', '2025-04-28 17:15:46', '1'),
(160, 'MARUYAMA', '50000', '1', '2025-04-28 18:45:27', '2'),
(161, 'アキラアキラ', '60000', '1', '2025-04-28 19:15:21', '1'),
(162, 'MARUYAMA', '60000', '1', '2025-04-28 19:16:27', '1'),
(163, 'ナリタマサミ', '36000', '1', '2025-05-01 11:10:29', '1'),
(164, 'ナリタマサミ', '60000', '1', '2025-05-01 12:33:05', '1'),
(166, '09023309096', '6000', '1', '2025-05-01 15:23:48', '1'),
(167, '09023309096', '36000', '1', '2025-05-02 10:05:45', '1'),
(168, '09023309096', '60000', '1', '2025-05-02 17:44:54', '1'),
(169, 'hide0519', '6000', '1', '2025-05-04 20:51:45', '1'),
(170, 'MARUYAMA', '2640000', '1', '2025-05-07 11:02:16', '2'),
(171, 'MARUYAMA', '3080000', '1', '2025-05-09 15:51:56', '2'),
(172, 'MARUYAMA', '3080000', '1', '2025-05-09 16:10:16', '2'),
(173, 'シミズヤスジ', '6000', '1', '2025-05-09 19:47:18', '1'),
(174, 'takeyan0120', '12000', '1', '2025-05-13 19:43:55', '1'),
(175, 'てつやおかだ', '6000', '1', '2025-05-14 18:59:49', '1'),
(176, 'takeyan0120', '36000', '1', '2025-05-16 12:54:43', '1'),
(177, 'takeyan0120', '60000', '1', '2025-05-16 13:55:11', '1'),
(178, 'シミズヤスジ', '36000', '1', '2025-05-16 19:46:54', '1'),
(179, 'シミズヤスジ', '60000', '1', '2025-05-17 09:54:17', '2'),
(180, '筋肉質のタクさん', '6000', '1', '2025-05-17 12:03:56', '1'),
(181, '筋肉質のタクさん', '36000', '1', '2025-05-18 10:16:07', '1'),
(182, '筋肉質のタクさん', '60000', '1', '2025-05-18 10:40:50', '1'),
(183, 'takeyan0120', '110000', '1', '2025-05-19 12:53:21', '2'),
(184, 'イシカワ　エイジ', '6000', '1', '2025-05-20 18:00:54', '1'),
(185, '882233', '6000', '1', '2025-05-21 11:31:34', '1'),
(186, '390419', '6000', '1', '2025-05-21 17:24:39', '1'),
(187, '390419', '60000', '1', '2025-05-24 10:45:46', '1'),
(188, '筋肉質のタクさん', '500000', '1', '2025-05-28 16:20:36', '2'),
(189, 'amar2325', '6000', '1', '2025-05-28 19:20:33', '1'),
(190, 'エンドウ　ユウジ', '6000', '1', '2025-05-29 09:55:13', '1'),
(191, 'エンドウ　ユウジ', '30000', '1', '2025-05-29 12:05:21', '2'),
(192, 'エンドウ　ユウジ', '36000', '1', '2025-05-29 12:27:03', '1'),
(197, 'エンドウ　ユウジ', '60000', '1', '2025-05-29 15:25:41', '1'),
(198, '882233', '36000', '1', '2025-05-30 10:59:57', '1'),
(199, 'amar2325', '60000', '1', '2025-05-30 12:30:31', '1'),
(200, '882233', '60000', '1', '2025-05-30 14:26:51', '2'),
(201, '09063086661', '6000', '1', '2025-05-31 17:15:49', '1'),
(202, 'てつやとらとら', '6000', '1', '2025-06-01 13:53:34', '1'),
(203, 'KENJI SAKAI ', '6000', '1', '2025-06-02 09:40:02', '1'),
(204, 'いで　やすふみ', '6000', '1', '2025-06-02 10:10:23', '1'),
(205, 'KENJI SAKAI ', '36000', '1', '2025-06-02 14:06:10', '1'),
(206, '森本たいちゃん', '6000', '1', '2025-06-03 15:06:55', '1'),
(207, 'イシカワ　エイジ', '36000', '1', '2025-06-03 19:40:49', '1'),
(208, 'KENJI SAKAI ', '60000', '1', '2025-06-04 10:32:02', '1'),
(209, 'ししどあきひと', '6000', '1', '2025-06-05 14:02:32', '1'),
(210, 'イシカワ　エイジ', '60000', '1', '2025-06-05 18:20:46', '1'),
(211, 'KENJI SAKAI ', '480000', '1', '2025-06-06 14:12:46', '2'),
(212, 'KENJI SAKAI ', '1680000', '1', '2025-06-09 11:41:13', '2'),
(213, 'naoki88', '6000', '1', '2025-06-09 16:58:16', '1'),
(214, 'amar2325', '720000', '1', '2025-06-10 16:46:37', '2'),
(215, 'アカウント名ラッキー バス', '6000', '1', '2025-06-13 15:52:50', '1'),
(216, 'kaihara', '6000', '1', '2025-06-13 16:52:43', '1'),
(217, 'アカウント名ラッキー バス', '36000', '1', '2025-06-14 10:08:11', '1'),
(218, 'アカウント名ラッキー バス', '60000', '1', '2025-06-14 11:59:35', '1'),
(219, 'クドウコウジ', '6000', '1', '2025-06-15 10:32:34', '1'),
(220, 'クドウコウジ', '36000', '1', '2025-06-15 11:43:30', '1'),
(221, 'クドウコウジ', '60000', '1', '2025-06-15 12:27:15', '1'),
(222, 'KENJI SAKAI ', '3120000', '1', '2025-06-16 11:21:11', '2'),
(223, 'KENJI SAKAI ', '3120000', '1', '2025-06-16 11:25:05', '2'),
(224, 'KENJI SAKAI ', '3120000', '1', '2025-06-16 11:36:36', '2'),
(225, 'KENJI SAKAI ', '50000', '1', '2025-06-16 11:51:36', '1'),
(226, 'KENJI SAKAI ', '3070000', '1', '2025-06-16 12:50:17', '2'),
(227, 'KENJI SAKAI ', '307000', '1', '2025-06-16 12:54:32', '2'),
(228, 'HI-RO27', '6000', '1', '2025-06-17 13:07:31', '1'),
(229, '4848yoshio', '6000', '1', '2025-06-17 13:30:36', '2'),
(230, 'hkひろゆき', '6000', '1', '2025-06-22 10:31:08', '1'),
(231, 'yasai39173', '6000', '1', '2025-06-24 19:37:49', '1'),
(232, 'yasai39173', '30000', '0', '2025-06-24 20:15:39', '2'),
(233, 'yasai39173', '30000', '1', '2025-06-24 21:14:13', '2'),
(235, 'amar2325', '50000', '1', '2025-06-25 15:08:52', '1'),
(236, 'naoki88', '36000', '1', '2025-06-26 20:53:11', '1'),
(237, 'naoki88', '60000', '1', '2025-06-28 20:35:26', '1'),
(238, 'Koichi.osame', '6000', '1', '2025-06-30 10:43:13', '1'),
(240, 'masadayo', '6000', '1', '2025-07-02 16:56:25', '1'),
(241, '0806178', '6000', '1', '2025-07-05 17:57:33', '1'),
(242, 'ラッキー', '960000', '1', '2025-07-07 20:27:19', '2'),
(243, 'ラッキー', '1452000', '1', '2025-07-08 13:17:55', '2'),
(244, 'naoki88', '840000', '1', '2025-07-09 17:52:52', '2'),
(245, 'ラッキー', '5469600', '1', '2025-07-11 11:10:39', '2'),
(246, 'ラッキー', '5469600', '1', '2025-07-11 11:10:39', '2'),
(247, 'ラッキー', '500000', '1', '2025-07-11 11:30:13', '2'),
(248, 'ラッキー', '300000', '1', '2025-07-11 11:33:50', '2'),
(249, 'ラッキー', '100000', '1', '2025-07-11 11:41:35', '1'),
(251, 'カガミマサヒコ', '6000', '1', '2025-07-16 12:15:40', '1'),
(252, 'けいすけ４７', '6000', '1', '2025-07-17 19:19:23', '1'),
(253, 'yoshihito', '6000', '1', '2025-07-22 12:03:03', '1'),
(254, 'KENJI SAKAI ', '4510000', '1', '2025-07-22 14:22:35', '2'),
(255, 'KENJI SAKAI ', '5470000', '1', '2025-07-22 14:31:46', '0'),
(256, 'kazuya0002', '6000', '1', '2025-07-23 19:57:59', '1'),
(258, 'amar2325', '2561600', '1', '2025-07-24 20:49:37', '2'),
(259, 'amar2325', '2709200', '1', '2025-07-24 21:21:48', '2'),
(260, 'amar2325', '2942000', '1', '2025-07-24 21:39:50', '2'),
(261, 'amar2325', '3068000', '1', '2025-07-24 21:57:17', '0'),
(262, 'マツダエイジ', '6000', '1', '2025-07-27 11:51:04', '1'),
(263, 'マツダエイジ', '40000', '1', '2025-07-27 13:11:05', '2'),
(264, 'マツダエイジ', '48000', '1', '2025-07-27 13:24:43', '1'),
(265, 'キムラ　モトヒコ', '6000', '1', '2025-07-27 15:30:22', '1'),
(266, 'キムラ　モトヒコ', '48000', '1', '2025-07-27 19:01:05', '1'),
(267, 'yoshihito', '48000', '1', '2025-07-28 13:51:18', '1'),
(268, 'カズカズカズ', '6000', '1', '2025-07-29 19:12:41', '1'),
(271, 'TJas1801', '6000', '1', '2025-07-31 18:26:53', '1'),
(272, '1314298', '6000', '1', '2025-08-06 20:24:14', '0'),
(273, '家村まさとも', '6000', '1', '2025-08-06 20:43:47', '1'),
(274, '520520', '600', '0', '2025-08-14 17:03:24', '0');

-- --------------------------------------------------------

--
-- 表的结构 `pair`
--

CREATE TABLE `pair` (
  `account` varchar(20) NOT NULL,
  `avatar` varchar(50) NOT NULL,
  `pairAccount` varchar(20) NOT NULL,
  `pairAvatar` varchar(50) NOT NULL,
  `vipCode` varchar(20) NOT NULL,
  `id` int(11) NOT NULL,
  `date` varchar(10) NOT NULL,
  `status` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 表的结构 `square`
--

CREATE TABLE `square` (
  `id` int(11) NOT NULL,
  `account` varchar(20) NOT NULL,
  `avatar` varchar(50) NOT NULL,
  `title` varchar(20) NOT NULL,
  `content` varchar(325) NOT NULL,
  `source` varchar(50) NOT NULL,
  `date` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL,
  `vipGrade` varchar(20) NOT NULL,
  `likes` varchar(10) NOT NULL,
  `comment` varchar(10) NOT NULL,
  `share` varchar(10) NOT NULL,
  `country` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `square`
--

INSERT INTO `square` (`id`, `account`, `avatar`, `title`, `content`, `source`, `date`, `name`, `vipGrade`, `likes`, `comment`, `share`, `country`) VALUES
(1, '123', '24.jpg', 'Sweating profusely o', 'Fitness is not a momentary impulse but a day - by - day perseverance. In this space full of strength, we water the most beautiful flower of figure with our sweat. ', 'Snipaste_2025-02-26_14-52-30.png', '2024-01-23 14:07:05', 'Marry', '3', '65654', '3256', '1325', ''),
(2, '1234', '23.jpg', 'ヨガは私の変身を見届けた ', '私は初めてのときは下手でしたが、今では上手になりました。心も落ち着き、ヨガは私の成長を見てきました。今日もヨガルームでたくさんのことを学びました。', 'Snipaste_2025-02-26_14-51-47.png', '2024-01-23 18:12:23', '樱井 葵', '2', '24515', '35210', '1564', ''),
(3, '12345', 'Snipaste_2025-02-28_21-59-韩国风景14.jpg', '산꼭대기', '주말에 산에 올라가 친구들과 산속에서 놀며 웃었어요. 행복이 이렇게 간단하죠. ', 'Snipaste_2025-02-28_22-00-韩国02.jpg', '2024-02-20 17:16:28', '박지원', '3', '15218', '896', '156', ''),
(4, '123451', 'Snipaste_2025-02-28_22-21-44.jpg', 'I\'m driving to see y', 'Driving with my dog to embrace love, the wind and the dog\'s fur are both sweet.', 'Snipaste_2025-02-28_21-51-美国人44.jpg', '2024-02-21 20:07:00', 'David', '3', '5000+', '999+', '512', ''),
(5, '123452', 'Snipaste_2025-02-28_22-22-44.jpg', 'LOVE PARTY に感謝いたします', 'このプラットフォームで今の妻と出会いました。皆さん、きれいでしょう？', 'Snipaste_2025-02-28_21-35-45.jpg', '2024-02-21 16:06:09', 'さとう けんた', '2', '999+', '258', '12', ''),
(6, '123453', 'Snipaste_2025-02-28_22-11-24.jpg', 'Be at home alone', 'Staying at home taking selfies, I\'m like a mischievous elf. With so many funny expressions and full of joy, each photo is my masterpiece of fun!', 'Snipaste_2025-02-28_21-32-41.jpg', '2024-03-06 12:26:40', 'Emily', '3', '10512', '25112', '3251', ''),
(7, '123454', 'Snipaste_2025-02-28_22-15-头像11.jpg', 'このプラットフォームでイギリス人の彼氏と', 'イギリスに来て、ボーイフレンドと顔合わせ成功！', 'Snipaste_2025-02-28_21-34-56.jpg', '2024-03-13 14:16:17', 'ふじわら しずか', '3', '16521', '7854', '152', ''),
(9, '8', 'Snipaste_2025-03-08_22-15-15.jpg', '인생 조언: 영원히 좋은 일이 곧 일', '어느 날, 제이미는 실업 상태에서 지친 마음으로 집을 나섰다. 그는 수많은 면접을 보았지만, 모두 실패했었다. 그가 길을 걷다가 길가에 있는 작은 고양이를 발견했다. 고양이는 다리가 다치고 울고 있었다. 제이미는 마음이 따뜻해져 고양이를 데리고 동물 병원에 갔다. 병원에서 고양이를 치료하는 동안, 그는 동물 보호 단체의 직원과 친해졌다. 그 직원은 제이미의 마음씨를 인정하고, 단체에서 일할 기회를 제안했다. 이렇게 제이미는 실망의 연속에서 벗어나 새로운', 'Snipaste_2025-03-08_22-15-56.jpg', '2024-03-18 17:20:43', '달빛소녀', '1', '1548', '1951', '152', ''),
(10, '9', 'Snipaste_2025-03-08_22-21-27.jpg', '東京の市街地の美しい景色', '東京タワーはパリのエッフェル塔をモデルにして建設され、高さは 332.6 メートルで、角錐形の鉄塔で、四本の脚で支えられています。全体的なデザインはシンプルで力強さを感じさせ、ラインが流暢で、あらゆる角度から見ても非常に美しさがあります。\n', 'Snipaste_2025-03-08_22-20-59.jpg', '2024-03-18 18:07:18', 'ねこの夢', '2', '2548', '3521', '148', ''),
(11, '7', 'Snipaste_2025-03-08_22-28-19.jpg', '花火の呗', '朝のゴルフ場は、芝生が一面に広がり、草の葉に露がきらきらと光っています。私は草の香りを含んだ空気を深く吸い込み、今日の最初の打ちを準備します。大自然と心地よい対話をすることを楽しみにしています。', 'Snipaste_2025-03-08_22-28-00.jpg', '2024-03-19 15:02:02', 'さくらい みさき', '2', '11502', '53652', '1529', ''),
(12, '10', 'Snipaste_2025-03-09_00-12-17.jpg', '首にチェック柄のマフラーを巻いています', '両手を広げて、まるで雪景色に浸り、喜びに酔っているかのようです。背景は両側に建物が立ち並ぶ通りで、地面や建物には雪が積もっています。通りには黒い車が停まっており、通行人も歩いています。空は青々としており、全体的な雰囲気はすがすがしく明るく、冬の趣をたっぷりと感じさせます 。', 'Snipaste_2025-03-09_00-11-40.jpg', '2024-03-21 14:20:27', 'ほしの あやか ', '1', '5121', '124512', '1211', ''),
(13, '11', 'Snipaste_2025-03-09_00-12-35.jpg', 'に富士山の', '遠くには雄大な富士山が見え、山頂は雪で覆われており、青空の引き立てで格別に壮観です。全体的な画面は濃厚な日本の街並みの風情に満ちており、同時に富士山の美しさも披露しています 。', 'Snipaste_2025-03-09_00-13-15.jpg', '2024-03-24 09:37:31', 'いとう ゆうま ', '2', '1241', '2332', '125', ''),
(14, '12', 'Snipaste_2025-03-09_00-13-42.jpg', 'これは現代的な雰囲気溢れる建物の内部廊下', '独特な幾何学的な造形の柱と穿孔金属の壁面が、シンプルでデザイン性の高い空間を作り出しています 。\n', 'Snipaste_2025-03-09_00-12-52.jpg', '2024-04-10 11:17:06', '（よしおか り', '2', '1241', '12941', '2541', ''),
(15, '13', 'Snipaste_2025-03-09_00-14-08.jpg', '素敵な雰囲気に浸る', '湖は濃い青みを帯び、きらきらと光っています。このシーンはおそらく日本の富士五湖エリアでしょう。そこは富士山の美しい景色を楽しむ絶好の場所の一つです 。', 'Snipaste_2025-03-09_00-14-26.jpg', '2024-03-29 17:17:16', 'ささき ゆう', '0', '1521', '5674', '291', ''),
(16, '13', 'Snipaste_2025-03-09_00-14-56.jpg', 'あなたとお話がしたいです', 'このプラットフォームで本当の愛を見つけることができます。ここでは、たくさんの素敵な人たちと出会えるチャンスがあります。人とのつながりを大切にし、真摯な気持ちで交流すれば、運命の人と出会うかもしれません。本当の愛は時に突然やってきます。このプラットフォームを通じて、あなたの人生に光をもたらす特別な人を見つけましょう。', 'Snipaste_2025-03-09_00-15-57.jpg', '2025-03-15 00:00:00', '佐々木 優奈', '2', '65412', '125421', '12549', ''),
(17, '11', 'Snipaste_2025-03-31_21-14-51.jpg', '恋の奇跡、私の毎日を照らす', '恋愛プラットフォームをきっかけに出会った彼と、これまで想像もできなかった幸せな日々を送っています。初めて目が合った瞬間、心臓が大きく鼓動するような特別な感じがしました。彼の笑顔はいつも私の元に明るい光をもたらしてくれ、どんな辛いことも一緒に乗り越えられる気がします。普段は、お互いの趣味を共有しながら過ごしたり、時にはただ二人でいるだけでも幸せな時間を過ごします。このままずっと一緒にいられることを願って、これからもたくさんの素敵な思い出を作っていきたいです。 #恋愛 #幸せ #奇跡の出会い', 'Snipaste_2025-03-09_00-14-40.jpg', '2025-03-11 13:06:03', 'もりかわ ゆうしん', '2', '87888', '78785', '5588', ''),
(18, '22', 'Snipaste_2025-03-31_21-15-44.jpg', '出会いから、想いが募る日常', '彼との出会いは本当に運命的なものでした。最初のチャットの時から、共通の話題がたくさんあり、時間があっという間に過ぎてしまいました。それから、日々の生活が少しずつ彼との存在で彩られていきました。朝のメッセージで元気にされ、疲れた時には彼の優しい言葉で癒されます。休日には、一緒に旅行に出かけたり、家でゆっくり映画を見たりして、二人だけの特別な時間を大切にしています。彼との出会いが私の人生を素敵に変えてくれたことに感謝しています。 #恋愛中 #幸せな時間 #出会いの喜び', 'Snipaste_2025-03-09_00-12-17.jpg', '2025-03-24 11:15:00', 'かたぎり あやか', '2', '14121', '2554', '774', ''),
(19, '33', 'Snipaste_2025-03-31_21-16-13.jpg', '恋は、小さな幸せの集まり', '恋愛プラットフォームを通じて出会った彼と、毎日が幸せな冒険のようです。彼は私のことを完全に受け入れてくれて、私が本当の自分でいられるようにしてくれます。朝、一緒に朝食を作ったり、夕方には公園を散歩しながら日々の出来事を話し合ったりするのが大好きです。それぞれの小さな喜びや悲しみを共有しながら、二人の絆が深まっていくのが感じられます。この幸せな時間を大切にしながら、これからもずっと一緒にいたいと強く願っています。 #恋愛の喜び #小さな幸せ #二人の絆', 'Snipaste_2025-03-09_00-16-14.jpg', '2025-03-27 10:06:03', 'はせがわ かえで', '2', '33678', '7475', '457', ''),
(20, '44', 'Snipaste_2025-03-31_21-16-33.jpg', '運命の恋、私の人生を変えた', '彼と出会ってから、私の人生は 180 度変わりました。恋愛プラットフォームでの出会いが、私にこんなに素敵な人と出会えるチャンスを与えてくれました。彼は私のパートナーであり、支えでもあります。一緒に困難に立ち向かったり、夢を追い求めたりする過程で、二人の関係がますます強くなっています。普段は、彼の笑顔を見るだけで幸せな気持ちになれます。この幸せをずっと続けていきたいと、心から願っています。 #運命の恋 #人生の転機 #幸せな未来', 'Snipaste_2025-03-09_00-16-26.jpg', '2025-03-28 18:15:29', 'うえの あおい', '2', '678565', '45245', '458', ''),
(21, '55', 'Snipaste_2025-03-31_21-16-59.jpg', '恋に落ちて、幸せな日常を生きる', '恋愛プラットフォームで出会った彼と、幸せな日常を送っています。彼と一緒にいると、どんなことが起こっても心配にならないくらい安心できます。彼は私のことを大切にしてくれるだけでなく、私を成長させてくれる存在でもあります。二人で料理を作ったり、音楽を聴きながら踊ったりするのが好きで、たくさんの楽しい思い出を作ってきました。この幸せな恋を大切にしながら、これからもたくさんの素敵な瞬間を共有していきたいです。 #恋愛中 #幸せな日常 #愛と成長', 'Snipaste_2025-03-09_00-17-06.jpg', '2025-03-29 12:18:02', 'たけうち りょうしん', '2', '77527', '4524', '455', ''),
(23, '3627557', '哪个大神能帮我把后面的人p掉_1_囡囡哇_来自小红书网页版.jpg', '당신을 빛으로 여겨 인연의 길을 밝혀', '인연은 참 기묘하네요. 클럽을 통해 우리가 낯선 사이에서 친숙해지게 되었습니다. 이 사진들을 찍은 후 아마도 사랑 이야기가 방금 시작된 것일지도 모릅니다. ', 'photo_2025-04-07_14-48-49.jpg', '2025-02-01 09:06:00', '이은아', '2', '74748', '7463', '354', 'ko'),
(24, '83737668', '소풍가기 좋은날씨야💥_1_姜马露_来自小红书网页版.jpg', '사랑의 이름으로 당신과 평생 함께 걸', '원래 사랑하는 사람에게 구혼받는 것이 이런 기분이구나, 가득한 기쁨과 무척 안심이에요. 줄곧 당신은 저에게 끝없는 부드러움과 편애를 주었어요. 저는 물론이야, 당신과 손잡고 미래의 날들을 가장 아름다운 시로 만들겠습니다.', 'Snipaste_2025-04-07_21-23-54.png', '2024-12-12 19:02:02', '윤진', '2', '45664', '7543', '353', 'ko'),
(25, '8534325', '鱼尾狮_1_Snake Eyes_来自小红书网页版.jpg', 'Starting from the mo', '濱海灣花園的擎天大樹下，我們的身影被燈光拉長，交織在一起。每一片閃爍的燈火，都見證著此刻我望向你時，眼中藏不住的愛意，願時光停駐，我們的愛如這花園的繁茂永不落幕 。 ', 'Snipaste_2025-04-07_22-06-14.png', '2024-07-17 21:00:12', 'Jack', '2', '46655', '6656', '543', 'zh'),
(26, '9683789', 'Snipaste_2025-04-09_16-52-03.png', 'What does it matter ', 'Without too many words, just quietly being with you makes the time wonderful enough.', 'photo_2025-04-07_14-44-美国.jpg', '2025-01-16 20:05:02', 'Leo', '2', '74223', '4326', '432', '英国'),
(27, '54637373', 'Snipaste_2025-04-09_17-07-07.png', '記錄人間美好 / 生活碎片', '祈盼在茫茫人海中，與你不期而遇，從此譜寫屬於我們的浪漫情章。', 'photo_2025-04-07_14-49-35.jpg', '2025-04-07 08:01:02', '許孜薈', '2', '24876', '2132', '232', 'zh'),
(28, '6473563', 'Snipaste_2025-04-09_17-16-12.png', 'Looking for someone ', 'I\'m longing for her to enjoy the scenery with me and unlock the door to love. ', 'Snipaste_2025-04-09_17-14-39.png', '2025-03-26 11:02:02', 'Oliver', '2', '13653', '1265', '233', '英国'),
(29, '3246678', '🎢🌍Universal in SG🇸🇬!!_1_Vvvicky_^_来自小红书网页版.jpg', '與你共赴浪漫宇宙', '和外國男友談戀愛，語言雖有不同，但一個眼神、一個微笑，愛意便能心領神會，浪漫滿分。', 'photo_2025-04-07_16-53-24.jpg', '2024-10-01 14:08:00', '李詩涵', '2', '63628', '2886', '930', 'zh'),
(31, '4224821', 'Snipaste_2025-04-09_17-43-27.png', '혼자인 여행, 사랑과의 만남을 기다리', '앞으로의 세월에 운명으로 만난 그 사람과 따뜻하고 따뜻한 작은 집에서 함께 살기를 바랍니다. 아침에 일어나 상대방을 위해 아침 식사를 준비하고 밤에는 함께 안고 자서 매일의 잡다한 일에도 단콩이 가득 찰 수 있도록 합니다.  ', 'Snipaste_2025-04-07_21-14-55.png', '2025-01-30 21:02:14', '이민정', '2', '73328', '5432', '674', 'ko'),
(32, '778558', 'Snipaste_2025-04-09_18-07-41.png', '护照上的爱情：跨国恋的奇妙旅程', '本以为美国只是工作的中转站，没想到在旧金山的艺术街区，与 他 的相遇，开启了我甜蜜炽热的爱情篇章', 'Snipaste_2025-04-07_17-17-39.png', '2024-08-22 22:02:02', 'Linda', '2', '58852', '3321', '187', '英国'),
(34, '680448', 'Snipaste_2025-04-09_18-57-36.png', 'Our love blossoms al', 'Encountering around the corner, it turns out you are the love of my life.', 'photo_2025-04-07_14-52-24.jpg', '2025-02-27 04:01:02', 'Skylar ', '2', '36164', '9792', '459', '英国'),
(35, '662213', 'Snipaste_2025-04-09_19-04-02.png', '桜吹雪の中で、恋の予感が広がる', '雪の世界を歩きながら、足元でキシキシと音がする。あなたの手が私の手をしっかり握っていて、暖かさが心の底から広がっていきます。 ', 'Snipaste_2025-04-07_16-56-55.png', '2024-12-30 10:42:00', 'さとう ゆうな', '2', '15362', '5578', '200', 'jp'),
(36, '742965', 'Snipaste_2025-04-09_19-15-48.png', '我們的愛情故事開場', '承蒙平台的見證，讓我們的愛情有了別樣的意義，那些分享過的日常，都成為愛情路上最美的點綴。', 'Snipaste_2025-04-07_23-08-14.png', '2024-07-07 20:54:00', '朱以均', '2', '88392', '3732', '957', 'zh'),
(37, '760998', 'Snipaste_2025-04-09_19-28-49.png', '한국 드라마 속의 사랑 장면이 우리 ', '우리가 서로 알게 된 그 순간부터 내 마음은 너의 것이 되었어. 앞으로 어떤 어려움이 닥쳐도 난 너의 곁에 함께 있어 너와 함께 직면하길 원해. 너는 내 생명에서 가장 소중한 사람이야. 내 모든 힘을 다해 너를 사랑하고 지켜줄게. ', 'Snipaste_2025-04-07_16-54-58.png', '2024-12-18 16:41:23', '박서준', '2', '75027', '6353', '269', 'ko'),
(38, '488789', 'Snipaste_2025-04-09_20-47-35.png', '너에게 특별한 사랑을 주고 영원히 곁', '널 사랑해. 그것은 아침에 눈을 뜨자마자 너의 모습을 찾는 그 그리움, 밤에 잠들기 전에 너의 미소를 떠올리는 그 안심감이야. 이 사랑은 이미 내 삶의 모든 틈새에 스며들어 있단 거야. ', 'Snipaste_2025-04-09_20-59-54.png', '2025-04-08 22:07:01', '유준범', '2', '88981', '4981', '575', 'ko'),
(39, '663223', 'Snipaste_2025-04-09_21-09-42.png', 'One glance, an etern', 'I can\'t imagine my life without you. You\'ve become the most important part of me, and I love you like crazy.', 'photo_2025-04-07_16-51-58.jpg', '2025-04-22 18:04:00', 'Emma', '2', '36590', '4362', '567', '英国'),
(40, '295935', 'Snipaste_2025-04-10_10-15-55.png', 'わたし と わたし の いこく の こい', 'やっとあなたと一緒にイギリスに戻ってきました。私たちの愛情は、まるで星と海の間を駆け抜けるようなものです。あなたは異国のロマンチックな雰囲気を纏って私の生活に飛び込んできて、私は優しさと繊細さを胸にあなたの世界に入りました。私たちは一緒にお互いの文化の魅力を探り、違った風味の美食を味わい、違いの中で美しさを見つけました。 ', 'photo_2025-04-07_16-13-47英国玩.jpg', '2024-06-20 22:36:19', 'さいおん', '2', '19532', '7756', '191', 'jp'),
(41, '460122', 'Snipaste_2025-04-10_10-28-11.png', '海畔，與你相擁的每寸時光', '愛人牽起我的手，在沙灘寫下 “永遠”，海浪試圖沖刷，卻沖不淡我們在海邊許下的永恆誓言 。', 'Snipaste_2025-04-07_23-06-19.png', '2024-07-24 16:15:18', '霖涵欣', '2', '26560', '8688', '579', 'zh'),
(42, '108540', 'San Miguel圣米格尔🏜️上帝打翻的调色盘_2_Lisa陳多多_来自小红书网页版.jpg', 'Currently single, lo', 'On the Soul Mate platform, I am sincerely seeking a mature and steady man. He doesn\'t necessarily have to achieve extraordinary feats. However, the most important thing is that he has a peaceful and loving heart. I hope he is understanding and magnanimous', 'Snipaste_2025-04-10_11-04-40.png', '2025-03-26 11:16:19', 'Stella', '2', '57673', '9210', '225', '英国'),
(43, '190146', 'photo_2025-04-07_17-59-02.jpg', '가장 사랑하는 사람이 곁에 있어서 평', 'Soul Mate에 처음 오게 된 때 나는 많은 사람들과 마찬가지로 사랑에 대한 동경을 품고 있었고, 동시에 약간의 불안감도 느꼈습니다. 이 가상의 인터넷 세계에서 나는 내 영혼과 어울리고, 여생을 함께 걸어갈 그 사람을 찾기를 바랐습니다. 제 자신의 정보를 조심스럽게 작성하고 가능한 모든 인연을 열심히 살펴보았는데, 그런데 내게 맞는 사람이 조용히 다가오고 있었던 것입니다. ', 'Snipaste_2025-04-07_21-16-27.png', '2024-08-21 16:32:11', '서연', '2', '87742', '9791', '343', 'ko'),
(44, '159482', '在家楼下的餐厅享受独处时光👍思考人生😀_1_Michael Yuen_来自小红书网页版.jpg', 'Looking for a girl w', 'If you\'re also a woman seeking a sincere emotional connection and think we might be a great match, don\'t hesitate to contact me. Let\'s embark on this exciting journey together and see where it leads us. Looking forward to meeting you!', 'Snipaste_2025-04-10_12-29-19.png', '2024-07-25 09:17:11', 'Jack', '2', '41006', '5234', '680', '英国'),
(47, '723356', 'Snipaste_2025-05-31_14-41-19.jpg', '私のラブストーリーは、プラットフォームか', 'プラットフォームで、私は人生で最も大切な人に出会いました。このご縁は、私に奇跡のような愛を信じさせてくれました！プラットフォームのおかげで、この幸せを手に入れることができました！', '京都情侣浴衣体验🎆花小钱甜爆朋友圈🌍_1_日本kimono和服体验_来自小红书网页版.jpg', '2025-06-05 15:29:36', 'サクラ', '2', '62511', '2977', '674', 'jp'),
(48, '830663', '一年了！终于结束异地恋了❤️_1_樱花野肉（常驻东京）_来自小红书网页版.jpg', '出会いはプラットフォームから、幸せが溢れ', '運命の糸！プラットフォームで運命の人に出会いました！', '中日情侣结婚汇报🎎夫婦になりました_1_东京明日發_来自小红书网页版.jpg', '2025-06-05 16:12:26', 'リコ', '2', '77437', '9745', '594', 'jp'),
(49, '809869', '849dad3c-911d-4635-9a09-135f567d5b3e.jpg', 'Here\'s a suggestion ', ' Finally Tried That Restaurant with My Bestie! 🍽️✨\nContent: After hearing so much about this place, we finally made it! The food was amazing and the atmosphere cozy. Perfect day out with my favorite partner in crime. Can’t wait to come back!\n', '8b3a5e3d-1f84-4996-9994-fa179f0d3a2d.jpg', '2025-07-03 13:14:02', ' James Anderson', '2', '26495', '5622', '296', 'en');

-- --------------------------------------------------------

--
-- 表的结构 `staff`
--

CREATE TABLE `staff` (
  `name` varchar(20) NOT NULL,
  `inviteCode` varchar(10) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `staff`
--

INSERT INTO `staff` (`name`, `inviteCode`, `id`) VALUES
('阿虎', '1801', 1),
('哪吒', '1568', 2),
('暂停', '1803', 3),
('阿九', '1806', 6),
('暂停', '1807', 7),
('零一', '1809', 11),
('阿超', '1810', 13),
('阿岸', '1811', 14),
('阿羊', '1816', 16),
('阿斌', '1815', 17),
('欧美', '1208', 19),
('一个好人', '1817', 20),
('大鑫', '1808', 21),
('阿正', '1803', 23),
('暴富', '1816', 24),
('小宇', '1812', 25);

-- --------------------------------------------------------

--
-- 表的结构 `sysdata`
--

CREATE TABLE `sysdata` (
  `errorMoney` varchar(20) NOT NULL COMMENT '数据错误集',
  `profit` varchar(10) NOT NULL COMMENT '返利百分比',
  `id` int(11) NOT NULL,
  `lang` varchar(20) NOT NULL DEFAULT 'jp' COMMENT '语言',
  `errorSwitch` varchar(10) NOT NULL DEFAULT '0' COMMENT '数据错误开关',
  `profixSwitch` varchar(10) NOT NULL DEFAULT '0' COMMENT '是否返利',
  `initMoney` varchar(20) NOT NULL DEFAULT '0' COMMENT '注册默认余额',
  `switch` varchar(10) NOT NULL DEFAULT '0' COMMENT '当前语言系统'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `sysdata`
--

INSERT INTO `sysdata` (`errorMoney`, `profit`, `id`, `lang`, `errorSwitch`, `profixSwitch`, `initMoney`, `switch`) VALUES
('25000.50000', '20', 1, 'jp', '0', '0', '6000', '1'),
('', '20', 2, 'en', '', '', '', '0'),
('', '', 3, 'vi', '', '', '', '0'),
('', '', 4, 'ko', '', '', '', '0'),
('', '', 5, 'zh', '', '', '', '0');

-- --------------------------------------------------------

--
-- 表的结构 `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `account` varchar(20) DEFAULT NULL,
  `password` varchar(20) DEFAULT NULL,
  `inviteCode` varchar(20) DEFAULT NULL,
  `dataError` varchar(20) DEFAULT '0',
  `dataErrorNum` varchar(50) NOT NULL,
  `age` varchar(20) DEFAULT NULL,
  `gender` varchar(20) DEFAULT NULL,
  `bankCard` varchar(255) DEFAULT NULL,
  `money` varchar(20) DEFAULT NULL,
  `avatar` varchar(255) DEFAULT NULL,
  `vipCode` varchar(20) DEFAULT NULL,
  `createDate` varchar(20) NOT NULL,
  `vipGrade` varchar(20) NOT NULL COMMENT '0一般用户 1普通会员 2高级会员 3至尊会员',
  `name` varchar(20) NOT NULL,
  `vipStatus` varchar(20) NOT NULL COMMENT '0制作中  1未激活 2激活中 3已激活',
  `likeSquare` varchar(255) NOT NULL,
  `city` varchar(30) NOT NULL,
  `remake` varchar(500) NOT NULL,
  `lineCode` varchar(20) NOT NULL,
  `pairAccount` varchar(20) NOT NULL,
  `pz` varchar(50) NOT NULL,
  `pz1` varchar(50) NOT NULL,
  `pz2` varchar(50) NOT NULL,
  `voteFlag` varchar(10) NOT NULL DEFAULT '1' COMMENT '是否可以投票',
  `staffName` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `users`
--

INSERT INTO `users` (`id`, `account`, `password`, `inviteCode`, `dataError`, `dataErrorNum`, `age`, `gender`, `bankCard`, `money`, `avatar`, `vipCode`, `createDate`, `vipGrade`, `name`, `vipStatus`, `likeSquare`, `city`, `remake`, `lineCode`, `pairAccount`, `pz`, `pz1`, `pz2`, `voteFlag`, `staffName`) VALUES
(2, '12345', '12345', '1208', NULL, '', '26', '女', NULL, '1686986', 'Snipaste_2025-02-28_22-13-头像38.jpg', '566814', '2025-02-26 17:29:35', '3', '박지원', '3', '21', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(3, '1234', '123456', '8888', '0', '', '25', '女', '', '54000', '10011.jpg', '566814', '2025-02-26 17:30:40', '3', '田中麗奈', '3', '23751161513', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '1', ''),
(20, '123', '123', '1108', NULL, '', '22', '女', NULL, '88000', 'Snipaste_2025-02-26_14-21-25.png', '566814', '2025-02-25 16:37:10', '3', '千本', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(29, '158168688', '123321', '1208', '1', '', NULL, '男', NULL, '280000', 'IMG_0061.png', '558623', '2025-03-09 16:56:05', '1', '長澤まさみ', '3', '', '', '', '', '', '', '', '', '', ''),
(31, 'なおきいしかわ', 'undefined', 'undefined', 'undefined', '', 'undefined', 'undefined', 'undefined', '0', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(32, 'yj773707', '773707', '1208', '', '', '', '男', '', '100', 'photo_2025-01-28_15-58-32.jpg', '', '2025-03-09 17:12:29', '1', '11', '0', '', '', '', '', '', '', '', '', '', ''),
(33, '1314520', '12345678', '1208', '', '', '', '男', '', '', '', '799409', '2025-03-09 21:53:45', '', '', '', '', '', '', 'undefined', '', '', '', '', '', ''),
(34, '258963', '258963', '1208', NULL, '', NULL, '男', NULL, '653000', 'image_1 (14).png', '957763', '2025-03-10 11:12:47', '3', '佐藤優奈', '3', '14', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(35, 'fukuda', 'undefined', 'undefined', 'undefined', '', 'undefined', 'undefined', 'undefined', '6000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(36, '1212123', '123456', '1208', NULL, '', NULL, '男', NULL, '160000', 'IMG_0119.jpeg', '257354', '2025-03-10 15:43:37', '3', '花泽美穗', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(37, 'ユタユタゆたか', 'undefined', 'undefined', '1', '', 'undefined', 'undefined', 'undefined', '720000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(38, 'kaede', 'Aa123456..', '168168', '', '', '', '女', '', '980000', 'IMG_0057.jpeg', '657892', '2025-03-12 20:45:24', '3', '矢野枫', '3', '', '', '阿鑫女主', 'chinatsu01', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(39, '09074334179', 'undefined', 'undefined', 'undefined', '', 'undefined', 'undefined', 'undefined', '6000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(40, '09074334179', 'undefined', 'undefined', 'undefined', '', 'undefined', 'undefined', 'undefined', '0', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(41, '09074334179', 'undefined', 'undefined', 'undefined', '', 'undefined', 'undefined', 'undefined', '-36000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(42, '16808', '123456', '1208', NULL, '', NULL, '女', NULL, '650000', 'image_2 (6).png', '336258', '2025-03-13 10:37:57', '3', 'タナカ チシマ', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(43, 'ユタユタゆたか', '', '', '0', '', '', '', '', '480000', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(44, '16887', '123456', '268710', '', '', '', '女', '', '522000', 'IMG_0007.jpeg', '668893', '2025-03-13 10:40:43', '3', '中村優里', '3', '', '', '阿九', 'colourfulblack', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(45, 'ユタユタゆたか', 'undefined', 'undefined', '1', '', 'undefined', 'undefined', 'undefined', '480000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(46, 'mkjy5186', 'AA123456aa', '1208', NULL, '', NULL, '女', NULL, '583000', 'image_0 (2).png', '896558', '2025-03-13 11:41:27', '3', 'ミソラ ユイ', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(48, 'rina', 'AA123456..', '1208', NULL, '', NULL, '女', NULL, '520000', 'IMG_0058.jpeg', '852006', '2025-03-13 14:11:49', '3', '吉冈梨奈', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(49, 'ユタユタゆたか', 'undefined', 'undefined', '1', '', 'undefined', 'undefined', 'undefined', '600000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(50, 'ユタユタゆたか', 'undefined', 'undefined', '1', '', 'undefined', 'undefined', 'undefined', '-20000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(51, 'love', '102431', '1208', '0', '', NULL, '女', NULL, NULL, NULL, NULL, '2025-03-14 16:10:41', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(52, '893538736', '893538736', '980895', '0', '', '', '女', '', '600000', 'Snipaste_2025-02-18_21-19-51.png', '857537', '2025-03-14 16:33:07', '3', 'ヤマモト ミコ', '3', '', '', '阿虎', 'ccca0008', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(53, 'zz3222378911', 'zz3222378911', '1208', '0', '', '', '女', '', '600000', 'Snipaste_2025-02-19_16-50-05.png', '827947', '2025-03-14 16:43:22', '3', 'ヤマモト アヤコ', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(55, '孤独なこうじ', 'undefined', 'undefined', 'undefined', '', 'undefined', 'undefined', 'undefined', '6000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(56, '2589633', '2589633', '545935', '0', '', '', '女', '', '600000', 'image_0 (26).png', '177054', '2025-03-15 15:17:16', '3', 'ヨシカワ ケイコ', '3', '', '', '阿爆', 'chiba770', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(57, '112233', '123456', '126889', '0', '', '', '女', '', '880000', 'IMG_0138.jpeg', '644654', '2025-03-16 19:32:14', '3', '铃木美穗', '3', '', '', '阿雄', 'ycly001', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(58, 'Qwe8686886 ', 'qwe8686886', '842369', '0', '', '', '女', '', '300000', 'IMG_0066.jpeg', '942769', '2025-03-17 09:41:42', '3', '青柳沙織', '3', '', '', '阿龙', 'ccca0005', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(59, 'ニシダサネヒト', 'tatsugou', '1208', '0', '', '', '男', '', '30000', 'IMG_0068.jpeg', '141432', '2025-03-17 10:50:08', '1', '西田真仁', '0', '', '', '', '', '', '', '', '', '', ''),
(61, '08018458895', 'kenji1016', '1208', '0', '', '', '男', '【銀行名】:  仙北信用組合\n【支店名】:  本店\n【支店番号】:  001\n【口座番号】:  1104932\n【口座名義】:鈴木健二', '144000', 'IMG_3634.jpeg', '238319', '2025-03-17 17:12:59', '1', '鈴木　健二', '0', '', '', '阿九客户  第三步第二回', 'undefined', '', '', '', '', '', ''),
(62, 'Aung san lin', 'myothulin298', '1208', '0', '', '', '男', '', '0', 'IMG_0047.jpeg', '985125', '2025-03-18 18:46:40', '1', 'Aung san lin', '0', '', '', '阿雄客户  退了7000  冲了20000', 'undefined', '', '', '', '', '', ''),
(63, 'izumis18', 'izumi8020', '1208', '0', '', '', '男', '【銀行名】:  三菱UFJ銀行\n【支店名】:  深川支店\n【支店番号】:  086\n【口座番号】:  4620844\n【口座名義】:  杉浦伊豆美', '0', 'IMG_20230521_140107.jpg', '', '2025-03-19 14:07:04', '1', '杉浦伊豆美', '0', '', '', '阿虎客户  充5000已提现6000  第一步未办理', '', '', '', '', '', '1', ''),
(64, 'izumi1116s@Gm', 'izumi8020', '1208', '0', '', NULL, '男', NULL, NULL, 'IMG_20250319_144231.jpg', NULL, '2025-03-19 14:36:25', '1', '杉浦伊豆美', '0', '', '', '', '', '', '', '', '', '', ''),
(66, '62676656', 'qwe123321', '1208', '0', '', NULL, '女', NULL, NULL, NULL, NULL, '2025-03-20 22:07:32', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(67, 'lovepartya', '102431', '950505', '0', '', '', '男', '', '600000', 'IMG_1063.jpeg', '', '2025-03-21 10:05:30', '3', '桜井奈々', '3', '', '', '', 'loveparty1', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(68, 'ずもとこういち', 'kz5768nz', '1208', '3', '', '', '男', '【銀行名】:  みずほ銀行\n【支店名】:  尼崎支店\n【支店番号】:  600\n【口座番号】:  600-3052751-01\n【口座名義】: ズモトコウイチ', '600000', 'Screenshot_20250416-114403.png', '', '2025-03-21 15:04:49', '1', 'ズモトコウイチ', '0', '', '', '阿虎客户  数据出错第二步 6.10之前联系我  女主帮他冲了5万注册费和5w延期费', '', '', '', '', '', '0', '阿虎'),
(69, 'fukuda', '68026802', '1208', '0', '', '', '男', '', '6000', 'PXL_20250322_073537469.jpg', '', '2025-03-22 15:24:40', '1', '福田', '0', '', '', '阿九客户  第一步未完成', 'undefined', '', '', '', '', '', ''),
(70, 'なおきいしかわ', 'skni371214', '1208', '0', '', '', '男', '', '0', '', '', '2025-03-22 15:35:59', '0', '', '', '', '', '哪吒客户  第一步未完成', 'undefined', '', '', '', '', '', ''),
(72, '156889', '123321', '1208', '0', '', '', '女', '', '720000', 'IMG_0046.jpeg', '165377', '2025-03-22 16:03:42', '3', '桜木奈子', '3', '', '', '哪吒', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(73, 'ユタユタゆたか', 'yutayuta0406', '1208', '1', '', '', '男', '【銀行名】十六銀行\n【支店名】カラフルタウン岐阜出張所\n【支店番号】103\n【口座番号】1174129\n【口座名義】オガワユタカ', '720000', '', '973169', '2025-03-25 11:53:32', '0', '', '', '', '', '哪吒客户  第3步进行中', 'undefined', '', '', '', '', '', ''),
(74, 'qwe 7576', 'qwe8686', '1208', '0', '', '', '男', '', '120000', 'photo_2025-03-25_15-02-46.jpg', '666596', '2025-03-25 14:38:09', '3', '佐藤雅子', '3', '', '', '阿龙', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(75, '09074334179', 'aespa0121', '1208', '0', '', '', '男', '', '0', '', '636165', '2025-03-25 15:15:19', '0', '', '', '', '', '阿虎客户  第2步进行中', 'undefined', '', '', '', '', '', ''),
(76, '123456', '123466', '1208', '0', '', '', '男', '', '120000', '10074.jpg', '668898', '2025-03-25 15:21:59', '3', '星野璃奈', '3', '', '', '阿亮', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(77, '1234567', '1234567', '1208', '0', '', '', '女', '', '120000', '10075.jpg', '687898', '2025-03-25 18:55:15', '3', '佐藤千夏', '3', '', '', '阿亮', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(78, '08060931376', 'butta1376', '1208', '0', '', '', '男', '', '178000', 'IMG_1451.jpeg', '926261', '2025-03-28 14:28:59', '1', '', '0', '', '', '阿龙客户', '', '', '', '', '', '', ''),
(79, 'snari3', '123456', '1208', '0', '', '', '男', '', '0', 'IMG_0005.jpeg', '426677', '2025-03-28 15:53:06', '1', '成松重吉', '0', '12,', '', '', 'undefined', '', '', '', '', '', ''),
(80, 'なりまつしげよし', '760233', '1208', '0', '', '', '男', '', '', '', '185281', '2025-03-28 16:10:57', '0', '', '', '', '', '', 'undefined', '', '', '', '', '', ''),
(81, '孤独なこうじ', '48156269', '1208', '0', '', '', '男', '', '6000', 'IMG_7171.jpeg', '806523', '2025-03-28 16:30:10', '1', '孤独なこうじ', '0', '', '', '', 'undefined', '', '', '', '', '', ''),
(82, '905257', '905257', '1208', '0', '', '', '男', '', '', '', '280356', '2025-03-28 16:36:34', '0', '', '', '', '', '', 'undefined', '', '', '', '', '', ''),
(83, 'コナンキュウ', '02114713', '1208', '0', '', '', '男', '', '0', 'line_90356657273864.jpg', '973241', '2025-03-28 16:51:38', '1', '', '0', '', '', '', 'undefined', '', '', '', '', '', ''),
(84, '12345678', '12345678', '1208', '0', '', '', '女', '', '120000', '10346.jpg', '775825', '2025-03-29 11:16:11', '3', '星野璃奈', '3', '', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(86, '25896333', '25896333', '1208', '0', '', '', '女', '', '120000', 'image_1 (36).png', '886968', '2025-03-29 11:36:38', '3', 'ナツメ モモコ', '3', '', '', '阿爆', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(87, 'Boohfree', 'Naobooh', '1208', '1', '', '', '男', '', '100000', 'Snipaste_2025-04-01_12-39-48.jpg', '', '2025-03-29 18:51:24', '1', 'ワタナベ　ナオキ', '0', '', '', '', 'undefined', '', '', '', '', '', ''),
(88, 'Booh free', 'Naoboo', '1208', '0', '', NULL, '男', NULL, NULL, NULL, NULL, '2025-03-29 18:52:31', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(89, '158910355', '158910355', '1208', '0', '', '', '女', '', '600000', 'Snipaste_2025-02-17_19-32-25.png', '667719', '2025-03-30 11:02:02', '3', 'ヤマナカ ナオミ。', '3', '', '', '阿虎', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(90, '6389547048', '6389547048', '1208', '0', '', '', '女', '', '600000', 'Snipaste_2025-05-04_14-35-31.png', '375769', '2025-03-30 11:12:08', '3', 'ヤマナカ ミコ', '3', '', '', '阿虎', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(91, '362314', '123456', '1208', '0', '', '', '女', '', '600000', 'IMG_0119.jpeg', '471132', '2025-03-30 11:14:51', '3', '花泽美穗', '3', '', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(92, '090-7852-5619', 'toshi5610', '1208', '0', '', '', '男', '', '120000', '色調補正_20250330_154342.jpg', '835776', '2025-03-30 12:31:42', '1', 'トッシー', '1', '', '', '阿亮客户', '', '', '', '', '', '1', '阿亮'),
(93, '168885', '123456', '1806', '0', '', '', '女', '', '600000', 'image_何以解忧，唯有退休……___退休..._1.png', '713790', '2025-03-30 14:08:49', '3', ' Hannah', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(94, '168889', '123456', '1208', '0', '', '', '女', '', '600000', '封面1.png', '485646', '2025-03-30 14:15:29', '3', 'ナカムラ ユウリ', '3', '', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(95, '168887', '123456', '1208', '0', '', '', '女', '', '600000', 'image_0 (500).png', '580705', '2025-03-30 14:17:04', '3', 'ナカムラ ユウリ', '3', '', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(97, 'rxqz9912', 'AA123456aa', '1208', '0', '', '', '女', '', '620000', 'Screenshot_20250330_161601.jpg', '174037', '2025-03-30 15:40:15', '3', 'ヒナタ ハルコ', '3', '', '', '阿头', 'atat586', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(98, 'scxn521', 'AA123456aa', '1208', '0', '', '', '女', '', '620000', '1743322959313.jpg', '753612', '2025-03-30 16:31:30', '3', 'モリカワ サチノ', '3', '', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(99, 'scyz818', 'AA123456aa', '1208', '0', '', '', '女', '', '600000', 'IMG_20250330_164645.jpg', '582973', '2025-03-30 16:50:06', '3', 'イシハラ サクラコ', '3', '', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(100, 'エルヴィン　スミス11', 'Haruki1318', '1208', '1', '', '', '男', '', '120000', 'IMG_2128.jpeg', '958435', '2025-04-01 12:06:02', '1', 'エルヴィン　スミス', '0', '', '', '', 'undefined', '', '', '', '', '', ''),
(101, '111111', '111111', '168168', '1', '', '', '女', '', '716000', 'Snipaste_2024-11-15_10-44-52.png', '347426', '2025-04-02 10:49:23', '3', 'あさの ちなつ', '3', '', '', '', '', '', 'IMG_0002.jpeg', '', '', '1', ''),
(102, '15666', '123321', '158688', '', '', '', '女', '', '280000', 'IMG_0061.png', '857852', '2025-03-10 14:16:37', '3', '長澤まさみ', '3', '', '', '哪吒', 'maz58898', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(103, 'Yuuma0500', 'Aa123456..', '1208', '0', '', '', '男', '', '120000', 'IMG_0079.jpeg', '415530', '2025-04-02 11:08:43', '3', '神田由真', '3', '', '', '阿鑫', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(104, 'Qwe7575775', 'qwe8686886', '1208', NULL, '', NULL, '女', NULL, '520000', 'IMG_0055.jpeg', '357143', '2025-03-11 16:52:29', '3', '美奈子', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(105, 'loveparty1', '102431', '950505', '0', '', '', '男', '', '600000', '', '', '2025-03-20 11:49:33', '', '', '3', '', '', '', '', '', '', '', '', '', ''),
(106, 'TETU0523', 'Tetu2451', '1208', '0', '', '', '男', '', '0', 'IMG_1028.jpeg', '585866', '2025-03-14 16:50:32', '1', 'T2', '0', '', '', '', '', '', '', '', '', '', ''),
(107, 'yukino', 'Aa123456..', '1208', 'undefined', '', 'undefined', '女', '', '660000', 'IMG_0059.jpeg', '225689', '2025-03-13 14:14:14', '3', '森川雪乃', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(108, '16885', '123456', '1208', NULL, '', NULL, '女', NULL, '773000', 'IMG_0005.jpeg', '664599', '2025-03-13 10:35:51', '3', '春島優井', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(109, '16889', '123456', '1208', NULL, '', NULL, '女', NULL, '660000', 'IMG_0001.jpeg', '685551', '2025-03-13 10:25:29', '3', '早川奈子', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(110, '16888', '123456', '1208', NULL, '', NULL, '男', NULL, '450000', 'IMG_0001.jpeg', '558212', '2025-03-13 10:21:59', '3', '早川奈子', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(111, '6535333', 'aa123456', '1208', '', '', '', '女', '', '', '', '674534', '2025-03-09 17:11:57', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(112, '88998899', '123456789', '1208', '', '', '', '男', '', '', '', '120283', '2025-03-09 17:09:23', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(113, '222222', '222222', '158688', '0', '', NULL, '男', NULL, NULL, NULL, '474472', '2025-04-03 11:30:57', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(115, 'takahara', 'tkhr1834', '1208', '0', '', '', '男', '', '0', 'DSC_0001.JPG', '102066', '2025-04-03 19:50:36', '1', 'takahara', '0', '', '', '', '', '', '', '', '', '', ''),
(116, 'gxfc158968', '123321', '1208', '0', '', NULL, '男', NULL, NULL, NULL, '250199', '2025-04-03 20:02:35', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(117, '743163190', 'sx362314', '1208', '0', '', '', '女', '', '120000', 'IMG_0155.jpeg', '667503', '2025-04-04 10:17:49', '3', '夏目葵', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(118, 'H2117256981', 'qwe8686886', '1208', '0', '', '', '男', '', '350000', 'IMG_0081.jpeg', '478875', '2025-04-05 15:49:09', '3', '青柳沙織', '3', '', '', '阿龙', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(119, 'アグニシゲヤ', 'invader', '1208', '0', '', '', '男', '【銀行名】:  琉球銀行\n【支店名】:  古島支店\n【支店番号】:  332\n【口座番号】:  199044\n【口座名義】:  粟国　滋也', '3000', 'FB_IMG_1685348147632.jpg', '444502', '2025-04-05 16:59:23', '1', 'アグニシゲヤ', '0', '17,', '', '', '', '', '', '', '', '', ''),
(120, '86112311', '880264', '1208', '0', '', '', '男', '', '0', '', '766465', '2025-04-05 17:16:28', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(121, 'asd125', '123456', '1208', '0', '', NULL, '男', NULL, NULL, NULL, '359130', '2025-04-05 17:52:18', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(122, 'asd123', '123456', '1208', '0', '', NULL, '男', NULL, NULL, NULL, '739698', '2025-04-05 17:58:53', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(123, 'love850301', '123456', '1208', '0', '', '', '女', '', '120000', '10041.jpg', '274800', '2025-04-06 11:06:25', '3', '宮崎絵梨', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(124, 'mina88800', 'Aa123456..', '1208', '0', '', '', '女', '', '120000', 'image_学会“留弱”，而非处处争强～__..._0.png', '453144', '2025-04-06 15:13:31', '3', 'コバヤシ ミナ', '3', '', '', '阿超', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(125, 'KOHMIYA', 'km1020', '1208', '0', '', '', '男', '【銀行名】:  常陽銀行\n【支店名】:  谷和原支店\n【支店番号】:  159\n【口座番号】:  1245050\n【口座名義】:  宮本幸一', '30000', '1730263996870.jpg', '631522', '2025-04-06 16:33:34', '1', '宮本幸一', '0', '', '', '阿超客户', '', '', '', '', '', '', ''),
(126, 'noboru', '05219663', '1208', '0', '', '', '男', '', '0', '1743650870230.jpg', '672628', '2025-04-07 17:22:41', '1', 'noboru', '0', '', '', '', '', '', '', '', '', '', ''),
(127, 'アキラアキラ', 'bbking1110', '1208', '0', '', '', '男', '', '222000', '', '990846', '2025-04-08 12:19:31', '0', '', '', '17,40,', '', '阿虎客户 提现到美子账户  跳过数据错误  人生保证金30w', '', '', '', '', '', '1', '阿虎'),
(128, '19970720', '19970720', '1208', '0', '', '', '男', '', '6000', 'image_0 (7).png', '245165', '2025-04-08 16:03:11', '3', 'サトウ ユウナ', '3', '', '', '阿爆', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(129, 'ウエハラ1945', '73881945', '1208', '0', '', '', '男', '', '0', 'FaceApp_1661904786525.jpg', '552000', '2025-04-09 13:42:07', '1', '上原民夫', '0', '20,19,', '', '', '', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', ''),
(133, 'michiaki1496.', 'kuro3588', '1208', '4', '', '71', '男', '【銀行名】:  名古屋銀行\n【支店名】:  武豊支店\n【支店番号】:  277\n【口座番号】:  3167151\n【口座名義】:  石黒道明', '14132000', 'image.jpg', '691487', '2025-04-10 10:43:11', '1', '石黒道明', '1', '', '名古屋', '阿超客户 1qw  27号约会  约会保障金150w 证件真实性100w 高级会员100w 28号提现日 500w大额通道  账户已冻结400W解冻还没进', '', '', '', '', '', '1', '阿超'),
(134, 'もも19940720', 'もも19940720', '1208', '0', '', '', '女', '', '0', 'image_0 (16).png', '130418', '2025-04-10 14:41:35', '3', 'ナツメ モモコ', '3', '', '', '阿爆', '', 'undefined', '3w.jpg', '5w.jpg', '10w.jpg', 'undefined', ''),
(135, '8546652', '102431', '1208', '0', '', '', '男', '', '120000', '10079.jpg', '418021', '2025-04-10 16:36:25', '3', '桜井奈々', '3', '', '', '阿亮', '', 'undefined', '3w.jpg', '5w.jpg', '10w.jpg', 'undefined', ''),
(136, '08095325189', '02585360', '1208', '0', '', '', '男', '', '0', '20240628_064608.jpg', '359434', '2025-04-10 16:52:34', '1', 'ほりい', '0', '', '', '阿龙客户', '', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', ''),
(137, '19647016', '7016isobe', '842369', '0', '', '', '男', '', '0', '', '369608', '2025-04-10 17:04:08', '0', '', '', '', '', '阿龙客户', '', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', ''),
(138, 'masami88808', 'Aa123456..', '1208', '0', '', '', '男', '', '120000', 'image_40岁不婚未育，单身才是你成长最快的黄金期___昨天见到我一姐姐，大学刚毕业就认识了她，给我张罗过对象，安排过工作，在她家蹭吃蹭喝好几年。_聊到半晌的时候，她忽然来一句：“我觉得你变化挺大。”_🤔️在她的印象里我应该是个情绪比较强烈的跳脚猴🐒，大炮仗🧨，恋爱脑、“丧”彪😔。___她说：“你还记得当年你闹分手半夜在街边哭吗？我跟你哥开着车去找你，我一直觉得你太小孩子气，很不成熟，可是 (1).png', '869899', '2025-04-11 09:47:33', '3', 'ナガサワ マサミ', '3', '', '', '阿超', '', 'undefined', '3w.jpg', '5w.jpg', '10w.jpg', 'undefined', ''),
(139, 'Aa123456', 'Aa123456', '1208', '0', '', NULL, '男', NULL, '6000', NULL, '554145', '2025-04-11 10:20:34', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(140, 'クサノケンジ', '102761v', '1208', '1', '', '', '男', '', '100000', '', '369153', '2025-04-11 10:22:55', '0', '', '', '', '', '阿鑫客户', '', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', ''),
(141, 'keiko19920720', 'keiko19920720', '1208', '0', '', '', '女', '', '0', 'image_0 (25).png', '895729', '2025-04-11 16:10:58', '3', 'ヨシカワ ケイコ', '3', '', '', '阿爆', '', 'undefined', '3w.jpg', '5w.jpg', '10w.jpg', 'undefined', ''),
(142, 'abc123', 'qçrdxt963', '545935', '0', '', '', '男', '', '0', 'IMG_2025-04-06-14-41-12-235.jpg', '510532', '2025-04-11 17:24:12', '1', 'イナガキ', '1', '', '', '阿爆客户', '', '', 'photo_2025-04-07_14-46-04.jpg', 'photo_2025-04-07_14-50-03.jpg', 'photo_2025-04-07_14-54-22.jpg', '', ''),
(143, 'shed219', 'qwe8686886', '1208', '0', '', '18', '男', '', '120000', 'IMG_0086.jpeg', '214333', '2025-04-13 15:41:52', '3', '鈴木優月', '3', '', '', '阿龙', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '0', ''),
(144, '999999', '000000', '1208', '3', '', '', '男', '', '600000', '', '606481', '2025-04-15 18:14:47', '0', '', '1', '', '', '阿龙客户  交50w人身安全保障金中 25号操作', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '0', '阿龙'),
(147, 'takeyan0120', '797479', '1208', '1', '', '', '男', '【銀行名】:  足利銀行\n【支店名】:  西那須野支店\n【支店番号】:  183\n【口座番号】:  0607080\n【口座名義】:  武田勝利', '110000', '', '833017', '2025-04-16 16:49:49', '0', '', '', '', '', '阿虎客户 数据出错1  头像是狗', '', '', '', '', '', '0', '阿虎'),
(148, 'aoi66088', 'Aa123456..', '1208', '0', '', '', '男', '', '120000', 'IMG_0012.jpeg', '804363', '2025-04-18 10:18:40', '3', '終わらない夢', '3', '', '', '阿超', '', '', '', '', '', '1', ''),
(149, '09024307925', '43292hiko', '1208', '1', '', '', '男', '', '100000', '', '800340', '2025-04-18 21:30:24', '0', '', '', '', '', '阿九客户  数据出错1  30w没交 要到5.25充值30w', '', '', '', '', '', '1', '阿九'),
(150, '104977061', '123456', '1208', '0', '', '', '女', '', '120000', 'IMG_0177.jpeg', '768961', '2025-04-19 17:35:38', '3', '铃木美穗', '3', '', '', '阿雄', '', '', '', '', '', '', ''),
(151, '107098838', '123456', '1208', '0', '', '', '女', '', '120000', 'IMG_0180.jpeg', '431750', '2025-04-19 20:30:47', '3', '葵', '3', '', '', '阿雄', '', '', '', '', '', '', ''),
(153, 'kohaku39', 'muneomi39', '1208', '0', '', '', '男', '', '0', '4B9240DA-ECD9-48E6-A5D4-F924DDD77A53.jpeg', '423163', '2025-04-19 20:53:43', '1', 'kohaku39', '0', '', '', '阿爆客户', '', '', '', '', '', '1', '阿爆'),
(154, 'はやし　てつあき', 'Hikarigaoka0', '168168', '0', '', '', '男', '', '0', '', '455882', '2025-04-20 13:09:06', '0', '', '', '', '', '阿鑫客户', '', '', '', '', '', '', ''),
(155, 'タケノコダヨ', '132456', '1208', '0', '', '', '男', '', '0', '20241225_230516.jpg', '671991', '2025-04-20 17:09:34', '1', '加藤 毅', '0', '', '', '阿爆客户', '', '', '', '', '', '1', '阿爆'),
(156, 'Aa111111', 'Aa111111', '168168', '0', '', '', '男', '', '0', '', '581440', '2025-04-20 17:24:39', '3', '', '3', '', '', '', '', '', '', '', '', '', ''),
(157, 'aa223344', 'aa2233344', '168168', '0', '', '', '男', '', '0', '', '483996', '2025-04-20 17:26:27', '3', '', '3', '', '', '', '', '', '', '', '', '', ''),
(158, 'Aa1234567890', 'Aa1234567890', '168168', '0', '', '', '男', '', '0', '', '700826', '2025-04-20 17:28:26', '3', '', '3', '', '', '', '', '', '', '', '', '', ''),
(159, 'Mika0720', 'Mika0720', '1208', '0', '', '', '女', '', '120000', 'image_0 (52).png', '183280', '2025-04-20 17:32:12', '3', 'ナカジマ ミカ', '3', '', '', '阿爆', '', '', '', '', '', '', ''),
(164, 'ⅠⅨⅦⅨ0Ⅴ', '783900', '1208', '1', '', '', '男', '', '100000', 'IMG_8631.jpeg', '201383', '2025-04-22 17:55:38', '1', 'モトヒロ', '0', '', '', '数据出错1', '', '', '', '', '', '1', '阿九'),
(165, 'Yuuna0720', 'Yuuna0720', '1208', '0', '', '', '女', '', '120000', 'image_0 (70).png', '574418', '2025-04-23 10:10:47', '3', 'サトウ ユウナ', '3', '', '', '阿爆', '', '', '', '', '', '', ''),
(166, '72881276', 'Crown1502', '1208', '4', '', '', '男', '【銀行名】:  みずほ銀行\n【支店名】:  あざみ野支店\n【支店番号】:  599\n【口座番号】:  1649863\n【口座名義】:  ナガイ　タカシ', '1800000', '', '196992', '2025-04-23 17:48:35', '0', '', '1', '', '', '数据错误第二步完成 约会保障金开始150w 洗黑钱', '', '', '', '', '', '1', '哪吒'),
(167, '157678', '123321', '1208', '0', '', '', '男', '', '120000', 'IMG_0007.jpeg', '103155', '2025-04-24 12:24:13', '3', '黒羽雪奈', '3', '', '', '', '', '', '', '', '', '1', ''),
(168, 'マサミナリタ', '1234567', '1208', '0', '', '', '男', '', '30000', '', '976237', '2025-04-24 12:47:11', '0', '', '', '', '', '3w投票  现在重新注册了 id 180', '', '', '', '', '', '1', '阿九'),
(169, 'yoshi0606', 'saten2021', '1208', '0', '', '', '男', '', '0', '', '391416', '2025-04-24 15:03:34', '0', '', '', '', '', '', '', '', '', '', '', '1', '岸'),
(170, '818652847311', 'qq123123', '1208', '0', '', '', '男', '', '0', '', '568959', '2025-04-24 19:54:12', '0', '', '', '44,', '', '', '', '', '', '', '', '1', ''),
(174, '1254KE', '123456', '1807', '0', '', '', '男', '', '0', 'DSC_0001.JPG', '905034', '2025-04-25 15:23:59', '1', '賢', '0', '', '', '退款6q', '', '', '', '', '', '1', '阿亮'),
(175, '850301', '102431', '1807', '0', '', '', '男', '', '532000', 'IMG_1130.jpeg', '760557', '2025-04-25 15:25:00', '1', '宫崎绘梨', '0', '', '', '阿亮', '', '', '', '', '', '1', ''),
(176, 'ナカムラ　シゲミツ.', 'sn195663', '1801', '1', '', '', '男', '【銀行】百五銀行\n【支店】桑名支店\n【支店番号】101\n【口座番号】791800\n【口座名義】ナカムラ　シゲミツ', '120000', '', '615204', '2025-04-26 11:23:55', '0', '', '', '', '', '数据出错1 id68小号', '', '', '', '', '', '1', '阿虎'),
(177, 'アオヤギイオリ', '202502', '1805', '1', '', '', '男', '', '120000', '', '903137', '2025-04-26 15:45:29', '0', '', '', '', '', '4w补齐10w  数据已经出错  还在拉扯', '', '', '', '', '', '1', '阿爆'),
(178, 'MARUYAMA.', 'maruyama1019', '1811', '0', '', '', '男', '口座番号を伝えます。 \n【銀行名】: 筑波銀行 \n【支店名】:  下館駅南出張所\n【支店番号】:  067\n【口座番号】:  1052338\n【口座名義】: マルヤマ　タツヤ ', '4080000', '1682309822566.jpg', '933879', '2025-04-27 20:36:15', '0', 'まるやま', '1', '', '', '人身保证金150w完成 驾驶证真实性120w没汇款返144w 800w升级会员5.16办理截止', '', '', '', '', '', '0', '阿岸'),
(179, '385712', '123321', '1811', '0', '', '', '男', '', '120000', 'IMG_0006.jpeg', '667440', '2025-04-28 11:30:46', '3', '鈴木優奈', '3', '', '', '岸', '', '', '', '', '', '1', ''),
(180, 'ナリタマサミ', '1234567', '1803', '0', '', '', '男', '', '0', 'IMG_2258.jpeg', '796261', '2025-05-01 10:50:53', '0', '', '', '', '', '10w拍照了但没充值  预约明天北京时间中午1点', '', '', '', '', '', '0', '阿九'),
(181, '09023309096', 'shin5538', '1810', '0', '', '', '男', '', '0', 'IMG_7021.jpeg', '918257', '2025-05-01 15:05:09', '1', '矢萩信一', '0', '', '', '3w到账6W退款 等第三步汇款', '', '', '', '', '', '0', '阿超'),
(182, 'hide0519.', '19700519', '1811', '2', '', '', '男', '', '0', '20250414_113324683.JPG', '813802', '2025-05-04 20:34:57', '1', 'hide0519', '0', '', '', '已退6Q  放弃', '', '', '', '', '', '1', '阿岸'),
(183, '895518', '123321', '1568', '0', '', '', '男', '', '120000', 'photo_2025-05-08_18-29-40.jpg', '336504', '2025-05-08 17:32:17', '3', '佐藤美穂', '3', '', '', '', '', '', '', '', '', '1', '哪吒'),
(184, 'シミズヤスジ.', 'shim2128', '1568', '1', '', '', '男', '', '180000', '', '835435', '2025-05-09 16:46:49', '0', '', '', '', '', '群马高崎贝泽町 还女主11w 不要用1047239这个卡', '', '', '', '', '', '0', '哪吒'),
(185, '428269526', '428269526', '1816', '0', '', '', '女', '', '0', 'image_被三亚的天晒化了🫠____0.png', '481565', '2025-05-09 19:30:21', '3', 'えんどう みゆき', '3', '', '', '', '', '', '', '', '', '1', '阿羊'),
(186, '181816', '181816', '1815', '0', '', '', '男', '', '120000', '1.png', '552520', '2025-05-11 11:09:20', '3', 'Airi Morikawa ', '3', '', '', '', '', '', '', '', '', '1', '阿斌'),
(187, '181266', '181266', '1815', '0', '', '', '男', '', '120000', '1 (6).png', '682427', '2025-05-11 14:43:23', '3', '小川 里奈', '3', '', '', '', '', '', '', '', '', '1', ''),
(188, 'saraxihuancap', 'qwertyuiop.1', '1816', '0', '', '', '女', '', '120000', 'Snipaste_2025-05-07_22-25-08.png', '286519', '2025-05-14 13:22:58', '3', 'スズキ カズコ', '3', '', '', '', '', '', '', '', '', '1', '果冻'),
(189, 'てつやおかだ', 'duca1000', '1801', '0', '', '', '男', '', '0', '', '967876', '2025-05-14 18:33:41', '0', '', '', '', '', '', '', '', '', '', '', '1', '阿鑫'),
(190, 'ym556d3', '123123123', '1811', '0', '', '', '男', '', '120000', '1.png', '678576', '2025-05-16 19:55:24', '3', ' スズキ ユウナ', '3', '', '', '', '', '', '', '', '', '1', ''),
(191, '筋肉質のタクさん.....', 'Minkoro4060', '1801', '0', '', '', '男', '「銀行名」三井住友銀行(0009)\n「支店名」枚方支店\n「支店番号」  158\n「口座の種類」 普通\n「口座番号」 4659914\n「カタカナ」 イシモト　ジュン\n「口座名義」石本純', '900000', 'IMG_5217.jpeg', '404792', '2025-05-17 11:48:31', '1', 'たく', '0', '', '', '数据错误1超时，已支付30w  解除登录17w  驾驶证50w未付 女主帮10w 22-25号要完成40w', '', '', '', '', '', '0', '阿虎'),
(192, 'ai88016', 'Aa123456..', '1810', '0', '', '', '女', '', '120000', 'image_40岁不婚未育，单身才是你成长最快的黄金期___昨天见到我一姐姐，大学刚毕业就认识了她，给我张罗过对象，安排过工作，在她家蹭吃蹭喝好几年。_聊到半晌的时候，她忽然来一句：“我觉得你变化挺大。”_🤔️在她的印象里我应该是个情绪比较强烈的跳脚猴🐒，大炮仗🧨，恋爱脑、“丧”彪😔。___她说：“你还记得当年你闹分手半夜在街边哭吗？我跟你哥开着车去找你，我一直觉得你太小孩子气，很不成熟，可是 (1).png', '623660', '2025-05-18 15:39:11', '3', 'ヤマモト アイ', '3', '', '', '', '', '', '', '', '', '1', ''),
(193, '158996', '123321', '1816', '0', '', '', '男', '', '120000', '石川銀杏 (6).png', '106847', '2025-05-20 13:53:33', '3', 'マツモト ミサエ', '3', '', '', '', '', '', '', '', '', '1', ''),
(194, 'イシカワ　エイジ', 'Eiji19680327', '1810', '0', '', '', '男', '【銀行名】:  みずほ銀行\n【支店名】:  綾瀬支店\n【支店番号】:  179\n【口座番号】:  普通、1403029\n【口座名義】:  イシカワ　エイジ', '360000', '', '666411', '2025-05-20 17:46:04', '0', '', '', '', '', '10w 女主帮4w 卡死了6w 在路上还没退回 直接开约会保证金 女主汇了20w 还差30w', '', '', '', '', '', '1', '阿超'),
(195, '882233', '223344', '1806', '1', '', '', '男', '【銀行名】:  PayPay銀行\n【支店名】:  かわせみ支店\n【支店番号】:  007\n【口座番号】:  4316232\n【口座名義】:  フクダタダシ  福田忠', '110000', '', '306020', '2025-05-21 11:10:48', '0', '', '', '', '', '10w没充', '', '', '', '', '', '0', '阿九'),
(196, '158997', '123321', '1816', '0', '', '', '男', '', '120000', '秋山佳音.png', '831375', '2025-05-21 15:51:00', '3', '秋山佳音', '3', '', '', '', '', '', '', '', '', '1', '阿鑫'),
(197, '986520', '123321', '1811', '0', '', '', '女', '', '120000', 'image_3 (1).png', '778827', '2025-05-21 16:10:04', '3', 'サトウ ミホ', '3', '', '', '', '', '', '', '', '', '1', '阿鑫'),
(198, '390419', 'f45wo2gd', '1815', '1', '', '', '男', '', '50000', '', '259864', '2025-05-21 17:24:11', '0', '', '', '', '', '', '', '', '', '', '', '1', '阿斌'),
(200, '184871', '184871', '1815', '0', '', '', '女', '', '120000', '6.png', '803336', '2025-05-25 14:16:01', '3', '木村優奈', '3', '', '', '', '', '', '', '', '', '1', '阿斌'),
(201, 'エンドウ　ユウジ', '098123', '1816', '1', '', '', '男', '【銀行名】:  足利銀行\n【支店名】:  上三川支店\n【支店番号】:  154\n【口座番号】:  2636992\n【口座名義】:  エンドウ　ユウジ', '100000', '', '793087', '2025-05-28 15:25:45', '0', '', '', '', '', '', '', '', '', '', '', '1', '阿虎'),
(202, 'amar2325.', 'hs0326', '1815', '0', '', '', '男', '【銀行名】:  住信SBI銀行\n【支店名】:  ぶどう支店\n【支店番号】:  102\n【口座番号】:  1205540\n【口座名義】:  スギヤマヒデキ', '3068000', '2.jpg', '256875', '2025-05-28 16:52:57', '1', '杉山秀樹', '2', '48,', '', '没钱，但是可能有抚恤金6千万，还有买房子的钱 10w没数据错误被开过  开50w人身保证金 再开洗钱打相同金额 已汇36w 女借15w 洗钱已完成 现在大额通道80w', '', '', '', '', '', '0', '阿斌'),
(203, 'てつやとらとら', '4546okam', '1801', '0', '', '', '男', '', '0', '', '715594', '2025-05-30 16:55:48', '0', '', '', '', '', '', '', '', '', '', '', '1', '阿虎'),
(204, '09063086661', '123456', '1806', '0', '', '', '男', '', '30000', '', '524270', '2025-05-31 12:13:30', '0', '', '', '', '', '没钱', '', '', '', '', '', '1', '阿九'),
(205, 'いで　やすふみ', 'b7q29hd4', '1816', '0', '', '', '男', '', '0', 'img013.jpg', '264452', '2025-06-02 09:16:08', '1', 'いで　やすふみ', '0', '', '', '没钱，想慢慢申请', '', '', '', '', '', '1', '阿羊'),
(206, 'KENJI SAKAI .', 'dack219ks', '1801', '0', '', '', '男', '【銀行名】:  三井住友銀行\n【支店名】:  蒲田支店\n【支店番号】:  239\n【口座番号】:  0499761\n【口座名義】:  サカイケンジ', '5590000', '', '938786', '2025-06-02 09:34:03', '0', '', '1', '', '', '有钱 数据出错：只投了1个 约会保证金100w 开驾驶证120w  超过150w需要驾驶证 女主汇30w了 汇了50w 40w  提现期限16号  200w大额通道  女主借100w  女主20w', '', '', '', '', '', '0', '阿虎'),
(207, '森本たいちゃん', 'T02240358', '1801', '0', '', '', '男', '', '0', '', '846736', '2025-06-03 11:36:35', '0', '', '', '', '', '', '', '', '', '', '', '1', '阿虎'),
(208, '295714', '123321', '1811', '0', '', '', '男', '', '120000', 'image_0 (2).png', '355299', '2025-06-03 19:23:19', '3', 'ホシノ サクラコ', '3', '', '', '', '', '', '', '', '', '1', '阿岸'),
(209, '13548516', 'pepsi000001', '1806', '0', '', '', '女', '', '120000', 'image_妆前妆后____0.png', '380696', '2025-06-04 16:45:34', '3', 'しみず ゆみ', '3', '', '', '', '', '', '', '', '', '1', '阿羊'),
(210, 'ししどあきひと', '01838771', '1810', '0', '', '', '男', '', '0', '', '284675', '2025-06-05 13:54:39', '0', '', '', '', '', '', '', '', '', '', '', '1', '阿超'),
(211, '265495474', 'Aa123456..', '1817', '0', '', '', '女', '', '120000', 'image_0 (3).png', '620731', '2025-06-08 15:02:05', '3', 'モリカワユキノ', '3', '', '', '', '', '', '', '', '', '1', '阿程'),
(212, 'naoki88.', 'naoki8118', '1801', '0', '', '', '男', '', '1080000', '', '108354', '2025-06-09 16:42:52', '0', '', '', '43,', '', '', '', '', '', '', '', '0', '阿虎'),
(213, '100468161', 'Aa123456..', '1817', '0', '', '', '男', '', '120000', '1.png', '601972', '2025-06-12 17:51:27', '3', 'ヨシオカリナ', '3', '', '', '', '', '', '', '', '', '1', '阿程'),
(214, '1120099', 'Aa123456', '1817', '0', '', '', '女', '', '120000', '1.png', '655728', '2025-06-12 18:08:47', '3', 'モリカワ サチノ', '3', '', '', '', '', '', '', '', '', '1', '阿程'),
(215, 'Keikoi', 'Aa123456..', '1803', '0', '', '', '男', '', '120000', '和服.png', '278335', '2025-06-12 19:09:37', '3', 'キタガワ ケイコ', '3', '', '', '', '', '', '', '', '', '1', '阿鑫'),
(216, 'Miki5445', 'Aa123456..', '1803', '0', '', '', '男', '', '120000', '1.png', '992763', '2025-06-12 19:11:51', '0', 'キタガワ ケイコ', '3', '', '', '', '', '', '', '', '', '1', '阿鑫'),
(217, 'ラッキー', '1150mtk', '1801', '0', '', '', '男', '', '7409600', '1.jpg', '615856', '2025-06-13 14:42:09', '1', 'ラッキー', '0', '', '', '女主帮他操作', '', '', '', '', '', '0', '阿程'),
(218, 'kaihara', 'qwer1234', '1815', '1', '', '', '男', '', '180000', '20250613_175614~2.JPG', '505644', '', '1', 'kaihara', '0', '', '', '8.10 5W的延期费', '', '', '', '', '', '1', '阿斌'),
(219, 'Danny Ducati ', '282828', '1208', '0', '', '', '男', '', '0', '', '972802', '2025-06-14 12:07:45', '0', '', '', '', '', '', '', '', '', '', '', '1', ''),
(220, 'クドウコウジ', 'KKya0056', '1801', '3', '', '', '男', '【銀行名】:  きらやか銀行\n【支店名】:  神町\n【支店番号】:  111\n【口座番号】:  2003266\n【口座名義】:  クドウコウジ', '480000', '', '185194', '2025-06-15 10:27:18', '0', '', '', '', '', '投了5w 应该投2w5', '', '', '', '', '', '0', '阿虎'),
(221, 'HI-RO27', 'Kre21192799@', '1810', '0', '', '', '男', '', '0', 'IMG_1675.jpeg', '446621', '2025-06-17 13:07:07', '1', 'すずきひろかず', '0', '', '', '', '', '', '', '', '', '1', '阿超'),
(222, '4848yoshio', '4848yoshio', '1807', '0', '', NULL, '男', NULL, '6000', NULL, '838659', '2025-06-17 13:11:51', '0', '', '', '', '', '', '', '', '', '', '', '1', ''),
(223, '18071807', '102431', '1807', '0', '', '', '男', '', '6000', '', '350655', '2025-06-17 13:13:56', '0', '', '', '', '', '', '', '', '', '', '', '1', '阿亮'),
(224, '910301', '102431', '1807', '0', '', '', '男', '', '6000', '10016.jpg', '248724', '2025-06-17 15:33:18', '1', 'Lauren', '0', '', '', '', '', '', '', '', '', '1', ''),
(225, 'hkひろゆき', 'hk5787', '1806', '0', '', '', '男', '', '0', '', '865908', '2025-06-22 10:23:22', '0', '', '', '', '', '新方案 已退6000', '', '', '', '', '', '1', '阿九'),
(226, 'yasai39173.', 'h75r9tk39173s', '1816', '0', '', '', '男', '', '1560000', 'Screenshot_20250624-202712.png', '819937', '2025-06-24 19:26:20', '1', 'yasai39173', '1', '', '', '', '', '', '', '', '', '0', '阿羊'),
(228, 'Koichi.osame', 'j1p2g3r4', '1815', '0', '', '', '男', '', '120000', '', '719044', '2025-06-30 10:27:06', '0', '', '', '', '', '', '', '', '', '', '', '0', '阿斌'),
(229, 'masadayo', 'masa9696', '1806', '0', '', '', '男', '', '0', '', '972214', '2025-07-02 16:45:46', '0', '', '', '', '', '', '', '', '', '', '', '1', '阿九'),
(230, '1238899', '123456', '1806', '0', '', '', '男', '', '6000', 'photo_2025-05-08_15-25-29.jpg', '527495', '2025-07-05 17:39:52', '2', '星野結衣', '3', '', '', '', '', '', '', '', '', '1', ''),
(231, '0806178', 'm196237170107', '1806', '0', '', '', '男', '', '0', '', '719154', '2025-07-05 17:49:05', '0', '', '', '', '', '', '', '', '', '', '', '1', '哪吒'),
(232, '6478010835', 'Rjz1723!?', '1208', '0', '', '', '男', '', '153', 'IMG_5473.jpeg', '531748', '2025-07-05 22:07:40', '1', 'Rob', '0', '', '', '', '', '', '', '', '', '1', '阿九'),
(233, '5148387137', 'Vancouver604', '1815', '0', '', '', '男', '', '120', 'IMG_7550.jpeg', '889104', '2025-07-07 10:11:36', '1', 'Rob Niziolomski', '0', '48,', '', '', '', '', '', '', '', '0', '阿斌'),
(234, '190815', '123456', '1806', '0', '', '', '女', '', '0', 'photo_2025-05-08_15-25-23.jpg', '959100', '2025-07-15 17:02:48', '1', '立花真美', '3', '', '', '', '', '', '', '', '', '1', ''),
(235, 'カガミマサヒコ.', ',,213448', '1568', '3', '', '', '男', '', '480000', '', '392793', '2025-07-16 11:16:02', '0', '', '', '', '', '', '', '', '', '', '', '0', '哪吒'),
(236, 'けいすけ４７', 'ksk47ksk47', '1808', '1', '', '', '男', '', '0', '', '599475', '2025-07-17 18:58:55', '0', '', '', '', '', '', '', '', '', '', '', '1', '大鑫'),
(237, '689986', '689986', '1808', '0', '', '', '女', '', '0', 'Snipaste_2025-07-05_17-15-21.png', '782631', '2025-07-21 20:39:22', '1', 'イシカワ ギンナン', '3', '', '', '', '', '', '', '', '', '1', ''),
(238, 'yoshihito', 'sex2580', '1815', '0', '', '', '男', '', '0', '', '640424', '2025-07-22 11:53:50', '0', '', '', '', '', '', '', '', '', '', '', '1', '阿羊'),
(239, 'Sbskmsm', 'Z350z1218', '1808', '0', '', '', '男', '', '153', '', '826403', '2025-07-23 10:38:12', '0', '', '', '', '', '', '', '', '', '', '', '1', ''),
(241, 'Rodney', '123456', '1208', '0', '', '', '男', '', '120', '', '941434', '2025-07-23 11:52:42', '0', '', '', '', '', '', '', '', '', '', '', '1', ''),
(242, 'kazuya0002', '4g56gzat', '1568', '3', '', '', '男', '', '460000', '', '181760', '2025-07-23 19:29:04', '0', '', '', '', '', '', '', '', '', '', '', '0', '哪吒'),
(244, 'マツダエイジ.', 'gsx1300r', '1568', '1', '', '', '男', '', '100000', '1734782880896.jpg', '434355', '2025-07-27 11:42:23', '1', 'マツダエイジ', '0', '', '', '', '', '', '', '', '', '0', '哪吒'),
(245, 'キムラ　モトヒコ', 'my63021215', '1811', '0', '', '', '男', '', '0', 'IMG_0438.jpeg', '384426', '2025-07-27 14:32:24', '1', 'キムラモトヒコ', '0', '43,', '', '', '', '', '', '', '', '1', '阿岸'),
(246, 'カズカズカズ', 'Nobu5370', '1811', '0', '', '', '男', '', '0', 'IMG_0820.jpeg', '108885', '2025-07-29 19:00:59', '1', '延本一正', '0', '', '', '', '', '', '', '', '', '1', '阿岸'),
(247, '0975038746', '810206', '1208', '0', '', '', '男', '', '130', 'IMG_4678.jpeg', '293479', '2025-07-29 20:23:09', '1', '賴建助', '0', '48,47,43,', '', '超', '', '', '', '', '', '1', ''),
(248, 'TJas1801', 'Chinfu88', '1801', '0', '', '', '男', '', '0', '', '809156', '2025-07-31 17:26:44', '0', '', '', '', '', '', '', '', '', '', '', '1', '阿九'),
(249, 'AA123456aa   ', 'aa123456AA', '1801', '0', '', '', '男', '', '0', '头像.png', '650903', '2025-08-01 15:45:07', '1', 'キタガワ ケイコ', '3', '', '', '', '', '', '', '', '', '1', ''),
(250, '家村まさとも', '124365', '1806', '0', '', '', '男', '', '0', '', '695572', '2025-08-06 19:36:50', '0', '', '', '', '', '', '', '', '', '', '', '1', '一个好人'),
(252, '905713', '123456', '1806', '0', '', '', '女', '', '0', 'photo_2025-08-02_21-07-53.jpg', '133747', '2025-08-11 16:09:08', '1', '星野結衣', '3', '', '', '', '', '', '', '', '', '1', ''),
(253, '520520', '123456', '1803', '0', '', NULL, '女', NULL, '0', 'image_30+妈妈的逆龄坦白局___朋友..._1.png', '584688', '2025-08-14 17:01:44', '1', '雅子（まさこ）', '0', '', '', '', '', '', '', '', '', '1', '');

-- --------------------------------------------------------

--
-- 表的结构 `vip`
--

CREATE TABLE `vip` (
  `name` varchar(20) NOT NULL,
  `type` varchar(10) NOT NULL,
  `img` varchar(50) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `vip`
--

INSERT INTO `vip` (`name`, `type`, `img`, `id`) VALUES
('一般用户', '0', '新建项目.jpg', 1),
('普通会员', '1', '新建项目.jpg', 3),
('高级会员', '2', 'vipCard.png', 4),
('至尊会员', '3', 'vipCard1.png', 5);

-- --------------------------------------------------------

--
-- 表的结构 `vote`
--

CREATE TABLE `vote` (
  `account` varchar(20) NOT NULL,
  `voteNum` varchar(20) NOT NULL,
  `voteId` varchar(10) NOT NULL,
  `date` varchar(20) NOT NULL,
  `id` int(11) NOT NULL,
  `dataError` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `vote`
--

INSERT INTO `vote` (`account`, `voteNum`, `voteId`, `date`, `id`, `dataError`) VALUES
('222222', '20', '886', '2025-03-31 15:16:34', 10, ''),
('222222', '50000', '686', '2025-04-01 13:08:34', 11, ''),
('Boohfree', '50000', '686', '2025-04-01 13:13:47', 12, ''),
('222222', '50000', '886', '2025-04-01 13:54:26', 13, ''),
('エルヴィン　スミス', '45000', '686', '2025-04-01 15:21:49', 14, ''),
('222222', '50000', '886', '2025-04-01 16:49:45', 15, ''),
('222222', '50000', '686', '2025-04-01 16:50:00', 16, ''),
('222222', '50000', '996', '2025-04-01 16:50:01', 17, ''),
('222222', '50000', '886', '2025-04-01 16:50:01', 18, ''),
('222222', '50000', '686', '2025-04-01 16:50:28', 19, ''),
('222222', '50000', '996', '2025-04-01 16:50:28', 20, ''),
('222222', '50000', '886', '2025-04-01 16:50:28', 21, ''),
('222222', '20', '996', '2025-04-01 17:19:57', 22, ''),
('222222', '20', '886', '2025-04-01 17:19:58', 23, ''),
('222222', '20', '996', '2025-04-01 17:20:04', 24, ''),
('222222', '20', '886', '2025-04-01 17:20:04', 25, ''),
('222222', '50000', '886', '2025-04-01 17:45:40', 26, ''),
('222222', '30000', '886', '2025-04-01 17:45:58', 27, ''),
('222222', '30000', '886', '2025-04-01 17:46:35', 28, ''),
('222222', '20000', '886', '2025-04-01 17:46:45', 29, ''),
('222222', '1000', '886', '2025-04-01 17:46:51', 30, ''),
('222222', '3000', '886', '2025-04-01 17:47:05', 31, ''),
('222222', '7000', '886', '2025-04-01 17:47:46', 32, ''),
('222222', '10000', '886', '2025-04-01 17:48:00', 33, ''),
('222222', '30000', '886', '2025-04-01 17:48:12', 34, ''),
('111111', '500', '886', '2025-04-04 10:29:30', 35, ''),
('111111', '100', '886', '2025-04-07 17:45:13', 36, ''),
('111111', '200', '889', '2025-04-07 17:46:56', 37, ''),
('アグニシゲヤ', '3000', '889', '2025-04-07 19:11:53', 38, ''),
('111111', '5700', '886', '2025-04-08 14:41:54', 39, ''),
('KOHMIYA', '30000', '889', '2025-04-09 11:31:26', 40, ''),
('KOHMIYA', '30000', '889', '2025-04-09 11:32:11', 41, ''),
('KOHMIYA', '30000', '889', '2025-04-09 11:35:15', 42, ''),
('KOHMIYA', '30000', '889', '2025-04-09 11:36:14', 43, ''),
('KOHMIYA', '30000', '889', '2025-04-09 11:40:28', 44, ''),
('KOHMIYA', '30000', '889', '2025-04-09 11:42:19', 45, ''),
('19647016', '3000', '889', '2025-04-10 17:35:11', 46, ''),
('michiaki1496', '30000', '889', '2025-04-11 15:33:24', 48, ''),
('michiaki1496', '50000', '686', '2025-04-11 16:41:40', 49, ''),
('abc123', '30000', '686', '2025-04-12 10:49:19', 50, ''),
('クサノケンジ', '30000', '889', '2025-04-12 11:34:53', 51, ''),
('クサノケンジ', '30000', '889', '2025-04-12 11:36:27', 52, ''),
('abc123', '50000', '686', '2025-04-12 11:45:31', 53, ''),
('abc123', '60000', '686', '2025-04-12 11:52:28', 54, ''),
('クサノケンジ', '50000', '686', '2025-04-12 15:17:40', 55, ''),
('クサノケンジ', '50000', '686', '2025-04-12 15:18:09', 56, ''),
('ずもとこういち', '30000', '889', '2025-04-16 15:01:55', 82, ''),
('090-7852-5619', '25000', '996', '2025-04-16 15:10:09', 83, ''),
('090-7852-5619', '25000', '886', '2025-04-16 15:11:22', 84, ''),
('090-7852-5619', '25000', '996', '2025-04-16 15:13:14', 85, ''),
('999999', '30000', '996', '2025-04-16 18:05:01', 86, ''),
('ずもとこういち', '50000', '886', '2025-04-17 14:50:33', 87, ''),
('ずもとこういち', '50000', '996', '2025-04-17 16:18:59', 88, ''),
('999999', '50000', '886', '2025-04-17 19:14:19', 89, ''),
('999999', '50000', '996', '2025-04-19 13:19:07', 92, ''),
('09024307925', '30000', '996', '2025-04-20 12:15:09', 93, ''),
('michiaki1496', '50000', '996', '2025-04-22 13:03:17', 96, ''),
('michiaki1496', '50000', '886', '2025-04-22 13:03:18', 97, ''),
('michiaki1496', '50000', '996', '2025-04-22 13:03:37', 98, ''),
('michiaki1496', '50000', '886', '2025-04-22 13:03:37', 99, ''),
('ⅠⅨⅦⅨ0Ⅴ', '30000', '889', '2025-04-23 14:53:19', 108, ''),
('ⅠⅨⅦⅨ0Ⅴ', '50000', '686', '2025-04-23 15:57:21', 109, ''),
('72881276', '30000', '889', '2025-04-23 19:11:48', 112, ''),
('アキラアキラ', '30000', '889', '2025-04-23 19:44:01', 113, ''),
('72881276', '50000', '686', '2025-04-23 20:15:40', 114, ''),
('72881276', '25000', '996', '2025-04-24 12:45:50', 115, ''),
('72881276', '25000', '886', '2025-04-24 12:46:00', 116, ''),
('09024307925', '30000', '686', '2025-04-24 20:13:58', 117, ''),
('09024307925', '50000', '996', '2025-04-25 19:59:45', 118, ''),
('09024307925', '50000', '886', '2025-04-25 19:59:46', 119, ''),
('ナカムラ　シゲミツ', '30000', '102', '2025-04-26 17:20:26', 120, ''),
('ナカムラ　シゲミツ', '50000', '102', '2025-04-26 18:34:37', 121, ''),
('ナカムラ　シゲミツ', '100000', '102', '2025-04-26 19:30:09', 122, ''),
('アオヤギイオリ', '30000', '889', '2025-04-27 10:29:54', 123, ''),
('アオヤギイオリ', '50000', '686', '2025-04-27 11:43:12', 124, ''),
('アオヤギイオリ', '50000', '686', '2025-04-27 15:59:05', 125, ''),
('アオヤギイオリ', '50000', '996', '2025-04-27 15:59:06', 126, ''),
('アオヤギイオリ', '50000', '686', '2025-04-27 15:59:21', 127, ''),
('アオヤギイオリ', '50000', '996', '2025-04-27 15:59:22', 128, ''),
('アオヤギイオリ', '25000', '686', '2025-04-27 15:59:37', 129, ''),
('MARUYAMA', '30000', '996', '2025-04-28 17:03:58', 130, ''),
('MARUYAMA', '50000', '996', '2025-04-28 18:45:55', 131, ''),
('アキラアキラ', '50000', '686', '2025-04-28 19:07:06', 132, ''),
('MARUYAMA', '50000', '996', '2025-04-29 17:31:07', 133, ''),
('ナリタマサミ', '30000', '889', '2025-05-01 11:05:44', 134, ''),
('ナリタマサミ', '50000', '686', '2025-05-01 12:29:24', 135, ''),
('09023309096', '30000', '686', '2025-05-02 10:03:17', 136, ''),
('09023309096', '50000', '686', '2025-05-02 17:07:46', 137, ''),
('シミズヤスジ', '996', '996', '2025-05-09 20:02:47', 138, ''),
('シミズヤスジ', '996', '996', '2025-05-09 20:05:13', 139, ''),
('シミズヤスジ', '776', '996', '2025-05-09 20:08:12', 140, ''),
('シミズヤスジ', '886', '996', '2025-05-09 20:08:34', 141, ''),
('シミズヤスジ', '886', '886', '2025-05-09 20:08:35', 142, ''),
('シミズヤスジ', '886', '996', '2025-05-09 20:08:40', 143, ''),
('シミズヤスジ', '886', '886', '2025-05-09 20:08:41', 144, ''),
('takeyan0120', '30000', '889', '2025-05-16 12:51:03', 145, ''),
('takeyan0120', '50000', '686', '2025-05-16 14:00:08', 146, ''),
('シミズヤスジ', '30000', '889', '2025-05-16 19:40:12', 147, ''),
('シミズヤスジ', '50000', '686', '2025-05-17 09:39:36', 148, ''),
('筋肉質のタクさん', '30000', '889', '2025-05-18 10:08:09', 149, ''),
('筋肉質のタクさん', '50000', '686', '2025-05-18 10:38:44', 150, ''),
('筋肉質のタクさん', '50000', '996', '2025-05-18 11:04:04', 151, ''),
('takeyan0120', '50000', '996', '2025-05-19 12:39:23', 152, ''),
('アキラアキラ', '50000', '996', '2025-05-20 11:53:46', 153, ''),
('アキラアキラ', '50000', '886', '2025-05-20 11:53:46', 154, ''),
('アキラアキラ', '50000', '996', '2025-05-20 11:54:35', 155, ''),
('アキラアキラ', '50000', '886', '2025-05-20 11:54:35', 156, ''),
('390419', '50000', '686', '2025-05-24 10:29:18', 157, ''),
('390419', '50000', '996', '2025-05-24 12:12:11', 158, ''),
('390419', '50000', '886', '2025-05-24 12:12:11', 159, ''),
('390419', '50000', '996', '2025-05-24 12:12:28', 160, ''),
('390419', '50000', '886', '2025-05-24 12:12:28', 161, ''),
('エンドウ　ユウジ', '30000', '102', '2025-05-29 11:56:19', 175, ''),
('amar2325', '30000', '776', '2025-05-29 13:04:49', 176, ''),
('エンドウ　ユウジ', '50000', '886', '2025-05-29 15:23:30', 177, ''),
('882233', '30000', '686', '2025-05-30 10:58:26', 178, ''),
('amar2325', '50000', '686', '2025-05-30 12:25:38', 179, ''),
('エンドウ　ユウジ', '50000', '996', '2025-05-30 13:21:52', 180, ''),
('エンドウ　ユウジ', '50000', '886', '2025-05-30 13:21:53', 181, ''),
('882233', '50000', '686', '2025-05-30 14:14:19', 182, ''),
('KENJI SAKAI ', '30000', '686', '2025-06-02 14:14:39', 183, ''),
('882233', '50000', '996', '2025-06-03 10:15:32', 184, ''),
('イシカワ　エイジ', '30000', '889', '2025-06-03 19:37:01', 185, ''),
('KENJI SAKAI ', '686', '686', '2025-06-04 10:17:23', 186, ''),
('KENJI SAKAI ', '50000', '686', '2025-06-04 10:29:10', 187, ''),
('イシカワ　エイジ', '50000', '686', '2025-06-05 18:17:38', 188, ''),
('KENJI SAKAI ', '50000', '996', '2025-06-06 09:42:55', 189, ''),
('イシカワ　エイジ', '50000', '996', '2025-06-09 17:34:21', 190, ''),
('イシカワ　エイジ', '50000', '886', '2025-06-09 17:34:22', 191, ''),
('イシカワ　エイジ', '50000', '996', '2025-06-09 17:34:35', 192, ''),
('イシカワ　エイジ', '50000', '886', '2025-06-09 17:34:36', 193, ''),
('クドウコウジ', '30000', '889', '2025-06-15 11:40:56', 194, ''),
('クドウコウジ', '50000', '686', '2025-06-15 12:25:36', 195, ''),
('クドウコウジ', '50000', '996', '2025-06-15 13:02:01', 196, ''),
('yasai39173', '30000', '889', '2025-06-24 21:19:03', 199, ''),
('yasai39173', '50000', '686', '2025-06-25 19:55:51', 200, ''),
('yasai39173', '50000', '996', '2025-06-25 20:10:07', 201, ''),
('yasai39173', '50000', '886', '2025-06-25 20:10:08', 202, ''),
('yasai39173', '50000', '996', '2025-06-25 20:10:21', 203, ''),
('naoki88', '30000', '889', '2025-06-26 20:38:10', 204, ''),
('naoki88', '50000', '686', '2025-06-28 20:30:01', 205, ''),
('naoki88', '50000', '996', '2025-06-29 20:37:20', 206, ''),
('Koichi.osame', '30000', '889', '2025-06-30 11:54:08', 207, ''),
('Koichi.osame', '50000', '686', '2025-06-30 12:01:28', 208, ''),
('kaihara', '30000', '889', '2025-07-13 10:46:07', 211, ''),
('kaihara', '50000', '686', '2025-07-13 16:32:20', 212, ''),
('1234', '40000', '102', '2025-07-14 20:24:20', 213, ''),
('カガミマサヒコ', '40000', '686', '2025-07-16 16:51:38', 214, ''),
('カガミマサヒコ', '25000', '886', '2025-07-18 13:26:33', 226, ''),
('カガミマサヒコ', '25000', '996', '2025-07-18 13:27:16', 227, ''),
('kazuya0002', '40000', '889', '2025-07-23 21:18:49', 228, ''),
('111111', '40000', '996', '2025-07-24 00:01:21', 233, ''),
('111111', '50000', '996', '2025-07-24 00:01:45', 234, ''),
('111111', '50000', '886', '2025-07-24 00:01:46', 235, ''),
('マツダエイジ', '40000', '889', '2025-07-27 13:10:16', 236, ''),
('マツダエイジ', '25000', '996', '2025-07-27 14:28:14', 237, ''),
('マツダエイジ', '25000', '889', '2025-07-27 14:28:44', 238, ''),
('キムラ　モトヒコ', '40000', '889', '2025-07-27 18:56:57', 239, ''),
('yoshihito', '40000', '889', '2025-07-28 13:48:20', 240, ''),
('kaihara', '50000', '996', '2025-08-02 11:18:40', 241, ''),
('kaihara', '50000', '886', '2025-08-02 11:18:41', 242, ''),
('kaihara', '50000', '996', '2025-08-02 11:19:01', 243, ''),
('kaihara', '50000', '886', '2025-08-02 11:19:01', 244, '');

--
-- 转储表的索引
--

--
-- 表的索引 `bulletin`
--
ALTER TABLE `bulletin`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `convension`
--
ALTER TABLE `convension`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `dating`
--
ALTER TABLE `dating`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `gift`
--
ALTER TABLE `gift`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `lang`
--
ALTER TABLE `lang`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `letter`
--
ALTER TABLE `letter`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `line`
--
ALTER TABLE `line`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `manage`
--
ALTER TABLE `manage`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `orderlist`
--
ALTER TABLE `orderlist`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `pair`
--
ALTER TABLE `pair`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `square`
--
ALTER TABLE `square`
  ADD PRIMARY KEY (`id`),
  ADD KEY `account` (`account`);

--
-- 表的索引 `staff`
--
ALTER TABLE `staff`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `sysdata`
--
ALTER TABLE `sysdata`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `vip`
--
ALTER TABLE `vip`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `vote`
--
ALTER TABLE `vote`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `bulletin`
--
ALTER TABLE `bulletin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `convension`
--
ALTER TABLE `convension`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- 使用表AUTO_INCREMENT `dating`
--
ALTER TABLE `dating`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- 使用表AUTO_INCREMENT `gift`
--
ALTER TABLE `gift`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 使用表AUTO_INCREMENT `lang`
--
ALTER TABLE `lang`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 使用表AUTO_INCREMENT `letter`
--
ALTER TABLE `letter`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- 使用表AUTO_INCREMENT `line`
--
ALTER TABLE `line`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `manage`
--
ALTER TABLE `manage`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用表AUTO_INCREMENT `orderlist`
--
ALTER TABLE `orderlist`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=275;

--
-- 使用表AUTO_INCREMENT `pair`
--
ALTER TABLE `pair`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `square`
--
ALTER TABLE `square`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=50;

--
-- 使用表AUTO_INCREMENT `staff`
--
ALTER TABLE `staff`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- 使用表AUTO_INCREMENT `sysdata`
--
ALTER TABLE `sysdata`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 使用表AUTO_INCREMENT `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=254;

--
-- 使用表AUTO_INCREMENT `vip`
--
ALTER TABLE `vip`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 使用表AUTO_INCREMENT `vote`
--
ALTER TABLE `vote`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=245;
--
-- 数据库： `lp_om`
--
CREATE DATABASE IF NOT EXISTS `lp_om` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `lp_om`;

-- --------------------------------------------------------

--
-- 表的结构 `convension`
--

CREATE TABLE `convension` (
  `account` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL,
  `height` varchar(10) NOT NULL,
  `weight` varchar(10) NOT NULL,
  `xw` varchar(10) NOT NULL,
  `job` varchar(20) NOT NULL,
  `video` varchar(50) NOT NULL,
  `avatar` varchar(50) NOT NULL,
  `jj` varchar(300) NOT NULL,
  `id` int(11) NOT NULL,
  `city` varchar(20) NOT NULL,
  `gender` varchar(20) NOT NULL,
  `country` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `convension`
--

INSERT INTO `convension` (`account`, `name`, `height`, `weight`, `xw`, `job`, `video`, `avatar`, `jj`, `id`, `city`, `gender`, `country`) VALUES
('01', 'すずき なな', '165', '51', 'D', 'ひしょかん', 'IMG_0358.MP4', 'photo_2025-03-06_01-00-23 (2).jpg', '', 1, '東京', '0', 'jp'),
('02', 'さくらい みさき', '165', '45', 'C', 'おんがく きょうし', 'IMG_6659.MP4', 'photo_2025-03-04_06-23-48.jpg', '', 2, '東京', '0', 'jp'),
('03', 'ほしの ちなつ', '163', '45', 'C', 'しょくいん', 'IMG_3936.MP4', 'Snipaste_2025-02-28_22-13-tx58.jpg', '', 4, 'なごや', '0', 'jp'),
('04', '김태희', '168', '45', 'C', '메이크업 아티스트', 'video_2025-03-04_03-11-32.mp4', 'Snipaste_2025-03-08_14-35-03.jpg', '韓國', 5, '한국 서울', '0', 'jp'),
('05', 'Nguyễn Thị Phương', '162', '47', 'B', 'y tá nữ', '1video_2025-03-08_15-23-30.mp4', '1photo_2024-12-14_03-08-36.jpg', '', 6, 'Nha Trang, Việt Nam', '0', 'jp'),
('06', '이민호', '170', '51', 'C', '모델러', 'video_2025-03-06_01-49-40.mp4', 'photo_2025-03-06_01-20-48.jpg', '', 7, '서울', '0', 'jp'),
('07', 'Lam Shi Yun', '170', '50', 'B', 'Guru Yoga', '3video_2025-03-08_15-24-16.mp4', '3photo_2024-12-28_13-04-40.jpg', '', 8, 'Kuala Lumpur', '0', 'jp'),
('08', 'やまぐち ももえ', '165', '50', 'B', 'おんがく きょうし', '5video_2025-03-08_15-24-58.mp4', '5photo_2025-02-11_02-22-01.jpg', '', 9, '福岡県', '0', 'jp'),
('09', 'いしはら さとみ', '168', '49', 'B', 'ひしょかん', '6video_2025-03-08_15-25-13.mp4', '6photo_2025-02-26_03-34-08.jpg', '', 10, '東京', '0', 'jp'),
('10', 'ほしの みゆき', '160', '45', 'C', '社員', '日本21.mp4', '日本21.png', '', 11, '横浜', '0', 'jp'),
('11', 'さき ゆうな', '162', '45', 'B', 'がくせい', '日本20.mp4', '日本20.jpg', '', 12, '青森県', '0', 'jp'),
('12', '김서영', '165', '48', 'B', '요가 코치', '地区  韩国13.mp4', '地区  韩国13.png', '', 13, '서울', '0', 'jp'),
('13', '이하늘', '165', '47', 'C', '비서 ', '地区  韩国14.mp4', '地区  韩国14.png', '', 14, '서울”', '0', 'jp'),
('14', 'Amira Harris', '165', '49', 'B', 'jurulatih renang', '地区  上海15.mp4', 'photo_2025-03-04_20-26-19.jpg', '', 15, 'Kuala Lumpur', '0', 'jp'),
('15', 'みやざき りな', '163', '52', 'C', 'けいえいたんとうしゃ', '地区  韩国18.mp4', '地区  韩国18.png', '', 16, '広島県', '0', 'jp'),
('16', 'Olivia White', '165', '52', 'B', 'stylist model', '地区 荷兰11.mp4', '地区 荷兰11.png', '', 17, 'London', '0', 'jp'),
('17', 'さくらい あやか', '163', '51', 'B', 'そつぎょうせい', '13.19.mp4', 'photo_2025-02-12_14-30-36.jpg', '', 18, '鹿児島県', '0', 'jp'),
('18', 'Ava Johnson', '165', '52', 'B', 'manikin', '地区 乌克兰3.mp4', '地区 乌克兰3.png', '', 19, 'Kharkiv', '0', 'jp'),
('19', 'Emma', '170', '55', 'B', 'chorine', '地区  韩国17.mp4', 'photo_2025-03-10_17-59-01.jpg', '', 20, 'New York', '0', 'jp'),
('20', 'やまもと たくや', '175', '68', '1', 'カヌーコーチ', '地区  台湾.mp4', '地区  台湾.png', '', 21, '宮崎県', '1', 'jp'),
('21', 'わたなべ たくや ', '175', '73', '1', 'いりょうぎょうかい', '地区 新加坡2.mp4', 'photo_2025-03-08_19-01-13.jpg', '', 22, 'きょうとふ', '1', 'jp'),
('22', 'わたなべ たくや ', '175', '75', '1', '金融セクター', '地区 越南.mp4', 'photo_2025-03-08_19-01-24.jpg', '', 23, 'いばらきけん', '1', 'jp'),
('23', 'William', '180', '80', '1', 'boxing', '地区  阿联酋.mp4', 'photo_2025-03-08_19-01-39.jpg', '', 24, 'London', '1', 'jp'),
('24', 'Oliver', '180', '95', '1', 'fitness coach', '地区  美国.mp4', 'photo_2025-03-08_19-01-44.jpg', '', 25, 'Edinburgh', '1', 'jp'),
('25', 'ろばね ゆうき', '178', '79', '1', 'ソフトウェア開発エンジニア', '地区 新加坡.mp4', 'photo_2025-03-08_19-03-06.jpg', '', 26, 'きょうとふ', '1', 'jp'),
('26', 'みやざき はやと', '178', '75', '1', '室内デザイナー', '地区 泰国3.mp4', 'photo_2025-03-08_19-03-03.jpg', '', 27, 'あきたけん', '1', 'jp'),
('27', 'さいとう かずや', '178', '79', '', 'データ解析師', '日本21.mp4', 'photo_2025-03-08_19-02-53.jpg', '', 28, '奈良県', '1', 'jp'),
('28', 'たかはし ゆうた', '178', '72', '1', '資産管理顧問', '地区 马来西亚.mp4', 'photo_2025-03-08_19-02-48.jpg', '', 29, '茨城県', '1', 'jp'),
('29', 'いとう たくしん', '178', '78', '1', '監理エンジニア', '地区  中国.mp4', 'photo_2025-03-08_19-02-41.jpg', '', 30, '愛知県', '1', 'jp'),
('30', '박지훈', '179', '80', '1', '건축사', '地区  泰国1.mp4', 'photo_2025-03-08_22-00-45.jpg', '', 31, '부산”', '1', 'jp'),
('31', 'Leo', '179', '85', '1', 'spécialiste juridiqu', '地区  意大利.mp4', 'photo_2025-03-08_22-04-26.jpg', '', 32, 'Paris', '1', 'jp'),
('32', 'Lucas', '180', '80', '1', 'médeci', '地区  伊拉克.mp4', 'photo_2025-03-08_19-01-54.jpg', '', 33, 'Marseille', '1', 'jp');

-- --------------------------------------------------------

--
-- 表的结构 `dating`
--

CREATE TABLE `dating` (
  `account` varchar(20) NOT NULL,
  `vipGrade` varchar(10) NOT NULL,
  `name` varchar(20) NOT NULL,
  `money` varchar(20) NOT NULL,
  `type` varchar(10) NOT NULL,
  `country` varchar(20) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `dating`
--

INSERT INTO `dating` (`account`, `vipGrade`, `name`, `money`, `type`, `country`, `id`) VALUES
('513203', '1', '한준석', '1200000원', '1', 'jp', 1),
('5132031', '1', '정유나', '1560000원', '1', 'jp', 2),
('5132033', '0', 'たかはし しょうた', '150000円', '0', 'jp', 3),
('5132034', '1', 'たなか あおい', '330000円', '2', 'jp', 4),
('5132035', '0', '박서연', '550000원', '2', 'jp', 5),
('5132036', '2', 'いとう しおり', '650000円', '1', 'jp', 6),
('5132037', '3', 'さき かずや', '1200000円', '0', 'jp', 7),
('5132037', '3', 'さき かずや', '100000円', '0', 'jp', 8),
('65165106520', '1', 'ほしの えり', '600000円', '1', 'jp', 9),
('65165106521', '2', 'さとう さくら', '150000円', '1', 'jp', 10),
('65165106523', '2', 'たかはし しょうた', '150000円', '1', 'jp', 11),
('65165106524', '3', 'William Thompson', '3000USTD', '1', 'jp', 12),
('65165106525', '1', 'わたなべ みほ', '120000円', '0', 'jp', 13),
('65165106526', '1', 'やまもと ゆうき', '36000円', '1', 'jp', 14),
('65165106527', '1', 'くろばね れいな', '100000円', '0', 'jp', 15),
('65169419615', '2', 'くすのき しおり', '50000円', '0', 'jp', 16),
('5132038', '3', 'Emma Müller', '6000US', '2', 'jp', 17),
('5132038', '3', 'Emma Müller', '5000US', '1', 'en', 18),
('15612', '0', 'さとう けん', '15000円', '1', 'jp', 19);

-- --------------------------------------------------------

--
-- 表的结构 `gift`
--

CREATE TABLE `gift` (
  `id` int(11) NOT NULL,
  `src` varchar(20) DEFAULT NULL,
  `name` varchar(20) NOT NULL,
  `vote` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `gift`
--

INSERT INTO `gift` (`id`, `src`, `name`, `vote`) VALUES
(1, '3.jpg', '889', '1292397'),
(2, '9.jpg', '686', '1263564'),
(3, 'om1.jpg', '996', '978653'),
(4, 'xjp.jpg', '886', '960272'),
(5, 'om3.jpg', '776', '576166'),
(6, 'ko1.jpg', '102', '898688');

-- --------------------------------------------------------

--
-- 表的结构 `lang`
--

CREATE TABLE `lang` (
  `lang` varchar(20) NOT NULL,
  `flag` varchar(10) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `lang`
--

INSERT INTO `lang` (`lang`, `flag`, `id`) VALUES
('日语', '1', 1),
('韩语', '1', 2),
('英语', '1', 3),
('越南语', '1', 4),
('繁体中文', '1', 5);

-- --------------------------------------------------------

--
-- 表的结构 `letter`
--

CREATE TABLE `letter` (
  `id` int(11) NOT NULL,
  `account` varchar(20) NOT NULL,
  `content` varchar(500) NOT NULL,
  `img` varchar(50) NOT NULL,
  `date` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `letter`
--

INSERT INTO `letter` (`id`, `account`, `content`, `img`, `date`, `name`) VALUES
(1, 'asdsdd', '心いっぱいの感謝の気持ちを込めて、この手紙を書かせていただきます。少し前まで、私は貴プラットフォームを通じて、今の彼女と出会うことができました。彼女の現れは私の生活を明るく照らしました。プラットフォームの正確なマッチングと思いやりのあるサービスのおかげで、私たちは広い人ごみの中を越えて、一緒になることができました。\r\n\r\n最初のオンライン交流から、オフラインでのデートのときのドキドキする瞬間まで、どの一歩もプラットフォームの力なしには成り立ちませんでした。今、私たちの関係は安定しており、未来に向かって大いに期待しています。心から貴プラットフォームが提供してくれた素敵な交友環境に感謝いたします。これにより、愛の花がきれいに咲きました。プラットフォームがますます素敵なものになり、もっと多くの人が幸せを手に入れられるように、心から願っています 。', '', '2025-02-23', 'くすのき しおり'),
(2, 'asdasd', '貴プラットフォームに加入する前は、私はずっと広い人ごみの中で、生涯一緒にいる相手を見つけることを期待していました。思いも寄らなかったことに、プラットフォームが巧みに私と私の夫をつないでくれました。初めてプラットフォームで彼の情報を見たとき、妙な感じが自然に湧いてきました。チャットを始めてから、私たちは驚いたことに、たくさんの共感を見つけました。', '', '2021-05-25', 'たなか あおい'),
(3, '65165106525', 'オンラインでのやり取りの盛んな交流から、オフラインで会ったときの彼の暖かい笑顔や思いやりのある行動まで、どの瞬間もプラットフォームの存在によって可能になりました。付き合いが深まるにつれて、私たちの愛情はますます厚くなりました。今、私たちは未来の生活に満ち溢れた期待を抱いており、たくさんの素敵な未来の計画を立てています。', '', '2019-6-19', 'たかはし しょうた'),
(4, 'asdasddd', 'こんにちは！心からの感謝の気持ちを皆さんにお伝えしたいと思います。貴プラットフォームを通じて、イギリスに住んでいる彼氏と出会うことができました。彼の登場により、私の世界はこれまで以上に輝き始めました。\r\n\r\n元々は遠く離れていた私たちが、プラットフォームの正確なマッチングと心のこもったサービスを通じて、素敵な縁をつなぐことができました。オンラインで時差を越えた盛り上がったチャットから、オフラインで国境を越えて会ったときのドキドキする瞬間まで、どの一歩もプラットフォームのおかげです。今、私たちの関係は安定しており、未来に対して大いに期待を抱いています。', '', '2021-05-25', '樱井 葵'),
(5, '65165106525', 'When I first saw her profile on the platform, it was as if I had been enchanted, and my heart rate unconsciously accelerated. During our online communication, we were like two people who had opened a chatterbox and just couldn\'t stop. From those strange and niche hobbies to our wild fantasies about the future, every conversation was like exploring a whole new world, full of constant surprises.\r\n\r\nFinally, the day of our offline date arrived. I was so nervous that I didn\'t know what to do with my', '', '2022-09-24', 'William'),
(6, 'asdasdddd', '제 마음 가득 감사의 마음이 넘쳐서, 빨리 이야기하고 싶습니다. 귀하의 플랫폼에 가입하기 전에 제가 사랑을 찾는 길은 아주 길었고, 자주 실망했습니다. 하지만 가입한 후에는 모든 게 달라졌습니다.\r\n\r\n플랫폼의 정확한 필터 기능이 너무 강력합니다. 제가 취미, 성격 취향 등 조건을 설정하자 곧 그녀의 프로필을 볼 수 있었습니다. 첫 번째 온라인 소통할 때 제가 문제를 만났는데, 플랫폼 고객센터가 신속하게 대응하고, 인내심 있게 안내해줘서 소통이 원활하게 이어질 수 있었습니다. 오프라인 데이트 때는 플랫폼에서 추천한 장소가 너무 낭만적이고 적절해서 우리 만남이 특히나 아름답게 됐습니다.', '', '2024-05-15', '박지원'),
(7, '65165106525', 'With a heart full of gratitude, I am earnestly writing this letter. \"May I find a heart - to - heart person and stay with him until the end of our days.\" The once - beautiful expectation for love has now become a reality on your platform. Not long ago, with the help of the platform\'s precise matching and meticulous and considerate services, I met my current girlfriend. She is like a warm sun, instantly lighting up my life.', '', '2023-07-18', 'Sophia'),
(8, 'asdasddddd', 'From the instant sense of familiarity in our first online conversation to the heart - pounding moment during our offline date, along the way, the platform has played an extremely important role. Now, our relationship is firm, and we are full of anticipation for the future. I sincerely thank your platform for creating a high - quality dating environment, allowing the flower of love to bloom brightly. May the platform thrive and help more people encounter good fortune and harvest happiness.', '', '2024-07-13', 'Rossi'),
(9, '65165106525', '감사합니다! 귀하의 플랫폼을 통해 제 여자친구와 만났습니다. 온라인으로 열심히 소통하고, 오프라인 데이트에서 설레는 감정을 느끼는데, 모두 플랫폼의 도움 덕분입니다. 지금 우리 사이의 감정은 안정적이고, 미래에 대한 기대감이 넘쳐납니다. 플랫폼이 제공하는 우수한 환경에 감사드립니다. 이로 인해 사랑이 피어나게 된 것입니다. 플랫폼이 더욱 더 발전해 더 많은 사람들이 행복을 가질 수 있도록 기원합니다. ', '', '2023-03-28', '김지윤');

-- --------------------------------------------------------

--
-- 表的结构 `line`
--

CREATE TABLE `line` (
  `name` varchar(20) NOT NULL,
  `line` varchar(20) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 表的结构 `manage`
--

CREATE TABLE `manage` (
  `account` varchar(20) NOT NULL,
  `password` varchar(20) NOT NULL,
  `loginFlag` varchar(10) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='			weight: '''', 			xw: '''', 			job';

--
-- 转存表中的数据 `manage`
--

INSERT INTO `manage` (`account`, `password`, `loginFlag`, `id`) VALUES
('xiaohu', 'xiaohu123', '1', 1);

-- --------------------------------------------------------

--
-- 表的结构 `operator`
--

CREATE TABLE `operator` (
  `account` varchar(20) NOT NULL,
  `content` varchar(255) NOT NULL,
  `doing` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 表的结构 `orderlist`
--

CREATE TABLE `orderlist` (
  `id` int(11) NOT NULL,
  `account` varchar(20) NOT NULL,
  `makeMoney` varchar(20) NOT NULL,
  `type` varchar(10) NOT NULL,
  `date` varchar(30) NOT NULL,
  `status` varchar(10) NOT NULL DEFAULT '0' COMMENT '0待审核 1已通过 2已拒绝'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `orderlist`
--

INSERT INTO `orderlist` (`id`, `account`, `makeMoney`, `type`, `date`, `status`) VALUES
(16, 'TETU0523', '6000', '1', '2025-03-14 17:06:20', '1'),
(18, '1234', '1000', '0', '2025-03-14 17:33:12', '1'),
(19, 'ニシダサネヒト', '6000', '0', '2025-03-17 11:58:29', '1'),
(20, 'ニシダサネヒト', '24000', '0', '2025-03-17 14:06:29', '1'),
(21, 'エルヴィン　スミス', '6000', '1', '2025-03-17 17:29:05', '1'),
(22, '08018458895', '6000', '1', '2025-03-17 17:54:13', '1'),
(23, 'エルヴィン　スミス', '20000', '0', '2025-03-18 12:16:44', '1'),
(24, 'エルヴィン　スミス', '25000', '1', '2025-03-18 18:19:51', '1'),
(25, '08018458895', '24000', '0', '2025-03-18 18:41:35', '1'),
(26, 'Aung san lin', '7000', '1', '2025-03-19 10:36:22', '1'),
(27, '08018458895', '24000', '1', '2025-03-19 11:21:21', '2'),
(28, 'izumis18', '6000', '1', '2025-03-20 10:21:43', '1'),
(29, '08018458895', '120000', '0', '2025-03-21 19:43:35', '1'),
(30, 'Aung san lin', '20000', '0', '2025-03-22 15:57:28', '1'),
(31, 'なおきいしかわ', '5000', '0', '2025-03-22 16:03:21', '1'),
(32, 'なおきいしかわ', '6000', '1', '2025-03-22 16:23:47', '1'),
(33, 'Aung san lin', '24000', '1', '2025-03-22 18:13:38', '1'),
(34, '08018458895', '144000', '1', '2025-03-22 23:35:24', '2'),
(35, 'fukuda', '5000', '0', '2025-03-23 17:54:34', '1'),
(36, 'fukuda', '6000', '1', '2025-03-23 18:02:41', '0'),
(37, 'ユタユタゆたか', '5000', '0', '2025-03-25 12:40:44', '1'),
(38, 'ユタユタゆたか', '6000', '1', '2025-03-25 13:17:32', '1'),
(39, '09074334179', '5000', '0', '2025-03-25 15:30:32', '1'),
(40, '09074334179', '30000', '0', '2025-03-26 11:15:04', '1'),
(41, '09074334179', '42000', '1', '2025-03-26 11:21:46', '2'),
(42, '09074334179', '36000', '1', '2025-03-26 11:26:38', '1'),
(43, 'ユタユタゆたか', '30000', '0', '2025-03-26 14:41:33', '1'),
(44, 'ユタユタゆたか', '36000', '1', '2025-03-26 16:23:09', '1'),
(45, 'ユタユタゆたか', '50000', '0', '2025-03-26 16:59:47', '1'),
(46, 'ユタユタゆたか', '60000', '1', '2025-03-26 17:09:21', '1'),
(47, '08060931376', '5000', '0', '2025-03-28 14:42:34', '1'),
(48, '08060931376', '6000', '1', '2025-03-28 15:16:04', '1'),
(49, 'ユタユタゆたか', '500000', '0', '2025-03-28 15:25:47', '1'),
(50, 'ユタユタゆたか', '100000', '1', '2025-03-28 15:29:02', '1'),
(51, 'ユタユタゆたか', '720000', '0', '2025-03-28 15:45:38', '2'),
(52, '1234', '100', '0', '2025-03-28 16:55:37', '2'),
(53, '6389547048', '100000', '1', '2025-03-28 17:08:05', '2'),
(54, '08060931376', '30000', '0', '2025-03-28 17:09:56', '1'),
(55, '孤独なこうじ', '5000', '0', '2025-03-28 17:10:25', '1'),
(56, 'snari3', '5000', '0', '2025-03-28 17:20:01', '1'),
(57, '08060931376', '6000', '1', '2025-03-28 18:05:32', '2'),
(58, 'コナンキュウ', '5000', '0', '2025-03-28 18:22:34', '1'),
(59, 'コナンキュウ', '5000', '1', '2025-03-29 10:26:46', '1'),
(60, 'snari3', '30000', '0', '2025-03-29 11:11:12', '1'),
(61, 'snari3', '36000', '1', '2025-03-29 12:00:44', '1'),
(63, 'snari3', '60000', '1', '2025-03-29 13:51:11', '1'),
(64, '08018458895', '144000', '1', '2025-03-29 15:26:29', '0'),
(65, '090-7852-5619', '6000', '1', '2025-03-30 12:45:57', '1'),
(66, 'Boohfree', '6000', '0', '2025-03-31 10:42:23', '1'),
(67, 'Boohfree', '6000', '1', '2025-03-31 10:51:52', '1'),
(68, 'Boohfree', '36000', '1', '2025-03-31 17:43:45', '1'),
(69, 'Boohfree', '50000', '0', '2025-04-01 12:40:31', '1'),
(70, 'Boohfree', '60000', '1', '2025-04-01 13:25:41', '1'),
(71, 'エルヴィン　スミス', '60000', '1', '2025-04-01 15:26:20', '1'),
(72, 'エルヴィン　スミス', '100000', '0', '2025-04-02 14:53:41', '1'),
(73, 'takahara', '6000', '1', '2025-04-03 20:42:36', '1'),
(74, 'アグニシゲヤ', '1000', '0', '2025-04-05 17:42:04', '2'),
(75, '86112311', '6000', '1', '2025-04-05 18:53:33', '1'),
(76, 'アグニシゲヤ', '5000', '1', '2025-04-05 19:59:10', '2'),
(77, '08060931376', '48000', '0', '2025-04-06 10:16:21', '1'),
(78, 'アグニシゲヤ', '6000', '1', '2025-04-06 10:38:07', '0'),
(79, '08060931376', '178000', '1', '2025-04-06 15:39:58', '2'),
(80, 'KOHMIYA', '6000', '1', '2025-04-06 17:02:13', '1'),
(81, 'KOHMIYA', '30000', '0', '2025-04-06 17:40:33', '1'),
(82, 'noboru', '6000', '1', '2025-04-07 17:41:09', '1'),
(83, 'KOHMIYA', '36000', '1', '2025-04-09 11:40:03', '0'),
(84, 'ウエハラ1945', '1000', '1', '2025-04-09 13:46:36', '2'),
(85, 'ウエハラ1945', '5000', '1', '2025-04-09 14:10:21', '2'),
(86, 'ウエハラ1945', '6000', '1', '2025-04-09 14:13:29', '1'),
(89, 'michiaki1496', '6000', '1', '2025-04-10 14:09:05', '1'),
(90, 'もも19940720', '120000', '1', '2025-04-10 14:50:51', '1'),
(91, '08095325189', '30000', '0', '2025-04-10 20:24:01', '2'),
(92, 'クサノケンジ', '6000', '1', '2025-04-11 10:57:46', '1'),
(93, 'michiaki1496', '36000', '1', '2025-04-11 15:52:37', '1'),
(94, 'michiaki1496', '60000', '1', '2025-04-11 17:49:28', '1'),
(95, 'abc123', '6000', '1', '2025-04-11 17:49:46', '1'),
(96, 'abc123', '30000', '0', '2025-04-12 10:16:59', '1'),
(97, 'abc123', '36000', '1', '2025-04-12 10:56:43', '1'),
(98, 'abc123', '50000', '0', '2025-04-12 11:37:06', '2'),
(99, 'クサノケンジ', '36000', '1', '2025-04-12 11:46:54', '1'),
(100, 'abc123', '60000', '1', '2025-04-12 11:51:54', '1'),
(101, 'クサノケンジ', '60000', '1', '2025-04-12 15:21:58', '1'),
(102, '111111', '5000', '0', '2025-04-12 20:28:58', '1'),
(103, '111111', '3000', '0', '2025-04-12 20:30:07', '1'),
(104, '111111', '50000', '0', '2025-04-13 17:43:39', '1'),
(105, '111111', '30000', '0', '2025-04-13 17:47:18', '1'),
(106, '999999', '6000', '1', '2025-04-16 11:59:38', '1'),
(107, 'ずもとこういち', '36000', '1', '2025-04-16 15:12:58', '1'),
(108, '090-7852-5619', '120000', '1', '2025-04-16 16:16:19', '2'),
(109, '999999', '36000', '1', '2025-04-16 18:13:12', '1'),
(110, 'ずもとこういち', '60000', '1', '2025-04-17 14:58:47', '1'),
(111, '999999', '60000', '1', '2025-04-18 05:37:44', '1'),
(112, '09024307925', '6000', '1', '2025-04-19 15:11:41', '1'),
(113, 'kohaku39', '6000', '1', '2025-04-20 09:14:22', '1'),
(114, '09024307925', '30000', '0', '2025-04-20 12:07:37', '1'),
(116, '09024307925', '36000', '1', '2025-04-20 12:21:58', '1'),
(117, 'はやし　てつあき', '6000', '1', '2025-04-20 13:52:43', '1'),
(118, 'タケノコダヨ', '6000', '1', '2025-04-20 17:25:07', '1'),
(119, 'ⅠⅨⅦⅨ0Ⅴ', '5000', '0', '2025-04-23 12:13:21', '1'),
(120, 'ⅠⅨⅦⅨ0Ⅴ', '6000', '1', '2025-04-23 12:22:14', '1'),
(121, 'michiaki1496', '840000', '1', '2025-04-23 13:38:39', '2'),
(122, 'ⅠⅨⅦⅨ0Ⅴ', '36000', '1', '2025-04-23 15:00:46', '1'),
(123, 'ⅠⅨⅦⅨ0Ⅴ', '60000', '1', '2025-04-23 16:00:26', '1'),
(124, '72881276', '6000', '1', '2025-04-23 18:02:44', '1'),
(125, '72881276', '36000', '1', '2025-04-23 19:17:15', '1'),
(126, 'アキラアキラ', '36000', '1', '2025-04-23 19:44:58', '1'),
(127, 'michiaki1496', '2640000', '1', '2025-04-24 10:14:06', '2'),
(129, 'マサミナリタ', '6000', '1', '2025-04-24 13:05:38', '1'),
(131, '72881276', '60000', '1', '2025-04-24 11:58:36', '1'),
(132, 'yoshi0606', '6000', '1', '2025-04-24 15:14:46', '1'),
(133, '1', '1', '0', '2025-04-24 15:49:01', '2'),
(134, '1', '1', '0', '2025-04-24 15:50:50', '2'),
(135, '1', '1', '1', '2025-04-24 15:51:10', '1'),
(136, '81865284731', '1000', '0', '2025-04-24 19:54:31', '0'),
(137, '09024307925', '36000', '1', '2025-04-24 20:14:46', '1'),
(138, 'michiaki1496', '3840000', '1', '2025-04-25 10:29:02', '2'),
(139, '1254KE', '6000', '1', '2025-04-25 15:44:34', '1'),
(140, 'ナカムラ　シゲミツ', '6000', '1', '2025-04-26 12:14:08', '1'),
(141, '090-7852-5619', '120000', '1', '2025-04-26 12:29:27', '2'),
(142, 'ナカムラ　シゲミツ', '36000', '1', '2025-04-26 13:24:52', '2'),
(143, 'アオヤギイオリ', '6000', '1', '2025-04-26 16:28:20', '1'),
(145, 'ナカムラ　シゲミツ', '50000', '1', '2025-04-26 18:26:48', '2'),
(146, 'ナカムラ　シゲミツ', '36000', '1', '2025-04-26 18:22:16', '1'),
(147, 'ナカムラ　シゲミツ', '60000', '1', '2025-04-26 18:37:42', '1'),
(148, 'ナカムラ　シゲミツ', '100000', '1', '2025-04-26 19:23:22', '2'),
(149, 'ナカムラ　シゲミツ', '100000', '1', '2025-04-26 19:31:35', '2'),
(150, 'アオヤギイオリ', '30000', '1', '2025-04-27 10:18:38', '2'),
(151, 'アオヤギイオリ', '36000', '1', '2025-04-27 10:55:35', '1'),
(152, 'アオヤギイオリ', '60000', '1', '2025-04-27 11:48:18', '2'),
(153, 'MARUYAMA', '6000', '1', '2025-04-27 20:59:28', '1'),
(154, 'michiaki1496', '8232000', '1', '2025-04-28 13:42:42', '2'),
(155, 'michiaki1496', '8232000', '1', '2025-04-28 15:21:54', '2'),
(156, 'michiaki1496', '8232000', '1', '2025-04-28 15:27:16', '2'),
(157, 'michiaki1496', '100000', '1', '2025-04-28 16:08:05', '1'),
(158, 'MARUYAMA', '30000', '0', '2025-04-28 16:29:47', '1'),
(159, 'MARUYAMA', '36000', '1', '2025-04-28 17:15:46', '1'),
(160, 'MARUYAMA', '50000', '1', '2025-04-28 18:45:27', '2'),
(161, 'アキラアキラ', '60000', '1', '2025-04-28 19:15:21', '1'),
(162, 'MARUYAMA', '60000', '1', '2025-04-28 19:16:27', '1');

-- --------------------------------------------------------

--
-- 表的结构 `pair`
--

CREATE TABLE `pair` (
  `account` varchar(20) NOT NULL,
  `avatar` varchar(50) NOT NULL,
  `pairAccount` varchar(20) NOT NULL,
  `pairAvatar` varchar(50) NOT NULL,
  `vipCode` varchar(20) NOT NULL,
  `id` int(11) NOT NULL,
  `date` varchar(10) NOT NULL,
  `status` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 表的结构 `square`
--

CREATE TABLE `square` (
  `id` int(11) NOT NULL,
  `account` varchar(20) NOT NULL,
  `avatar` varchar(50) NOT NULL,
  `title` varchar(20) NOT NULL,
  `content` varchar(325) NOT NULL,
  `source` varchar(50) NOT NULL,
  `date` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL,
  `vipGrade` varchar(20) NOT NULL,
  `likes` varchar(10) NOT NULL,
  `comment` varchar(10) NOT NULL,
  `share` varchar(10) NOT NULL,
  `country` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `square`
--

INSERT INTO `square` (`id`, `account`, `avatar`, `title`, `content`, `source`, `date`, `name`, `vipGrade`, `likes`, `comment`, `share`, `country`) VALUES
(1, '123', '24.jpg', 'Sweating profusely o', 'Fitness is not a momentary impulse but a day - by - day perseverance. In this space full of strength, we water the most beautiful flower of figure with our sweat. ', 'Snipaste_2025-02-26_14-52-30.png', '2024-01-23 14:07:05', 'Marry', '3', '65654', '3256', '1325', ''),
(2, '1234', '23.jpg', 'ヨガは私の変身を見届けた ', '私は初めてのときは下手でしたが、今では上手になりました。心も落ち着き、ヨガは私の成長を見てきました。今日もヨガルームでたくさんのことを学びました。', 'Snipaste_2025-02-26_14-51-47.png', '2024-01-23 18:12:23', '樱井 葵', '2', '24515', '35210', '1564', ''),
(3, '12345', 'Snipaste_2025-02-28_21-59-韩国风景14.jpg', '산꼭대기', '주말에 산에 올라가 친구들과 산속에서 놀며 웃었어요. 행복이 이렇게 간단하죠. ', 'Snipaste_2025-02-28_22-00-韩国02.jpg', '2024-02-20 17:16:28', '박지원', '3', '15218', '896', '156', ''),
(4, '123451', 'Snipaste_2025-02-28_22-21-44.jpg', 'I\'m driving to see y', 'Driving with my dog to embrace love, the wind and the dog\'s fur are both sweet.', 'Snipaste_2025-02-28_21-51-美国人44.jpg', '2024-02-21 20:07:00', 'David', '3', '5000+', '999+', '512', ''),
(5, '123452', 'Snipaste_2025-02-28_22-22-44.jpg', 'LOVE PARTY に感謝いたします', 'このプラットフォームで今の妻と出会いました。皆さん、きれいでしょう？', 'Snipaste_2025-02-28_21-35-45.jpg', '2024-02-21 16:06:09', 'さとう けんた', '2', '999+', '258', '12', ''),
(6, '123453', 'Snipaste_2025-02-28_22-11-24.jpg', 'Be at home alone', 'Staying at home taking selfies, I\'m like a mischievous elf. With so many funny expressions and full of joy, each photo is my masterpiece of fun!', 'Snipaste_2025-02-28_21-32-41.jpg', '2024-03-06 12:26:40', 'Emily', '3', '10512', '25112', '3251', ''),
(7, '123454', 'Snipaste_2025-02-28_22-15-头像11.jpg', 'このプラットフォームでイギリス人の彼氏と', 'イギリスに来て、ボーイフレンドと顔合わせ成功！', 'Snipaste_2025-02-28_21-34-56.jpg', '2024-03-13 14:16:17', 'ふじわら しずか', '3', '16521', '7854', '152', ''),
(9, '8', 'Snipaste_2025-03-08_22-15-15.jpg', '인생 조언: 영원히 좋은 일이 곧 일', '어느 날, 제이미는 실업 상태에서 지친 마음으로 집을 나섰다. 그는 수많은 면접을 보았지만, 모두 실패했었다. 그가 길을 걷다가 길가에 있는 작은 고양이를 발견했다. 고양이는 다리가 다치고 울고 있었다. 제이미는 마음이 따뜻해져 고양이를 데리고 동물 병원에 갔다. 병원에서 고양이를 치료하는 동안, 그는 동물 보호 단체의 직원과 친해졌다. 그 직원은 제이미의 마음씨를 인정하고, 단체에서 일할 기회를 제안했다. 이렇게 제이미는 실망의 연속에서 벗어나 새로운', 'Snipaste_2025-03-08_22-15-56.jpg', '2024-03-18 17:20:43', '달빛소녀', '1', '1548', '1951', '152', ''),
(10, '9', 'Snipaste_2025-03-08_22-21-27.jpg', '東京の市街地の美しい景色', '東京タワーはパリのエッフェル塔をモデルにして建設され、高さは 332.6 メートルで、角錐形の鉄塔で、四本の脚で支えられています。全体的なデザインはシンプルで力強さを感じさせ、ラインが流暢で、あらゆる角度から見ても非常に美しさがあります。\n', 'Snipaste_2025-03-08_22-20-59.jpg', '2024-03-18 18:07:18', 'ねこの夢', '2', '2548', '3521', '148', ''),
(11, '7', 'Snipaste_2025-03-08_22-28-19.jpg', '花火の呗', '朝のゴルフ場は、芝生が一面に広がり、草の葉に露がきらきらと光っています。私は草の香りを含んだ空気を深く吸い込み、今日の最初の打ちを準備します。大自然と心地よい対話をすることを楽しみにしています。', 'Snipaste_2025-03-08_22-28-00.jpg', '2024-03-19 15:02:02', 'さくらい みさき', '2', '11502', '53652', '1529', ''),
(12, '10', 'Snipaste_2025-03-09_00-12-17.jpg', '首にチェック柄のマフラーを巻いています', '両手を広げて、まるで雪景色に浸り、喜びに酔っているかのようです。背景は両側に建物が立ち並ぶ通りで、地面や建物には雪が積もっています。通りには黒い車が停まっており、通行人も歩いています。空は青々としており、全体的な雰囲気はすがすがしく明るく、冬の趣をたっぷりと感じさせます 。', 'Snipaste_2025-03-09_00-11-40.jpg', '2024-03-21 14:20:27', 'ほしの あやか ', '1', '5121', '124512', '1211', ''),
(13, '11', 'Snipaste_2025-03-09_00-12-35.jpg', 'に富士山の', '遠くには雄大な富士山が見え、山頂は雪で覆われており、青空の引き立てで格別に壮観です。全体的な画面は濃厚な日本の街並みの風情に満ちており、同時に富士山の美しさも披露しています 。', 'Snipaste_2025-03-09_00-13-15.jpg', '2024-03-24 09:37:31', 'いとう ゆうま ', '2', '1241', '2332', '125', ''),
(14, '12', 'Snipaste_2025-03-09_00-13-42.jpg', 'これは現代的な雰囲気溢れる建物の内部廊下', '独特な幾何学的な造形の柱と穿孔金属の壁面が、シンプルでデザイン性の高い空間を作り出しています 。\n', 'Snipaste_2025-03-09_00-12-52.jpg', '2024-04-10 11:17:06', '（よしおか り', '2', '1241', '12941', '2541', ''),
(15, '13', 'Snipaste_2025-03-09_00-14-08.jpg', '素敵な雰囲気に浸る', '湖は濃い青みを帯び、きらきらと光っています。このシーンはおそらく日本の富士五湖エリアでしょう。そこは富士山の美しい景色を楽しむ絶好の場所の一つです 。', 'Snipaste_2025-03-09_00-14-26.jpg', '2024-03-29 17:17:16', 'ささき ゆう', '0', '1521', '5674', '291', ''),
(16, '13', 'Snipaste_2025-03-09_00-14-56.jpg', 'あなたとお話がしたいです', 'このプラットフォームで本当の愛を見つけることができます。ここでは、たくさんの素敵な人たちと出会えるチャンスがあります。人とのつながりを大切にし、真摯な気持ちで交流すれば、運命の人と出会うかもしれません。本当の愛は時に突然やってきます。このプラットフォームを通じて、あなたの人生に光をもたらす特別な人を見つけましょう。', 'Snipaste_2025-03-09_00-15-57.jpg', '2025-03-15 00:00:00', '佐々木 優奈', '2', '65412', '125421', '12549', ''),
(17, '11', 'Snipaste_2025-03-31_21-14-51.jpg', '恋の奇跡、私の毎日を照らす', '恋愛プラットフォームをきっかけに出会った彼と、これまで想像もできなかった幸せな日々を送っています。初めて目が合った瞬間、心臓が大きく鼓動するような特別な感じがしました。彼の笑顔はいつも私の元に明るい光をもたらしてくれ、どんな辛いことも一緒に乗り越えられる気がします。普段は、お互いの趣味を共有しながら過ごしたり、時にはただ二人でいるだけでも幸せな時間を過ごします。このままずっと一緒にいられることを願って、これからもたくさんの素敵な思い出を作っていきたいです。 #恋愛 #幸せ #奇跡の出会い', 'Snipaste_2025-03-09_00-14-40.jpg', '2025-03-11 13:06:03', 'もりかわ ゆうしん', '2', '87888', '78785', '5588', ''),
(18, '22', 'Snipaste_2025-03-31_21-15-44.jpg', '出会いから、想いが募る日常', '彼との出会いは本当に運命的なものでした。最初のチャットの時から、共通の話題がたくさんあり、時間があっという間に過ぎてしまいました。それから、日々の生活が少しずつ彼との存在で彩られていきました。朝のメッセージで元気にされ、疲れた時には彼の優しい言葉で癒されます。休日には、一緒に旅行に出かけたり、家でゆっくり映画を見たりして、二人だけの特別な時間を大切にしています。彼との出会いが私の人生を素敵に変えてくれたことに感謝しています。 #恋愛中 #幸せな時間 #出会いの喜び', 'Snipaste_2025-03-09_00-12-17.jpg', '2025-03-24 11:15:00', 'かたぎり あやか', '2', '14121', '2554', '774', ''),
(19, '33', 'Snipaste_2025-03-31_21-16-13.jpg', '恋は、小さな幸せの集まり', '恋愛プラットフォームを通じて出会った彼と、毎日が幸せな冒険のようです。彼は私のことを完全に受け入れてくれて、私が本当の自分でいられるようにしてくれます。朝、一緒に朝食を作ったり、夕方には公園を散歩しながら日々の出来事を話し合ったりするのが大好きです。それぞれの小さな喜びや悲しみを共有しながら、二人の絆が深まっていくのが感じられます。この幸せな時間を大切にしながら、これからもずっと一緒にいたいと強く願っています。 #恋愛の喜び #小さな幸せ #二人の絆', 'Snipaste_2025-03-09_00-16-14.jpg', '2025-03-27 10:06:03', 'はせがわ かえで', '2', '33678', '7475', '457', ''),
(20, '44', 'Snipaste_2025-03-31_21-16-33.jpg', '運命の恋、私の人生を変えた', '彼と出会ってから、私の人生は 180 度変わりました。恋愛プラットフォームでの出会いが、私にこんなに素敵な人と出会えるチャンスを与えてくれました。彼は私のパートナーであり、支えでもあります。一緒に困難に立ち向かったり、夢を追い求めたりする過程で、二人の関係がますます強くなっています。普段は、彼の笑顔を見るだけで幸せな気持ちになれます。この幸せをずっと続けていきたいと、心から願っています。 #運命の恋 #人生の転機 #幸せな未来', 'Snipaste_2025-03-09_00-16-26.jpg', '2025-03-28 18:15:29', 'うえの あおい', '2', '678565', '45245', '458', ''),
(21, '55', 'Snipaste_2025-03-31_21-16-59.jpg', '恋に落ちて、幸せな日常を生きる', '恋愛プラットフォームで出会った彼と、幸せな日常を送っています。彼と一緒にいると、どんなことが起こっても心配にならないくらい安心できます。彼は私のことを大切にしてくれるだけでなく、私を成長させてくれる存在でもあります。二人で料理を作ったり、音楽を聴きながら踊ったりするのが好きで、たくさんの楽しい思い出を作ってきました。この幸せな恋を大切にしながら、これからもたくさんの素敵な瞬間を共有していきたいです。 #恋愛中 #幸せな日常 #愛と成長', 'Snipaste_2025-03-09_00-17-06.jpg', '2025-03-29 12:18:02', 'たけうち りょうしん', '2', '77527', '4524', '455', ''),
(23, '3627557', '哪个大神能帮我把后面的人p掉_1_囡囡哇_来自小红书网页版.jpg', '당신을 빛으로 여겨 인연의 길을 밝혀', '인연은 참 기묘하네요. 클럽을 통해 우리가 낯선 사이에서 친숙해지게 되었습니다. 이 사진들을 찍은 후 아마도 사랑 이야기가 방금 시작된 것일지도 모릅니다. ', 'photo_2025-04-07_14-48-49.jpg', '2025-02-01 09:06:00', '이은아', '2', '74748', '7463', '354', 'ko'),
(24, '83737668', '소풍가기 좋은날씨야💥_1_姜马露_来自小红书网页版.jpg', '사랑의 이름으로 당신과 평생 함께 걸', '원래 사랑하는 사람에게 구혼받는 것이 이런 기분이구나, 가득한 기쁨과 무척 안심이에요. 줄곧 당신은 저에게 끝없는 부드러움과 편애를 주었어요. 저는 물론이야, 당신과 손잡고 미래의 날들을 가장 아름다운 시로 만들겠습니다.', 'Snipaste_2025-04-07_21-23-54.png', '2024-12-12 19:02:02', '윤진', '2', '45664', '7543', '353', 'ko'),
(25, '8534325', '鱼尾狮_1_Snake Eyes_来自小红书网页版.jpg', 'Starting from the mo', '濱海灣花園的擎天大樹下，我們的身影被燈光拉長，交織在一起。每一片閃爍的燈火，都見證著此刻我望向你時，眼中藏不住的愛意，願時光停駐，我們的愛如這花園的繁茂永不落幕 。 ', 'Snipaste_2025-04-07_22-06-14.png', '2024-07-17 21:00:12', 'Jack', '2', '46655', '6656', '543', 'zh'),
(26, '9683789', 'Snipaste_2025-04-09_16-52-03.png', 'What does it matter ', 'Without too many words, just quietly being with you makes the time wonderful enough.', 'photo_2025-04-07_14-44-美国.jpg', '2025-01-16 20:05:02', 'Leo', '2', '74223', '4326', '432', '英国'),
(27, '54637373', 'Snipaste_2025-04-09_17-07-07.png', '記錄人間美好 / 生活碎片', '祈盼在茫茫人海中，與你不期而遇，從此譜寫屬於我們的浪漫情章。', 'photo_2025-04-07_14-49-35.jpg', '2025-04-07 08:01:02', '許孜薈', '2', '24876', '2132', '232', 'zh'),
(28, '6473563', 'Snipaste_2025-04-09_17-16-12.png', 'Looking for someone ', 'I\'m longing for her to enjoy the scenery with me and unlock the door to love. ', 'Snipaste_2025-04-09_17-14-39.png', '2025-03-26 11:02:02', 'Oliver', '2', '13653', '1265', '233', '英国'),
(29, '3246678', '🎢🌍Universal in SG🇸🇬!!_1_Vvvicky_^_来自小红书网页版.jpg', '與你共赴浪漫宇宙', '和外國男友談戀愛，語言雖有不同，但一個眼神、一個微笑，愛意便能心領神會，浪漫滿分。', 'photo_2025-04-07_16-53-24.jpg', '2024-10-01 14:08:00', '李詩涵', '2', '63628', '2886', '930', 'zh'),
(31, '4224821', 'Snipaste_2025-04-09_17-43-27.png', '혼자인 여행, 사랑과의 만남을 기다리', '앞으로의 세월에 운명으로 만난 그 사람과 따뜻하고 따뜻한 작은 집에서 함께 살기를 바랍니다. 아침에 일어나 상대방을 위해 아침 식사를 준비하고 밤에는 함께 안고 자서 매일의 잡다한 일에도 단콩이 가득 찰 수 있도록 합니다.  ', 'Snipaste_2025-04-07_21-14-55.png', '2025-01-30 21:02:14', '이민정', '2', '73328', '5432', '674', 'ko'),
(32, '778558', 'Snipaste_2025-04-09_18-07-41.png', '护照上的爱情：跨国恋的奇妙旅程', '本以为美国只是工作的中转站，没想到在旧金山的艺术街区，与 他 的相遇，开启了我甜蜜炽热的爱情篇章', 'Snipaste_2025-04-07_17-17-39.png', '2024-08-22 22:02:02', 'Linda', '2', '58852', '3321', '187', '英国'),
(34, '680448', 'Snipaste_2025-04-09_18-57-36.png', 'Our love blossoms al', 'Encountering around the corner, it turns out you are the love of my life.', 'photo_2025-04-07_14-52-24.jpg', '2025-02-27 04:01:02', 'Skylar ', '2', '36164', '9792', '459', '英国'),
(35, '662213', 'Snipaste_2025-04-09_19-04-02.png', '桜吹雪の中で、恋の予感が広がる', '雪の世界を歩きながら、足元でキシキシと音がする。あなたの手が私の手をしっかり握っていて、暖かさが心の底から広がっていきます。 ', 'Snipaste_2025-04-07_16-56-55.png', '2024-12-30 10:42:00', 'さとう ゆうな', '2', '15362', '5578', '200', 'jp'),
(36, '742965', 'Snipaste_2025-04-09_19-15-48.png', '我們的愛情故事開場', '承蒙平台的見證，讓我們的愛情有了別樣的意義，那些分享過的日常，都成為愛情路上最美的點綴。', 'Snipaste_2025-04-07_23-08-14.png', '2024-07-07 20:54:00', '朱以均', '2', '88392', '3732', '957', 'zh'),
(37, '760998', 'Snipaste_2025-04-09_19-28-49.png', '한국 드라마 속의 사랑 장면이 우리 ', '우리가 서로 알게 된 그 순간부터 내 마음은 너의 것이 되었어. 앞으로 어떤 어려움이 닥쳐도 난 너의 곁에 함께 있어 너와 함께 직면하길 원해. 너는 내 생명에서 가장 소중한 사람이야. 내 모든 힘을 다해 너를 사랑하고 지켜줄게. ', 'Snipaste_2025-04-07_16-54-58.png', '2024-12-18 16:41:23', '박서준', '2', '75027', '6353', '269', 'ko'),
(38, '488789', 'Snipaste_2025-04-09_20-47-35.png', '너에게 특별한 사랑을 주고 영원히 곁', '널 사랑해. 그것은 아침에 눈을 뜨자마자 너의 모습을 찾는 그 그리움, 밤에 잠들기 전에 너의 미소를 떠올리는 그 안심감이야. 이 사랑은 이미 내 삶의 모든 틈새에 스며들어 있단 거야. ', 'Snipaste_2025-04-09_20-59-54.png', '2025-04-08 22:07:01', '유준범', '2', '88981', '4981', '575', 'ko'),
(39, '663223', 'Snipaste_2025-04-09_21-09-42.png', 'One glance, an etern', 'I can\'t imagine my life without you. You\'ve become the most important part of me, and I love you like crazy.', 'photo_2025-04-07_16-51-58.jpg', '2025-04-22 18:04:00', 'Emma', '2', '36590', '4362', '567', '英国'),
(40, '295935', 'Snipaste_2025-04-10_10-15-55.png', 'わたし と わたし の いこく の こい', 'やっとあなたと一緒にイギリスに戻ってきました。私たちの愛情は、まるで星と海の間を駆け抜けるようなものです。あなたは異国のロマンチックな雰囲気を纏って私の生活に飛び込んできて、私は優しさと繊細さを胸にあなたの世界に入りました。私たちは一緒にお互いの文化の魅力を探り、違った風味の美食を味わい、違いの中で美しさを見つけました。 ', 'photo_2025-04-07_16-13-47英国玩.jpg', '2024-06-20 22:36:19', 'さいおん', '2', '19532', '7756', '191', 'jp'),
(41, '460122', 'Snipaste_2025-04-10_10-28-11.png', '海畔，與你相擁的每寸時光', '愛人牽起我的手，在沙灘寫下 “永遠”，海浪試圖沖刷，卻沖不淡我們在海邊許下的永恆誓言 。', 'Snipaste_2025-04-07_23-06-19.png', '2024-07-24 16:15:18', '霖涵欣', '2', '26560', '8688', '579', 'zh'),
(42, '108540', 'San Miguel圣米格尔🏜️上帝打翻的调色盘_2_Lisa陳多多_来自小红书网页版.jpg', 'Currently single, lo', 'On the LoveParty platform, I am sincerely seeking a mature and steady man. He doesn\'t necessarily have to achieve extraordinary feats. However, the most important thing is that he has a peaceful and loving heart. I hope he is understanding and magnanimous', 'Snipaste_2025-04-10_11-04-40.png', '2025-03-26 11:16:19', 'Stella', '2', '57673', '9210', '225', '英国'),
(43, '190146', 'photo_2025-04-07_17-59-02.jpg', '가장 사랑하는 사람이 곁에 있어서 평', 'LoveParty에 처음 오게 된 때 나는 많은 사람들과 마찬가지로 사랑에 대한 동경을 품고 있었고, 동시에 약간의 불안감도 느꼈습니다. 이 가상의 인터넷 세계에서 나는 내 영혼과 어울리고, 여생을 함께 걸어갈 그 사람을 찾기를 바랐습니다. 제 자신의 정보를 조심스럽게 작성하고 가능한 모든 인연을 열심히 살펴보았는데, 그런데 내게 맞는 사람이 조용히 다가오고 있었던 것입니다. ', 'Snipaste_2025-04-07_21-16-27.png', '2024-08-21 16:32:11', '서연', '2', '87742', '9791', '343', 'ko'),
(44, '159482', '在家楼下的餐厅享受独处时光👍思考人生😀_1_Michael Yuen_来自小红书网页版.jpg', 'Looking for a girl w', 'If you\'re also a woman seeking a sincere emotional connection and think we might be a great match, don\'t hesitate to contact me. Let\'s embark on this exciting journey together and see where it leads us. Looking forward to meeting you!', 'Snipaste_2025-04-10_12-29-19.png', '2024-07-25 09:17:11', 'Jack', '2', '41006', '5234', '680', '英国');

-- --------------------------------------------------------

--
-- 表的结构 `staff`
--

CREATE TABLE `staff` (
  `name` varchar(20) NOT NULL,
  `inviteCode` varchar(10) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `staff`
--

INSERT INTO `staff` (`name`, `inviteCode`, `id`) VALUES
('阿虎', '1801', 1),
('哪吒', '1568', 2),
('阿鑫', '1803', 3),
('阿龙', '1899', 4),
('阿爆', '1805', 5),
('阿九', '1806', 6),
('阿亮', '1807', 7),
('阿雄', '1808', 8),
('阿鬼', '1809', 11),
('阿超', '1810', 13),
('阿岸', '1811', 14),
('阿东', '1812', 15),
('阿羊', '1816', 16),
('阿斌', '1815', 17);

-- --------------------------------------------------------

--
-- 表的结构 `sysdata`
--

CREATE TABLE `sysdata` (
  `errorMoney` varchar(20) NOT NULL COMMENT '数据错误集',
  `profit` varchar(10) NOT NULL COMMENT '返利百分比',
  `id` int(11) NOT NULL,
  `lang` varchar(20) NOT NULL DEFAULT 'jp' COMMENT '语言',
  `errorSwitch` varchar(10) NOT NULL DEFAULT '0' COMMENT '数据错误开关',
  `profixSwitch` varchar(10) NOT NULL DEFAULT '0' COMMENT '是否返利',
  `initMoney` varchar(20) NOT NULL DEFAULT '0' COMMENT '注册默认余额',
  `switch` varchar(10) NOT NULL DEFAULT '0' COMMENT '当前语言系统'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `sysdata`
--

INSERT INTO `sysdata` (`errorMoney`, `profit`, `id`, `lang`, `errorSwitch`, `profixSwitch`, `initMoney`, `switch`) VALUES
('25000.50000', '20', 1, 'jp', '0', '0', '0', '1'),
('', '20', 2, 'en', '', '', '', '0'),
('', '', 3, 'vi', '', '', '', '0'),
('', '', 4, 'ko', '', '', '', '0'),
('', '', 5, 'zh', '', '', '', '0');

-- --------------------------------------------------------

--
-- 表的结构 `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `account` varchar(20) DEFAULT NULL,
  `password` varchar(20) DEFAULT NULL,
  `inviteCode` varchar(20) DEFAULT NULL,
  `dataError` varchar(20) DEFAULT '0',
  `dataErrorNum` varchar(50) NOT NULL,
  `age` varchar(20) DEFAULT NULL,
  `gender` varchar(20) DEFAULT NULL,
  `bankCard` varchar(255) DEFAULT NULL,
  `money` varchar(20) DEFAULT NULL,
  `avatar` varchar(255) DEFAULT NULL,
  `vipCode` varchar(20) DEFAULT NULL,
  `createDate` varchar(20) NOT NULL,
  `vipGrade` varchar(20) NOT NULL COMMENT '0一般用户 1普通会员 2高级会员 3至尊会员',
  `name` varchar(20) NOT NULL,
  `vipStatus` varchar(20) NOT NULL COMMENT '0制作中  1未激活 2激活中 3已激活',
  `likeSquare` varchar(255) NOT NULL,
  `city` varchar(30) NOT NULL,
  `remake` varchar(255) NOT NULL,
  `lineCode` varchar(20) NOT NULL,
  `pairAccount` varchar(20) NOT NULL,
  `pz` varchar(50) NOT NULL,
  `pz1` varchar(50) NOT NULL,
  `pz2` varchar(50) NOT NULL,
  `voteFlag` varchar(10) NOT NULL DEFAULT '1' COMMENT '是否可以投票',
  `staffName` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `users`
--

INSERT INTO `users` (`id`, `account`, `password`, `inviteCode`, `dataError`, `dataErrorNum`, `age`, `gender`, `bankCard`, `money`, `avatar`, `vipCode`, `createDate`, `vipGrade`, `name`, `vipStatus`, `likeSquare`, `city`, `remake`, `lineCode`, `pairAccount`, `pz`, `pz1`, `pz2`, `voteFlag`, `staffName`) VALUES
(2, '12345', '12345', '1208', NULL, '', '26', '女', NULL, '1686986', 'Snipaste_2025-02-28_22-13-头像38.jpg', '566814', '2025-02-26 17:29:35', '3', '박지원', '3', '21', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(3, '1234', '123456', '8888', '0', '', '25', '女', '', '6000', '人设 (1).jpg', '566814', '2025-02-26 17:30:40', '3', '美奈子', '3', '23751161513', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(20, '123', '123', '1108', NULL, '', '22', '女', NULL, '88000', 'Snipaste_2025-02-26_14-21-25.png', '566814', '2025-02-25 16:37:10', '3', '千本', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(29, '158168688', '123321', '1208', '1', '', NULL, '男', NULL, '280000', 'IMG_0061.png', '558623', '2025-03-09 16:56:05', '1', '長澤まさみ', '3', '', '', '', '', '', '', '', '', '', ''),
(31, 'なおきいしかわ', 'undefined', 'undefined', 'undefined', '', 'undefined', 'undefined', 'undefined', '0', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(32, 'yj773707', '773707', '1208', '', '', '', '男', '', '100', 'photo_2025-01-28_15-58-32.jpg', '', '2025-03-09 17:12:29', '1', '11', '0', '', '', '', '', '', '', '', '', '', ''),
(33, '1314520', '12345678', '1208', '', '', '', '男', '', '', '', '799409', '2025-03-09 21:53:45', '', '', '', '', '', '', 'undefined', '', '', '', '', '', ''),
(34, '258963', '258963', '1208', NULL, '', NULL, '男', NULL, '653000', 'image_1 (14).png', '957763', '2025-03-10 11:12:47', '3', '佐藤優奈', '3', '14', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(35, 'fukuda', 'undefined', 'undefined', 'undefined', '', 'undefined', 'undefined', 'undefined', '6000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(36, '1212123', '123456', '1208', NULL, '', NULL, '男', NULL, '160000', 'IMG_0119.jpeg', '257354', '2025-03-10 15:43:37', '3', '花泽美穗', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(37, 'ユタユタゆたか', 'undefined', 'undefined', '1', '', 'undefined', 'undefined', 'undefined', '720000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(38, 'kaede', 'Aa123456..', '168168', '', '', '', '女', '', '980000', 'IMG_0057.jpeg', '657892', '2025-03-12 20:45:24', '3', '矢野枫', '3', '', '', '阿鑫女主', 'chinatsu01', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(39, '09074334179', 'undefined', 'undefined', 'undefined', '', 'undefined', 'undefined', 'undefined', '6000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(40, '09074334179', 'undefined', 'undefined', 'undefined', '', 'undefined', 'undefined', 'undefined', '0', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(41, '09074334179', 'undefined', 'undefined', 'undefined', '', 'undefined', 'undefined', 'undefined', '-36000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(42, '16808', '123456', '1208', NULL, '', NULL, '女', NULL, '650000', 'IMG_0006.jpeg', '336258', '2025-03-13 10:37:57', '3', '田中千島', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(43, 'ユタユタゆたか', 'undefined', 'undefined', '1', '', 'undefined', 'undefined', 'undefined', '480000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(44, '16887', '123456', '268710', '', '', '', '女', '', '522000', 'IMG_0007.jpeg', '668893', '2025-03-13 10:40:43', '3', '中村優里', '3', '', '', '阿九', 'colourfulblack', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(45, 'ユタユタゆたか', 'undefined', 'undefined', '1', '', 'undefined', 'undefined', 'undefined', '480000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(46, 'mkjy5186', 'AA123456aa', '1208', NULL, '', NULL, '女', NULL, '583000', 'image_0 (2).png', '896558', '2025-03-13 11:41:27', '3', 'ミソラ ユイ', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(48, 'rina', 'AA123456..', '1208', NULL, '', NULL, '女', NULL, '520000', 'IMG_0058.jpeg', '852006', '2025-03-13 14:11:49', '3', '吉冈梨奈', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(49, 'ユタユタゆたか', 'undefined', 'undefined', '1', '', 'undefined', 'undefined', 'undefined', '600000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(50, 'ユタユタゆたか', 'undefined', 'undefined', '1', '', 'undefined', 'undefined', 'undefined', '-20000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(51, 'love', '102431', '1208', '0', '', NULL, '女', NULL, NULL, NULL, NULL, '2025-03-14 16:10:41', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(52, '893538736', '893538736', '980895', '0', '', '', '女', '', '600000', 'Snipaste_2025-02-18_21-19-51.png', '857537', '2025-03-14 16:33:07', '3', 'ヤマモト ミコ', '3', '', '', '阿虎', 'ccca0008', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(53, 'zz3222378911', 'zz3222378911', '1208', '0', '', '', '女', '', '600000', 'Snipaste_2025-02-19_16-50-05.png', '827947', '2025-03-14 16:43:22', '3', 'ヤマモト アヤコ', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(55, '孤独なこうじ', 'undefined', 'undefined', 'undefined', '', 'undefined', 'undefined', 'undefined', '6000', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', '', '', '', '', '', ''),
(56, '2589633', '2589633', '545935', '0', '', '', '女', '', '600000', 'image_0 (26).png', '177054', '2025-03-15 15:17:16', '3', 'ヨシカワ ケイコ', '3', '', '', '阿爆', 'chiba770', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(57, '112233', '123456', '126889', '0', '', '', '女', '', '880000', 'IMG_0138.jpeg', '644654', '2025-03-16 19:32:14', '3', '铃木美穗', '3', '', '', '阿雄', 'ycly001', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(58, 'Qwe8686886 ', 'qwe8686886', '842369', '0', '', '', '女', '', '300000', 'IMG_0066.jpeg', '942769', '2025-03-17 09:41:42', '3', '青柳沙織', '3', '', '', '阿龙', 'ccca0005', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(59, 'ニシダサネヒト', 'tatsugou', '1208', '0', '', '', '男', '', '30000', 'IMG_0068.jpeg', '141432', '2025-03-17 10:50:08', '1', '西田真仁', '0', '', '', '', '', '', '', '', '', '', ''),
(61, '08018458895', 'kenji1016', '1208', '0', '', '', '男', '【銀行名】:  仙北信用組合\n【支店名】:  本店\n【支店番号】:  001\n【口座番号】:  1104932\n【口座名義】:鈴木健二', '144000', 'IMG_3634.jpeg', '238319', '2025-03-17 17:12:59', '1', '鈴木　健二', '0', '', '', '阿九客户  第三步第二回', 'undefined', '', '', '', '', '', ''),
(62, 'Aung san lin', 'myothulin298', '1208', '0', '', '', '男', '', '0', 'IMG_0047.jpeg', '985125', '2025-03-18 18:46:40', '1', 'Aung san lin', '0', '', '', '阿雄客户  退了7000  冲了20000', 'undefined', '', '', '', '', '', ''),
(63, 'izumis18', 'izumi8020', '1208', '0', '', '', '男', '【銀行名】:  三菱UFJ銀行\n【支店名】:  深川支店\n【支店番号】:  086\n【口座番号】:  4620844\n【口座名義】:  杉浦伊豆美', '30000', 'IMG_20230521_140107.jpg', '', '2025-03-19 14:07:04', '1', '杉浦伊豆美', '0', '', '', '阿虎客户  充5000已提现6000  第一步未办理', '', '', '', '', '', '1', ''),
(64, 'izumi1116s@Gm', 'izumi8020', '1208', '0', '', NULL, '男', NULL, NULL, 'IMG_20250319_144231.jpg', NULL, '2025-03-19 14:36:25', '1', '杉浦伊豆美', '0', '', '', '', '', '', '', '', '', '', ''),
(66, '62676656', 'qwe123321', '1208', '0', '', NULL, '女', NULL, NULL, NULL, NULL, '2025-03-20 22:07:32', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(67, 'lovepartya', '102431', '950505', '0', '', '', '男', '', '600000', 'IMG_1063.jpeg', '', '2025-03-21 10:05:30', '3', '桜井奈々', '3', '', '', '', 'loveparty1', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(68, 'ずもとこういち', 'kz5768nz', '1208', '3', '', '', '男', '【銀行名】:  みずほ銀行\n【支店名】:  尼崎支店\n【支店番号】:  600\n【口座番号】:  600-3052751-01\n【口座名義】: ズモトコウイチ', '480000', 'Screenshot_20250416-114403.png', '', '2025-03-21 15:04:49', '1', 'ズモトコウイチ', '0', '', '', '阿虎客户  数据出错第一步', '', '', '', '', '', '0', '阿虎'),
(69, 'fukuda', '68026802', '1208', '0', '', '', '男', '', '6000', 'PXL_20250322_073537469.jpg', '', '2025-03-22 15:24:40', '1', '福田', '0', '', '', '阿九客户  第一步未完成', 'undefined', '', '', '', '', '', ''),
(70, 'なおきいしかわ', 'skni371214', '1208', '0', '', '', '男', '', '0', '', '', '2025-03-22 15:35:59', '0', '', '', '', '', '哪吒客户  第一步未完成', 'undefined', '', '', '', '', '', ''),
(72, '156889', '123321', '1208', '0', '', '', '女', '', '720000', 'IMG_0046.jpeg', '165377', '2025-03-22 16:03:42', '3', '桜木奈子', '3', '', '', '哪吒', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(73, 'ユタユタゆたか', 'yutayuta0406', '1208', '1', '', '', '男', '【銀行名】十六銀行\n【支店名】カラフルタウン岐阜出張所\n【支店番号】103\n【口座番号】1174129\n【口座名義】オガワユタカ', '720000', '', '973169', '2025-03-25 11:53:32', '0', '', '', '', '', '哪吒客户  第3步进行中', 'undefined', '', '', '', '', '', ''),
(74, 'qwe 7576', 'qwe8686', '1208', '0', '', '', '男', '', '120000', 'photo_2025-03-25_15-02-46.jpg', '666596', '2025-03-25 14:38:09', '3', '佐藤雅子', '3', '', '', '阿龙', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(75, '09074334179', 'aespa0121', '1208', '0', '', '', '男', '', '0', '', '636165', '2025-03-25 15:15:19', '0', '', '', '', '', '阿虎客户  第2步进行中', 'undefined', '', '', '', '', '', ''),
(76, '123456', '123466', '1208', '0', '', '', '男', '', '120000', '10074.jpg', '668898', '2025-03-25 15:21:59', '3', '星野璃奈', '3', '', '', '阿亮', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(77, '1234567', '1234567', '1208', '0', '', '', '女', '', '120000', '10075.jpg', '687898', '2025-03-25 18:55:15', '3', '佐藤千夏', '3', '', '', '阿亮', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(78, '08060931376', 'butta1376', '1208', '0', '', '', '男', '', '178000', 'IMG_1451.jpeg', '926261', '2025-03-28 14:28:59', '1', '', '0', '', '', '阿龙客户', '', '', '', '', '', '', ''),
(79, 'snari3', '123456', '1208', '0', '', '', '男', '', '0', 'IMG_0005.jpeg', '426677', '2025-03-28 15:53:06', '1', '成松重吉', '0', '12,', '', '', 'undefined', '', '', '', '', '', ''),
(80, 'なりまつしげよし', '760233', '1208', '0', '', '', '男', '', '', '', '185281', '2025-03-28 16:10:57', '0', '', '', '', '', '', 'undefined', '', '', '', '', '', ''),
(81, '孤独なこうじ', '48156269', '1208', '0', '', '', '男', '', '6000', 'IMG_7171.jpeg', '806523', '2025-03-28 16:30:10', '1', '孤独なこうじ', '0', '', '', '', 'undefined', '', '', '', '', '', ''),
(82, '905257', '905257', '1208', '0', '', '', '男', '', '', '', '280356', '2025-03-28 16:36:34', '0', '', '', '', '', '', 'undefined', '', '', '', '', '', ''),
(83, 'コナンキュウ', '02114713', '1208', '0', '', '', '男', '', '0', 'line_90356657273864.jpg', '973241', '2025-03-28 16:51:38', '1', '', '0', '', '', '', 'undefined', '', '', '', '', '', ''),
(84, '12345678', '12345678', '1208', '0', '', '', '女', '', '120000', '10346.jpg', '775825', '2025-03-29 11:16:11', '3', '星野璃奈', '3', '', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(86, '25896333', '25896333', '1208', '0', '', '', '女', '', '120000', 'image_1 (36).png', '886968', '2025-03-29 11:36:38', '3', 'ナツメ モモコ', '3', '', '', '阿爆', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(87, 'Boohfree', 'Naobooh', '1208', '1', '', '', '男', '', '100000', 'Snipaste_2025-04-01_12-39-48.jpg', '', '2025-03-29 18:51:24', '1', 'ワタナベ　ナオキ', '0', '', '', '', 'undefined', '', '', '', '', '', ''),
(88, 'Booh free', 'Naoboo', '1208', '0', '', NULL, '男', NULL, NULL, NULL, NULL, '2025-03-29 18:52:31', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(89, '158910355', '158910355', '1208', '0', '', '', '女', '', '600000', 'Snipaste_2025-02-17_19-32-25.png', '667719', '2025-03-30 11:02:02', '3', 'ヤマナカ ナオミ。', '3', '', '', '阿虎', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(90, '6389547048', '6389547048', '1208', '0', '', '', '女', '', '600000', 'Snipaste_2025-02-18_15-08-29.png', '375769', '2025-03-30 11:12:08', '3', 'ヤマナカ ミコ', '3', '', '', '阿虎', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(91, '362314', '123456', '1208', '0', '', '', '女', '', '600000', 'IMG_0119.jpeg', '471132', '2025-03-30 11:14:51', '3', '花泽美穗', '3', '', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(92, '090-7852-5619', 'toshi5610', '1208', '0', '', '', '男', '', '120000', '色調補正_20250330_154342.jpg', '835776', '2025-03-30 12:31:42', '1', 'トッシー', '1', '', '', '阿亮客户', '', '', '', '', '', '1', '阿亮'),
(93, '168885', '123456', '1208', '0', '', '', '女', '', '600000', '1.png', '713790', '2025-03-30 14:08:49', '3', '春島優井', '3', '', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(94, '168889', '123456', '1208', '0', '', '', '女', '', '600000', '3.png', '485646', '2025-03-30 14:15:29', '3', '早川奈子', '3', '', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(95, '168887', '123456', '1208', '0', '', '', '女', '', '600000', 'image_0 (500).png', '580705', '2025-03-30 14:17:04', '3', '中村優里', '3', '', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(97, 'rxqz9912', 'AA123456aa', '1208', '0', '', '', '女', '', '620000', 'Screenshot_20250330_161601.jpg', '174037', '2025-03-30 15:40:15', '3', 'ヒナタ ハルコ', '3', '', '', '阿头', 'atat586', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(98, 'scxn521', 'AA123456aa', '1208', '0', '', '', '女', '', '620000', '1743322959313.jpg', '753612', '2025-03-30 16:31:30', '3', 'モリカワ サチノ', '3', '', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(99, 'scyz818', 'AA123456aa', '1208', '0', '', '', '女', '', '600000', 'IMG_20250330_164645.jpg', '582973', '2025-03-30 16:50:06', '3', 'イシハラ サクラコ', '3', '', '', '', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(100, 'エルヴィン　スミス11', 'Haruki1318', '1208', '1', '', '', '男', '', '120000', 'IMG_2128.jpeg', '958435', '2025-04-01 12:06:02', '1', 'エルヴィン　スミス', '0', '', '', '', 'undefined', '', '', '', '', '', ''),
(101, '111111', '111111', '168168', '0', '', '', '女', '', '730000', 'Snipaste_2024-11-15_10-44-52.png', '347426', '2025-04-02 10:49:23', '2', 'ただyいま', '3', '', '', '', '', '', 'IMG_0002.jpeg', '', '', '1', ''),
(102, '15666', '123321', '158688', '', '', '', '女', '', '280000', 'IMG_0061.png', '857852', '2025-03-10 14:16:37', '3', '長澤まさみ', '3', '', '', '哪吒', 'maz58898', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(103, 'Yuuma0500', 'Aa123456..', '1208', '0', '', '', '男', '', '120000', 'IMG_0079.jpeg', '415530', '2025-04-02 11:08:43', '3', '神田由真', '3', '', '', '阿鑫', 'undefined', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(104, 'Qwe7575775', 'qwe8686886', '1208', NULL, '', NULL, '女', NULL, '520000', 'IMG_0055.jpeg', '357143', '2025-03-11 16:52:29', '3', '美奈子', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(105, 'loveparty1', '102431', '950505', '0', '', '', '男', '', '600000', '', '', '2025-03-20 11:49:33', '', '', '3', '', '', '', '', '', '', '', '', '', ''),
(106, 'TETU0523', 'Tetu2451', '1208', '0', '', '', '男', '', '0', 'IMG_1028.jpeg', '585866', '2025-03-14 16:50:32', '1', 'T2', '0', '', '', '', '', '', '', '', '', '', ''),
(107, 'yukino', 'Aa123456..', '1208', 'undefined', '', 'undefined', '女', '', '660000', 'IMG_0059.jpeg', '225689', '2025-03-13 14:14:14', '3', '森川雪乃', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(108, '16885', '123456', '1208', NULL, '', NULL, '女', NULL, '773000', 'IMG_0005.jpeg', '664599', '2025-03-13 10:35:51', '3', '春島優井', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(109, '16889', '123456', '1208', NULL, '', NULL, '女', NULL, '660000', 'IMG_0001.jpeg', '685551', '2025-03-13 10:25:29', '3', '早川奈子', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(110, '16888', '123456', '1208', NULL, '', NULL, '男', NULL, '450000', 'IMG_0001.jpeg', '558212', '2025-03-13 10:21:59', '3', '早川奈子', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(111, '6535333', 'aa123456', '1208', '', '', '', '女', '', '', '', '674534', '2025-03-09 17:11:57', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(112, '88998899', '123456789', '1208', '', '', '', '男', '', '', '', '120283', '2025-03-09 17:09:23', '', '', '', '', '', '', '', '', '', '', '', '', ''),
(113, '222222', '222222', '158688', '0', '', NULL, '男', NULL, NULL, NULL, '474472', '2025-04-03 11:30:57', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(115, 'takahara', 'tkhr1834', '1208', '0', '', '', '男', '', '0', 'DSC_0001.JPG', '102066', '2025-04-03 19:50:36', '1', 'takahara', '0', '', '', '', '', '', '', '', '', '', ''),
(116, 'gxfc158968', '123321', '1208', '0', '', NULL, '男', NULL, NULL, NULL, '250199', '2025-04-03 20:02:35', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(117, '743163190', 'sx362314', '1208', '0', '', '', '女', '', '120000', 'IMG_0155.jpeg', '667503', '2025-04-04 10:17:49', '3', '夏目葵', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(118, 'H2117256981', 'qwe8686886', '1208', '0', '', '', '男', '', '350000', 'IMG_0081.jpeg', '478875', '2025-04-05 15:49:09', '3', '青柳沙織', '3', '', '', '阿龙', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(119, 'アグニシゲヤ', 'invader', '1208', '0', '', '', '男', '【銀行名】:  琉球銀行\n【支店名】:  古島支店\n【支店番号】:  332\n【口座番号】:  199044\n【口座名義】:  粟国　滋也', '3000', 'FB_IMG_1685348147632.jpg', '444502', '2025-04-05 16:59:23', '1', 'アグニシゲヤ', '0', '17,', '', '', '', '', '', '', '', '', ''),
(120, '86112311', '880264', '1208', '0', '', '', '男', '', '0', '', '766465', '2025-04-05 17:16:28', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(121, 'asd125', '123456', '1208', '0', '', NULL, '男', NULL, NULL, NULL, '359130', '2025-04-05 17:52:18', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(122, 'asd123', '123456', '1208', '0', '', NULL, '男', NULL, NULL, NULL, '739698', '2025-04-05 17:58:53', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(123, 'love850301', '123456', '1208', '0', '', '', '女', '', '120000', '10041.jpg', '274800', '2025-04-06 11:06:25', '3', '宮崎絵梨', '3', '', '', '', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(124, 'mina88800', 'Aa123456..', '1208', '0', '', '', '女', '', '120000', 'image_0.png', '453144', '2025-04-06 15:13:31', '3', '小林 美奈', '3', '', '', '阿超', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(125, 'KOHMIYA', 'km1020', '1208', '0', '', '', '男', '【銀行名】:  常陽銀行\n【支店名】:  谷和原支店\n【支店番号】:  159\n【口座番号】:  1245050\n【口座名義】:  宮本幸一', '30000', '1730263996870.jpg', '631522', '2025-04-06 16:33:34', '1', '宮本幸一', '0', '', '', '阿超客户', '', '', '', '', '', '', ''),
(126, 'noboru', '05219663', '1208', '0', '', '', '男', '', '0', '1743650870230.jpg', '672628', '2025-04-07 17:22:41', '1', 'noboru', '0', '', '', '', '', '', '', '', '', '', ''),
(127, 'アキラアキラ', 'bbking1110', '1208', '0', '', '', '男', '', '100000', '', '990846', '2025-04-08 12:19:31', '0', '', '', '17,40,', '', '阿虎客户 提现到美子账户 10w未汇款 预约5.1 12:30', '', '', '', '', '', '1', '阿虎'),
(128, '19970720', '19970720', '1208', '0', '', '', '男', '', '6000', 'image_0 (7).png', '245165', '2025-04-08 16:03:11', '3', 'サトウ ユウナ', '3', '', '', '阿爆', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '', ''),
(129, 'ウエハラ1945', '73881945', '1208', '0', '', '', '男', '', '0', 'FaceApp_1661904786525.jpg', '552000', '2025-04-09 13:42:07', '1', '上原民夫', '0', '20,19,', '', '', '', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', ''),
(133, 'michiaki1496', 'kuro3588', '1208', '4', '', '71', '男', '【銀行名】:  名古屋銀行\n【支店名】:  武豊支店\n【支店番号】:  277\n【口座番号】:  3167151\n【口座名義】:  石黒道明', '14132000', 'image.jpg', '691487', '2025-04-10 10:43:11', '1', '石黒道明', '1', '', '名古屋', '阿超客户 1qw  27号约会  约会保障金150w 证件真实性100w 高级会员100w 28号提现日 500w大额通道  账户已冻结', '', '', '', '', '', '1', '阿超'),
(134, 'もも19940720', 'もも19940720', '1208', '0', '', '', '女', '', '0', 'image_0 (16).png', '130418', '2025-04-10 14:41:35', '3', 'ナツメ モモコ', '3', '', '', '阿爆', '', 'undefined', '3w.jpg', '5w.jpg', '10w.jpg', 'undefined', ''),
(135, '8546652', '102431', '1208', '0', '', '', '男', '', '120000', '10079.jpg', '418021', '2025-04-10 16:36:25', '3', '桜井奈々', '3', '', '', '阿亮', '', 'undefined', '3w.jpg', '5w.jpg', '10w.jpg', 'undefined', ''),
(136, '08095325189', '02585360', '1208', '0', '', '', '男', '', '0', '20240628_064608.jpg', '359434', '2025-04-10 16:52:34', '1', 'ほりい', '0', '', '', '阿龙客户', '', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', ''),
(137, '19647016', '7016isobe', '842369', '0', '', '', '男', '', '0', '', '369608', '2025-04-10 17:04:08', '0', '', '', '', '', '阿龙客户', '', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', ''),
(138, 'masami88808', 'Aa123456..', '1208', '0', '', '', '男', '', '120000', 'IMG_0009.png', '869899', '2025-04-11 09:47:33', '3', 'Chi saki', '3', '', '', '阿超', '', 'undefined', '3w.jpg', '5w.jpg', '10w.jpg', 'undefined', ''),
(139, 'Aa123456', 'Aa123456', '1208', '0', '', NULL, '男', NULL, '6000', NULL, '554145', '2025-04-11 10:20:34', '0', '', '', '', '', '', '', '', '', '', '', '', ''),
(140, 'クサノケンジ', '102761v', '1208', '1', '', '', '男', '', '100000', '', '369153', '2025-04-11 10:22:55', '0', '', '', '', '', '阿鑫客户', '', 'undefined', 'undefined', 'undefined', 'undefined', 'undefined', ''),
(141, 'keiko19920720', 'keiko19920720', '1208', '0', '', '', '女', '', '0', 'image_0 (25).png', '895729', '2025-04-11 16:10:58', '3', 'ヨシカワ ケイコ', '3', '', '', '阿爆', '', 'undefined', '3w.jpg', '5w.jpg', '10w.jpg', 'undefined', ''),
(142, 'abc123', 'qçrdxt963', '545935', '0', '', '', '男', '', '0', 'IMG_2025-04-06-14-41-12-235.jpg', '510532', '2025-04-11 17:24:12', '1', 'イナガキ', '1', '', '', '阿爆客户', '', '', 'photo_2025-04-07_14-46-04.jpg', 'photo_2025-04-07_14-50-03.jpg', 'photo_2025-04-07_14-54-22.jpg', '', ''),
(143, 'shed219', 'qwe8686886', '1208', '0', '', '18', '男', '', '120000', 'IMG_0086.jpeg', '214333', '2025-04-13 15:41:52', '3', '鈴木優月', '3', '', '', '阿龙', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '0', ''),
(144, '999999', '000000', '1208', '3', '', '', '男', '', '600000', '', '606481', '2025-04-15 18:14:47', '0', '', '1', '', '', '阿龙客户  交50w人身安全保障金中 25号操作', '', '', '3w.jpg', '5w.jpg', '10w.jpg', '0', '阿龙'),
(147, 'takeyan0120', '797479', '1208', '0', '', '', '男', '', '12000', '', '833017', '2025-04-16 16:49:49', '0', '', '', '', '', '阿虎客户', '', '', '', '', '', '1', ''),
(148, 'aoi66088', 'Aa123456..', '1208', '0', '', '', '男', '', '120000', 'IMG_0012.jpeg', '804363', '2025-04-18 10:18:40', '3', '終わらない夢', '3', '', '', '阿超', '', '', '', '', '', '1', ''),
(149, '09024307925', '43292hiko', '1208', '1', '', '', '男', '', '100000', '', '800340', '2025-04-18 21:30:24', '0', '', '', '', '', '阿九客户  数据出错1  30w没交 要到5.25充值30w', '', '', '', '', '', '1', '阿九'),
(150, '104977061', '123456', '1208', '0', '', '', '女', '', '120000', 'IMG_0177.jpeg', '768961', '2025-04-19 17:35:38', '3', '铃木美穗', '3', '', '', '阿雄', '', '', '', '', '', '', ''),
(151, '107098838', '123456', '1208', '0', '', '', '女', '', '120000', 'IMG_0180.jpeg', '431750', '2025-04-19 20:30:47', '3', '葵', '3', '', '', '阿雄', '', '', '', '', '', '', ''),
(153, 'kohaku39', 'muneomi39', '1208', '0', '', '', '男', '', '0', '4B9240DA-ECD9-48E6-A5D4-F924DDD77A53.jpeg', '423163', '2025-04-19 20:53:43', '1', 'kohaku39', '0', '', '', '阿爆客户', '', '', '', '', '', '1', '阿爆'),
(154, 'はやし　てつあき', 'Hikarigaoka0', '168168', '0', '', '', '男', '', '0', '', '455882', '2025-04-20 13:09:06', '0', '', '', '', '', '阿鑫客户', '', '', '', '', '', '', ''),
(155, 'タケノコダヨ', '132456', '1208', '0', '', '', '男', '', '0', '', '671991', '2025-04-20 17:09:34', '0', '', '', '', '', '阿爆客户', '', '', '', '', '', '1', '阿爆'),
(156, 'Aa111111', 'Aa111111', '168168', '0', '', '', '男', '', '0', '', '581440', '2025-04-20 17:24:39', '3', '', '3', '', '', '', '', '', '', '', '', '', ''),
(157, 'aa223344', 'aa2233344', '168168', '0', '', '', '男', '', '0', '', '483996', '2025-04-20 17:26:27', '3', '', '3', '', '', '', '', '', '', '', '', '', ''),
(158, 'Aa1234567890', 'Aa1234567890', '168168', '0', '', '', '男', '', '0', '', '700826', '2025-04-20 17:28:26', '3', '', '3', '', '', '', '', '', '', '', '', '', ''),
(159, 'Mika0720', 'Mika0720', '1208', '0', '', '', '女', '', '120000', 'image_0 (52).png', '183280', '2025-04-20 17:32:12', '3', 'ナカジマ ミカ', '3', '', '', '阿爆', '', '', '', '', '', '', ''),
(164, 'ⅠⅨⅦⅨ0Ⅴ', '783900', '1208', '1', '', '', '男', '', '100000', 'IMG_8631.jpeg', '201383', '2025-04-22 17:55:38', '1', 'モトヒロ', '0', '', '', '数据出错1', '', '', '', '', '', '1', '阿九'),
(165, 'Yuuna0720', 'Yuuna0720', '1208', '0', '', '', '女', '', '120000', 'image_0 (70).png', '574418', '2025-04-23 10:10:47', '3', 'サトウ ユウナ', '3', '', '', '阿爆', '', '', '', '', '', '', ''),
(166, '72881276', 'Crown1502', '1208', '0', '', '', '男', '', '840000', '', '196992', '2025-04-23 17:48:35', '0', '', '', '', '', '数据错误第二步完成 约会保障金开始', '', '', '', '', '', '1', '哪吒'),
(167, '157678', '123321', '1208', '0', '', '', '男', '', '120000', 'IMG_0007.jpeg', '103155', '2025-04-24 12:24:13', '3', '黒羽雪奈', '3', '', '', '', '', '', '', '', '', '1', ''),
(168, 'マサミナリタ', '1234567', '1208', '0', '', '', '男', '', '0', '', '976237', '2025-04-24 12:47:11', '0', '', '', '', '', '6q已提现', '', '', '', '', '', '1', '阿九'),
(169, 'yoshi0606', 'saten2021', '1208', '0', '', '', '男', '', '0', '', '391416', '2025-04-24 15:03:34', '0', '', '', '', '', '', '', '', '', '', '', '1', '岸'),
(170, '818652847311', 'qq123123', '1208', '0', '', '', '男', '', '0', '', '568959', '2025-04-24 19:54:12', '0', '', '', '44,', '', '', '', '', '', '', '', '1', ''),
(174, '1254KE', '123456', '1807', '0', '', '', '男', '', '0', 'DSC_0001.JPG', '905034', '2025-04-25 15:23:59', '1', '賢', '0', '', '', '退款6q', '', '', '', '', '', '1', '阿亮'),
(175, '850301', '102431', '1807', '0', '', '', '男', '', '6000', 'IMG_1130.jpeg', '760557', '2025-04-25 15:25:00', '1', '宫崎绘梨', '0', '', '', '阿亮', '', '', '', '', '', '1', ''),
(176, 'ナカムラ　シゲミツ', 'sn195663', '1801', '1', '', '', '男', '【銀行】百五銀行\n【支店】桑名支店\n【支店番号】101\n【口座番号】791800\n【口座名義】ナカムラ　シゲミツ', '120000', '', '615204', '2025-04-26 11:23:55', '0', '', '', '', '', '数据出错1  下个月发工资操作', '', '', '', '', '', '1', '阿虎'),
(177, 'アオヤギイオリ', '202502', '1805', '1', '', '', '男', '', '120000', '', '903137', '2025-04-26 15:45:29', '0', '', '', '', '', '4w补齐10w  数据已经出错  还在拉扯', '', '', '', '', '', '1', '阿爆'),
(178, 'MARUYAMA', 'maruyama1019', '1811', '0', '', '', '男', '', '0', '', '933879', '2025-04-27 20:36:15', '0', '', '', '', '', '10w未汇款', '', '', '', '', '', '0', '阿岸'),
(179, '385712', '123321', '1811', '0', '', '', '男', '', '120000', 'IMG_0006.jpeg', '667440', '2025-04-28 11:30:46', '3', '鈴木優奈', '3', '', '', '岸', '', '', '', '', '', '1', '');

-- --------------------------------------------------------

--
-- 表的结构 `vip`
--

CREATE TABLE `vip` (
  `name` varchar(20) NOT NULL,
  `type` varchar(10) NOT NULL,
  `img` varchar(50) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `vip`
--

INSERT INTO `vip` (`name`, `type`, `img`, `id`) VALUES
('一般用户', '0', '新建项目.jpg', 1),
('普通会员', '1', '新建项目.jpg', 3),
('高级会员', '2', 'vipCard.png', 4),
('至尊会员', '3', '新建项目.jpg', 5);

-- --------------------------------------------------------

--
-- 表的结构 `vote`
--

CREATE TABLE `vote` (
  `account` varchar(20) NOT NULL,
  `voteNum` varchar(20) NOT NULL,
  `voteId` varchar(10) NOT NULL,
  `date` varchar(20) NOT NULL,
  `id` int(11) NOT NULL,
  `dataError` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `vote`
--

INSERT INTO `vote` (`account`, `voteNum`, `voteId`, `date`, `id`, `dataError`) VALUES
('222222', '20', '886', '2025-03-31 15:16:34', 10, ''),
('222222', '50000', '686', '2025-04-01 13:08:34', 11, ''),
('Boohfree', '50000', '686', '2025-04-01 13:13:47', 12, ''),
('222222', '50000', '886', '2025-04-01 13:54:26', 13, ''),
('エルヴィン　スミス', '45000', '686', '2025-04-01 15:21:49', 14, ''),
('222222', '50000', '886', '2025-04-01 16:49:45', 15, ''),
('222222', '50000', '686', '2025-04-01 16:50:00', 16, ''),
('222222', '50000', '996', '2025-04-01 16:50:01', 17, ''),
('222222', '50000', '886', '2025-04-01 16:50:01', 18, ''),
('222222', '50000', '686', '2025-04-01 16:50:28', 19, ''),
('222222', '50000', '996', '2025-04-01 16:50:28', 20, ''),
('222222', '50000', '886', '2025-04-01 16:50:28', 21, ''),
('222222', '20', '996', '2025-04-01 17:19:57', 22, ''),
('222222', '20', '886', '2025-04-01 17:19:58', 23, ''),
('222222', '20', '996', '2025-04-01 17:20:04', 24, ''),
('222222', '20', '886', '2025-04-01 17:20:04', 25, ''),
('222222', '50000', '886', '2025-04-01 17:45:40', 26, ''),
('222222', '30000', '886', '2025-04-01 17:45:58', 27, ''),
('222222', '30000', '886', '2025-04-01 17:46:35', 28, ''),
('222222', '20000', '886', '2025-04-01 17:46:45', 29, ''),
('222222', '1000', '886', '2025-04-01 17:46:51', 30, ''),
('222222', '3000', '886', '2025-04-01 17:47:05', 31, ''),
('222222', '7000', '886', '2025-04-01 17:47:46', 32, ''),
('222222', '10000', '886', '2025-04-01 17:48:00', 33, ''),
('222222', '30000', '886', '2025-04-01 17:48:12', 34, ''),
('111111', '500', '886', '2025-04-04 10:29:30', 35, ''),
('111111', '100', '886', '2025-04-07 17:45:13', 36, ''),
('111111', '200', '889', '2025-04-07 17:46:56', 37, ''),
('アグニシゲヤ', '3000', '889', '2025-04-07 19:11:53', 38, ''),
('111111', '5700', '886', '2025-04-08 14:41:54', 39, ''),
('KOHMIYA', '30000', '889', '2025-04-09 11:31:26', 40, ''),
('KOHMIYA', '30000', '889', '2025-04-09 11:32:11', 41, ''),
('KOHMIYA', '30000', '889', '2025-04-09 11:35:15', 42, ''),
('KOHMIYA', '30000', '889', '2025-04-09 11:36:14', 43, ''),
('KOHMIYA', '30000', '889', '2025-04-09 11:40:28', 44, ''),
('KOHMIYA', '30000', '889', '2025-04-09 11:42:19', 45, ''),
('19647016', '3000', '889', '2025-04-10 17:35:11', 46, ''),
('michiaki1496', '30000', '889', '2025-04-11 15:33:24', 48, ''),
('michiaki1496', '50000', '686', '2025-04-11 16:41:40', 49, ''),
('abc123', '30000', '686', '2025-04-12 10:49:19', 50, ''),
('クサノケンジ', '30000', '889', '2025-04-12 11:34:53', 51, ''),
('クサノケンジ', '30000', '889', '2025-04-12 11:36:27', 52, ''),
('abc123', '50000', '686', '2025-04-12 11:45:31', 53, ''),
('abc123', '60000', '686', '2025-04-12 11:52:28', 54, ''),
('クサノケンジ', '50000', '686', '2025-04-12 15:17:40', 55, ''),
('クサノケンジ', '50000', '686', '2025-04-12 15:18:09', 56, ''),
('ずもとこういち', '30000', '889', '2025-04-16 15:01:55', 82, ''),
('090-7852-5619', '25000', '996', '2025-04-16 15:10:09', 83, ''),
('090-7852-5619', '25000', '886', '2025-04-16 15:11:22', 84, ''),
('090-7852-5619', '25000', '996', '2025-04-16 15:13:14', 85, ''),
('999999', '30000', '996', '2025-04-16 18:05:01', 86, ''),
('ずもとこういち', '50000', '886', '2025-04-17 14:50:33', 87, ''),
('ずもとこういち', '50000', '996', '2025-04-17 16:18:59', 88, ''),
('999999', '50000', '886', '2025-04-17 19:14:19', 89, ''),
('999999', '50000', '996', '2025-04-19 13:19:07', 92, ''),
('09024307925', '30000', '996', '2025-04-20 12:15:09', 93, ''),
('michiaki1496', '50000', '996', '2025-04-22 13:03:17', 96, ''),
('michiaki1496', '50000', '886', '2025-04-22 13:03:18', 97, ''),
('michiaki1496', '50000', '996', '2025-04-22 13:03:37', 98, ''),
('michiaki1496', '50000', '886', '2025-04-22 13:03:37', 99, ''),
('ⅠⅨⅦⅨ0Ⅴ', '30000', '889', '2025-04-23 14:53:19', 108, ''),
('ⅠⅨⅦⅨ0Ⅴ', '50000', '686', '2025-04-23 15:57:21', 109, ''),
('111111', '50000', '776', '2025-04-23 17:06:00', 110, ''),
('111111', '50000', '101', '2025-04-23 17:06:01', 111, ''),
('72881276', '30000', '889', '2025-04-23 19:11:48', 112, ''),
('アキラアキラ', '30000', '889', '2025-04-23 19:44:01', 113, ''),
('72881276', '50000', '686', '2025-04-23 20:15:40', 114, ''),
('72881276', '25000', '996', '2025-04-24 12:45:50', 115, ''),
('72881276', '25000', '886', '2025-04-24 12:46:00', 116, ''),
('09024307925', '30000', '686', '2025-04-24 20:13:58', 117, ''),
('09024307925', '50000', '996', '2025-04-25 19:59:45', 118, ''),
('09024307925', '50000', '886', '2025-04-25 19:59:46', 119, ''),
('ナカムラ　シゲミツ', '30000', '102', '2025-04-26 17:20:26', 120, ''),
('ナカムラ　シゲミツ', '50000', '102', '2025-04-26 18:34:37', 121, ''),
('ナカムラ　シゲミツ', '100000', '102', '2025-04-26 19:30:09', 122, ''),
('アオヤギイオリ', '30000', '889', '2025-04-27 10:29:54', 123, ''),
('アオヤギイオリ', '50000', '686', '2025-04-27 11:43:12', 124, ''),
('アオヤギイオリ', '50000', '686', '2025-04-27 15:59:05', 125, ''),
('アオヤギイオリ', '50000', '996', '2025-04-27 15:59:06', 126, ''),
('アオヤギイオリ', '50000', '686', '2025-04-27 15:59:21', 127, ''),
('アオヤギイオリ', '50000', '996', '2025-04-27 15:59:22', 128, ''),
('アオヤギイオリ', '25000', '686', '2025-04-27 15:59:37', 129, ''),
('MARUYAMA', '30000', '996', '2025-04-28 17:03:58', 130, ''),
('MARUYAMA', '50000', '996', '2025-04-28 18:45:55', 131, ''),
('アキラアキラ', '50000', '686', '2025-04-28 19:07:06', 132, '');

--
-- 转储表的索引
--

--
-- 表的索引 `convension`
--
ALTER TABLE `convension`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `dating`
--
ALTER TABLE `dating`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `gift`
--
ALTER TABLE `gift`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `lang`
--
ALTER TABLE `lang`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `letter`
--
ALTER TABLE `letter`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `line`
--
ALTER TABLE `line`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `manage`
--
ALTER TABLE `manage`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `orderlist`
--
ALTER TABLE `orderlist`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `pair`
--
ALTER TABLE `pair`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `square`
--
ALTER TABLE `square`
  ADD PRIMARY KEY (`id`),
  ADD KEY `account` (`account`);

--
-- 表的索引 `staff`
--
ALTER TABLE `staff`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `sysdata`
--
ALTER TABLE `sysdata`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `vip`
--
ALTER TABLE `vip`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `vote`
--
ALTER TABLE `vote`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `convension`
--
ALTER TABLE `convension`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- 使用表AUTO_INCREMENT `dating`
--
ALTER TABLE `dating`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- 使用表AUTO_INCREMENT `gift`
--
ALTER TABLE `gift`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 使用表AUTO_INCREMENT `lang`
--
ALTER TABLE `lang`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 使用表AUTO_INCREMENT `letter`
--
ALTER TABLE `letter`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- 使用表AUTO_INCREMENT `line`
--
ALTER TABLE `line`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `manage`
--
ALTER TABLE `manage`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用表AUTO_INCREMENT `orderlist`
--
ALTER TABLE `orderlist`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=163;

--
-- 使用表AUTO_INCREMENT `pair`
--
ALTER TABLE `pair`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `square`
--
ALTER TABLE `square`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- 使用表AUTO_INCREMENT `staff`
--
ALTER TABLE `staff`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- 使用表AUTO_INCREMENT `sysdata`
--
ALTER TABLE `sysdata`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 使用表AUTO_INCREMENT `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=180;

--
-- 使用表AUTO_INCREMENT `vip`
--
ALTER TABLE `vip`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 使用表AUTO_INCREMENT `vote`
--
ALTER TABLE `vote`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=133;
--
-- 数据库： `lp_test`
--
CREATE DATABASE IF NOT EXISTS `lp_test` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `lp_test`;

-- --------------------------------------------------------

--
-- 表的结构 `convension`
--

CREATE TABLE `convension` (
  `account` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL,
  `height` varchar(10) NOT NULL,
  `weight` varchar(10) NOT NULL,
  `xw` varchar(10) NOT NULL,
  `job` varchar(20) NOT NULL,
  `video` varchar(50) NOT NULL,
  `avatar` varchar(50) NOT NULL,
  `jj` varchar(300) NOT NULL,
  `id` int(11) NOT NULL,
  `city` varchar(20) NOT NULL,
  `gender` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `convension`
--

INSERT INTO `convension` (`account`, `name`, `height`, `weight`, `xw`, `job`, `video`, `avatar`, `jj`, `id`, `city`, `gender`) VALUES
('01', 'すずき なな', '165', '51', 'D', 'ひしょかん', 'IMG_0358.MP4', 'photo_2025-03-06_01-00-23 (2).jpg', '', 1, '東京', '0'),
('02', 'さくらい みさき', '165', '45', 'C', 'おんがく きょうし', 'IMG_6659.MP4', 'photo_2025-03-04_06-23-48.jpg', '', 2, '東京', '0'),
('03', 'ほしの ちなつ', '163', '45', 'C', 'しょくいん', 'IMG_3936.MP4', 'Snipaste_2025-02-28_22-13-tx58.jpg', '', 4, 'なごや', '0'),
('04', '김태희', '168', '45', 'C', '메이크업 아티스트', 'video_2025-03-04_03-11-32.mp4', 'Snipaste_2025-03-08_14-35-03.jpg', '韓國', 5, '한국 서울', '0'),
('05', 'Nguyễn Thị Phương', '162', '47', 'B', 'y tá nữ', '1video_2025-03-08_15-23-30.mp4', '1photo_2024-12-14_03-08-36.jpg', '', 6, 'Nha Trang, Việt Nam', '0'),
('06', '이민호', '170', '51', 'C', '모델러', 'video_2025-03-06_01-49-40.mp4', 'photo_2025-03-06_01-20-48.jpg', '', 7, '서울', '0'),
('07', 'Lam Shi Yun', '170', '50', 'B', 'Guru Yoga', '3video_2025-03-08_15-24-16.mp4', '3photo_2024-12-28_13-04-40.jpg', '', 8, 'Kuala Lumpur', '0'),
('08', 'やまぐち ももえ', '165', '50', 'B', 'おんがく きょうし', '5video_2025-03-08_15-24-58.mp4', '5photo_2025-02-11_02-22-01.jpg', '', 9, '福岡県', '0'),
('09', 'いしはら さとみ', '168', '49', 'B', 'ひしょかん', '6video_2025-03-08_15-25-13.mp4', '6photo_2025-02-26_03-34-08.jpg', '', 10, '東京', '0'),
('10', 'ほしの みゆき', '160', '45', 'C', '社員', '日本21.mp4', '日本21.png', '', 11, '横浜', '0'),
('11', 'さき ゆうな', '162', '45', 'B', 'がくせい', '日本20.mp4', '日本20.jpg', '', 12, '青森県', '0'),
('12', '김서영', '165', '48', 'B', '요가 코치', '地区  韩国13.mp4', '地区  韩国13.png', '', 13, '서울', '0'),
('13', '이하늘', '165', '47', 'C', '비서 ', '地区  韩国14.mp4', '地区  韩国14.png', '', 14, '서울”', '0'),
('14', 'Amira Harris', '165', '49', 'B', 'jurulatih renang', '地区  上海15.mp4', 'photo_2025-03-04_20-26-19.jpg', '', 15, 'Kuala Lumpur', '0'),
('15', 'みやざき りな', '163', '52', 'C', 'けいえいたんとうしゃ', '地区  韩国18.mp4', '地区  韩国18.png', '', 16, '広島県', '0'),
('16', 'Olivia White', '165', '52', 'B', 'stylist model', '地区 荷兰11.mp4', '地区 荷兰11.png', '', 17, 'London', '0'),
('17', 'さくらい あやか', '163', '51', 'B', 'そつぎょうせい', '13.19.mp4', 'photo_2025-02-12_14-30-36.jpg', '', 18, '鹿児島県', '0'),
('18', 'Ava Johnson', '165', '52', 'B', 'manikin', '地区 乌克兰3.mp4', '地区 乌克兰3.png', '', 19, 'Kharkiv', '0'),
('19', 'Emma', '170', '55', 'B', 'chorine', '地区  韩国17.mp4', 'photo_2025-03-10_17-59-01.jpg', '', 20, 'New York', '0'),
('20', 'やまもと たくや', '175', '68', '1', 'カヌーコーチ', '地区  台湾.mp4', '地区  台湾.png', '', 21, '宮崎県', '1'),
('21', 'わたなべ たくや ', '175', '73', '1', 'いりょうぎょうかい', '地区 新加坡2.mp4', 'photo_2025-03-08_19-01-13.jpg', '', 22, 'きょうとふ', '1'),
('22', 'わたなべ たくや ', '175', '75', '1', '金融セクター', '地区 越南.mp4', 'photo_2025-03-08_19-01-24.jpg', '', 23, 'いばらきけん', '1'),
('23', 'William', '180', '80', '1', 'boxing', '地区  阿联酋.mp4', 'photo_2025-03-08_19-01-39.jpg', '', 24, 'London', '1'),
('24', 'Oliver', '180', '95', '1', 'fitness coach', '地区  美国.mp4', 'photo_2025-03-08_19-01-44.jpg', '', 25, 'Edinburgh', '1'),
('25', 'ろばね ゆうき', '178', '79', '1', 'ソフトウェア開発エンジニア', '地区 新加坡.mp4', 'photo_2025-03-08_19-03-06.jpg', '', 26, 'きょうとふ', '1'),
('26', 'みやざき はやと', '178', '75', '1', '室内デザイナー', '地区 泰国3.mp4', 'photo_2025-03-08_19-03-03.jpg', '', 27, 'あきたけん', '1'),
('27', 'さいとう かずや', '178', '79', '', 'データ解析師', '日本21.mp4', 'photo_2025-03-08_19-02-53.jpg', '', 28, '奈良県', '1'),
('28', 'たかはし ゆうた', '178', '72', '1', '資産管理顧問', '地区 马来西亚.mp4', 'photo_2025-03-08_19-02-48.jpg', '', 29, '茨城県', '1'),
('29', 'いとう たくしん', '178', '78', '1', '監理エンジニア', '地区  中国.mp4', 'photo_2025-03-08_19-02-41.jpg', '', 30, '愛知県', '1'),
('30', '박지훈', '179', '80', '1', '건축사', '地区  泰国1.mp4', 'photo_2025-03-08_22-00-45.jpg', '', 31, '부산”', '1'),
('31', 'Leo', '179', '85', '1', 'spécialiste juridiqu', '地区  意大利.mp4', 'photo_2025-03-08_22-04-26.jpg', '', 32, 'Paris', '1'),
('32', 'Lucas', '180', '80', '1', 'médeci', '地区  伊拉克.mp4', 'photo_2025-03-08_19-01-54.jpg', '', 33, 'Marseille', '1');

-- --------------------------------------------------------

--
-- 表的结构 `dating`
--

CREATE TABLE `dating` (
  `account` varchar(20) NOT NULL,
  `vipGrade` varchar(10) NOT NULL,
  `name` varchar(20) NOT NULL,
  `money` varchar(20) NOT NULL,
  `type` varchar(10) NOT NULL,
  `country` varchar(20) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `dating`
--

INSERT INTO `dating` (`account`, `vipGrade`, `name`, `money`, `type`, `country`, `id`) VALUES
('513203', '1', '한준석', '1200000원', '1', '韩国', 1),
('5132031', '1', '정유나', '1560000원', '1', '韩国', 2),
('5132033', '0', 'たかはし しょうた', '150000円', '0', '日本', 3),
('5132034', '1', 'たなか あおい', '330000円', '2', '日本', 4),
('5132035', '0', '박서연', '550000원', '2', '韩国', 5),
('5132036', '2', 'いとう しおり', '650000円', '1', '日本', 6),
('5132037', '3', 'さき かずや', '1200000円', '0', '日本', 7),
('5132037', '3', 'さき かずや', '100000円', '0', '日本', 8),
('65165106520', '1', 'ほしの えり', '600000円', '1', '日本', 9),
('65165106521', '2', 'さとう さくら', '150000円', '1', '日本', 10),
('65165106523', '2', 'たかはし しょうた', '150000円', '1', '日本', 11),
('65165106524', '3', 'William Thompson', '3000USTD', '1', '英国', 12),
('65165106525', '1', 'わたなべ みほ', '120000円', '0', '日本', 13),
('65165106526', '1', 'やまもと ゆうき', '36000円', '1', '日本', 14),
('65165106527', '1', 'くろばね れいな', '100000円', '0', '日本', 15),
('65169419615', '2', 'くすのき しおり', '50000円', '0', '日本', 16),
('5132038', '3', 'Emma Müller', '6000US', '2', '美国', 17),
('5132038', '3', 'Emma Müller', '5000US', '1', '美国', 18),
('15612', '0', 'さとう けん', '15000円', '1', '日本', 19);

-- --------------------------------------------------------

--
-- 表的结构 `gift`
--

CREATE TABLE `gift` (
  `id` int(11) NOT NULL,
  `src` varchar(20) DEFAULT NULL,
  `name` varchar(20) NOT NULL,
  `vote` int(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `gift`
--

INSERT INTO `gift` (`id`, `src`, `name`, `vote`) VALUES
(1, '7.jpg', '889', 690019),
(2, '8.jpg', '686', 971558),
(3, '12.jpg', '996', 889913),
(4, '5.jpg', '886', 374845);

-- --------------------------------------------------------

--
-- 表的结构 `letter`
--

CREATE TABLE `letter` (
  `id` int(11) NOT NULL,
  `account` varchar(20) NOT NULL,
  `content` varchar(500) NOT NULL,
  `img` varchar(50) NOT NULL,
  `date` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `letter`
--

INSERT INTO `letter` (`id`, `account`, `content`, `img`, `date`, `name`) VALUES
(1, 'asdsdd', '心いっぱいの感謝の気持ちを込めて、この手紙を書かせていただきます。少し前まで、私は貴プラットフォームを通じて、今の彼女と出会うことができました。彼女の現れは私の生活を明るく照らしました。プラットフォームの正確なマッチングと思いやりのあるサービスのおかげで、私たちは広い人ごみの中を越えて、一緒になることができました。\r\n\r\n最初のオンライン交流から、オフラインでのデートのときのドキドキする瞬間まで、どの一歩もプラットフォームの力なしには成り立ちませんでした。今、私たちの関係は安定しており、未来に向かって大いに期待しています。心から貴プラットフォームが提供してくれた素敵な交友環境に感謝いたします。これにより、愛の花がきれいに咲きました。プラットフォームがますます素敵なものになり、もっと多くの人が幸せを手に入れられるように、心から願っています 。', '', '2025-02-23', 'くすのき しおり'),
(2, 'asdasd', '貴プラットフォームに加入する前は、私はずっと広い人ごみの中で、生涯一緒にいる相手を見つけることを期待していました。思いも寄らなかったことに、プラットフォームが巧みに私と私の夫をつないでくれました。初めてプラットフォームで彼の情報を見たとき、妙な感じが自然に湧いてきました。チャットを始めてから、私たちは驚いたことに、たくさんの共感を見つけました。', '', '2021-05-25', 'たなか あおい'),
(3, '65165106525', 'オンラインでのやり取りの盛んな交流から、オフラインで会ったときの彼の暖かい笑顔や思いやりのある行動まで、どの瞬間もプラットフォームの存在によって可能になりました。付き合いが深まるにつれて、私たちの愛情はますます厚くなりました。今、私たちは未来の生活に満ち溢れた期待を抱いており、たくさんの素敵な未来の計画を立てています。', '', '2019-6-19', 'たかはし しょうた'),
(4, 'asdasddd', 'こんにちは！心からの感謝の気持ちを皆さんにお伝えしたいと思います。貴プラットフォームを通じて、イギリスに住んでいる彼氏と出会うことができました。彼の登場により、私の世界はこれまで以上に輝き始めました。\r\n\r\n元々は遠く離れていた私たちが、プラットフォームの正確なマッチングと心のこもったサービスを通じて、素敵な縁をつなぐことができました。オンラインで時差を越えた盛り上がったチャットから、オフラインで国境を越えて会ったときのドキドキする瞬間まで、どの一歩もプラットフォームのおかげです。今、私たちの関係は安定しており、未来に対して大いに期待を抱いています。', '', '2021-05-25', '樱井 葵'),
(5, '65165106525', 'When I first saw her profile on the platform, it was as if I had been enchanted, and my heart rate unconsciously accelerated. During our online communication, we were like two people who had opened a chatterbox and just couldn\'t stop. From those strange and niche hobbies to our wild fantasies about the future, every conversation was like exploring a whole new world, full of constant surprises.\r\n\r\nFinally, the day of our offline date arrived. I was so nervous that I didn\'t know what to do with my', '', '2022-09-24', 'William'),
(6, 'asdasdddd', '제 마음 가득 감사의 마음이 넘쳐서, 빨리 이야기하고 싶습니다. 귀하의 플랫폼에 가입하기 전에 제가 사랑을 찾는 길은 아주 길었고, 자주 실망했습니다. 하지만 가입한 후에는 모든 게 달라졌습니다.\r\n\r\n플랫폼의 정확한 필터 기능이 너무 강력합니다. 제가 취미, 성격 취향 등 조건을 설정하자 곧 그녀의 프로필을 볼 수 있었습니다. 첫 번째 온라인 소통할 때 제가 문제를 만났는데, 플랫폼 고객센터가 신속하게 대응하고, 인내심 있게 안내해줘서 소통이 원활하게 이어질 수 있었습니다. 오프라인 데이트 때는 플랫폼에서 추천한 장소가 너무 낭만적이고 적절해서 우리 만남이 특히나 아름답게 됐습니다.', '', '2024-05-15', '박지원'),
(7, '65165106525', 'With a heart full of gratitude, I am earnestly writing this letter. \"May I find a heart - to - heart person and stay with him until the end of our days.\" The once - beautiful expectation for love has now become a reality on your platform. Not long ago, with the help of the platform\'s precise matching and meticulous and considerate services, I met my current girlfriend. She is like a warm sun, instantly lighting up my life.', '', '2023-07-18', 'Sophia'),
(8, 'asdasddddd', 'From the instant sense of familiarity in our first online conversation to the heart - pounding moment during our offline date, along the way, the platform has played an extremely important role. Now, our relationship is firm, and we are full of anticipation for the future. I sincerely thank your platform for creating a high - quality dating environment, allowing the flower of love to bloom brightly. May the platform thrive and help more people encounter good fortune and harvest happiness.', '', '2024-07-13', 'Rossi'),
(9, '65165106525', '감사합니다! 귀하의 플랫폼을 통해 제 여자친구와 만났습니다. 온라인으로 열심히 소통하고, 오프라인 데이트에서 설레는 감정을 느끼는데, 모두 플랫폼의 도움 덕분입니다. 지금 우리 사이의 감정은 안정적이고, 미래에 대한 기대감이 넘쳐납니다. 플랫폼이 제공하는 우수한 환경에 감사드립니다. 이로 인해 사랑이 피어나게 된 것입니다. 플랫폼이 더욱 더 발전해 더 많은 사람들이 행복을 가질 수 있도록 기원합니다. ', '', '2023-03-28', '김지윤');

-- --------------------------------------------------------

--
-- 表的结构 `line`
--

CREATE TABLE `line` (
  `name` varchar(20) NOT NULL,
  `line` varchar(20) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- 表的结构 `manage`
--

CREATE TABLE `manage` (
  `account` varchar(20) NOT NULL,
  `password` varchar(20) NOT NULL,
  `loginFlag` varchar(10) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='			weight: '''', 			xw: '''', 			job';

--
-- 转存表中的数据 `manage`
--

INSERT INTO `manage` (`account`, `password`, `loginFlag`, `id`) VALUES
('xiaohu', 'xiaohu123', '1', 1);

-- --------------------------------------------------------

--
-- 表的结构 `orderlist`
--

CREATE TABLE `orderlist` (
  `id` int(11) NOT NULL,
  `account` varchar(20) NOT NULL,
  `makeMoney` varchar(20) NOT NULL,
  `type` varchar(10) NOT NULL,
  `date` varchar(30) NOT NULL,
  `status` varchar(10) NOT NULL DEFAULT '0' COMMENT '0待审核 1已通过 2已拒绝'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `orderlist`
--

INSERT INTO `orderlist` (`id`, `account`, `makeMoney`, `type`, `date`, `status`) VALUES
(1, '1234', '80000', '0', '2025-02-28 18:03:12', '1'),
(2, '12345', '112000', '0', '2025-02-28 18:15:25', '1'),
(3, '12345', '3000', '0', '2025-03-02 23:03:10', '1'),
(4, '12345', '1000000', '1', '2025-\r\n03-02 23:17:11', '1'),
(5, '12345', '1000000', '0', '2025-\r\n03-02 23:18:35', '1'),
(6, '12345', '10000', '0', '2025-03\r\n-02 23:19:45', '1'),
(7, '12345', '10000', '0', '2025-03\r\n-02 23:19:45', '1'),
(8, '12345', '1000', '0', '2025-03-02 23:46:13', '1'),
(9, '12345', '10000', '1', '2025-03-02 23:47:21', '1'),
(10, '12345', '550000', '1', '2025-03-02 23:50:13', '1'),
(11, '12345', '10000', '0', '2025-03-02 23:50:47', '1'),
(12, '12345', '786', '1', '2025-03-03 00:09:47', '1'),
(13, '12345', '15200', '1', '2025-03-03 00:34:22', '0'),
(14, '1234', '1000', '0', '2025-03-08 11:42:26', '1'),
(15, '15666', '1000', '1', '2025-03-11 16:07:16', '0'),
(16, 'TETU0523', '6000', '1', '2025-03-14 17:06:20', '1'),
(17, '123', '1000', '0', '2025-03-14 17:27:59', '0'),
(18, '1234', '1000', '0', '2025-03-14 17:33:12', '1'),
(19, '1234', '500', '0', '2025-03-17 14:20:20', '1'),
(20, '1234', '5000', '1', '2025-03-17 14:21:07', '1'),
(21, '1234', '5000', '0', '2025-03-17 15:53:08', '1'),
(22, '1234', '50000', '0', '2025-03-17 15:56:57', '2'),
(23, '1234', '630000', '0', '2025-03-29 16:12:15', '2'),
(24, '1234', '630000', '0', '2025-03-29 16:15:52', '1'),
(25, '1234', '600', '0', '2025-03-29 16:24:12', '1'),
(26, '1234', '600', '0', '2025-03-29 16:25:45', '1'),
(27, '1234', '300', '0', '2025-03-29 16:55:51', '1'),
(28, '1234', '10', '0', '2025-03-29 16:56:53', '1'),
(29, '1234', '20', '0', '2025-03-29 16:57:17', '1'),
(30, '1234', '10', '0', '2025-03-29 16:57:44', '1'),
(31, '1234', '100', '0', '2025-03-29 19:25:18', '2'),
(32, '222222', '100000', '0', '2025-03-30 11:51:38', '2'),
(33, '222222', '1000', '0', '2025-03-30 11:56:19', '1'),
(34, '222222', '1000', '1', '2025-03-30 11:56:45', '1'),
(35, '222222', '1300', '1', '2025-03-30 11:59:30', '1'),
(36, '222222', '600', '0', '2025-03-30 21:00:23', '1');

-- --------------------------------------------------------

--
-- 表的结构 `square`
--

CREATE TABLE `square` (
  `id` int(11) NOT NULL,
  `account` varchar(20) NOT NULL,
  `avatar` varchar(50) NOT NULL,
  `title` varchar(20) NOT NULL,
  `content` varchar(255) NOT NULL,
  `source` varchar(50) NOT NULL,
  `date` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL,
  `vipGrade` varchar(20) NOT NULL,
  `likes` varchar(10) NOT NULL,
  `comment` varchar(10) NOT NULL,
  `share` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `square`
--

INSERT INTO `square` (`id`, `account`, `avatar`, `title`, `content`, `source`, `date`, `name`, `vipGrade`, `likes`, `comment`, `share`) VALUES
(1, '123', '24.jpg', 'Sweating profusely o', 'Fitness is not a momentary impulse but a day - by - day perseverance. In this space full of strength, we water the most beautiful flower of figure with our sweat. ', 'Snipaste_2025-02-26_14-52-30.png', '2024-01-23 14:07:05', 'Marry', '3', '65654', '3256', '1325'),
(2, '1234', '23.jpg', 'ヨガは私の変身を見届けた ', '私は初めてのときは下手でしたが、今では上手になりました。心も落ち着き、ヨガは私の成長を見てきました。今日もヨガルームでたくさんのことを学びました。', 'Snipaste_2025-02-26_14-51-47.png', '2024-01-23 18:12:23', '樱井 葵', '2', '24515', '35210', '1564'),
(3, '12345', 'Snipaste_2025-02-28_21-59-韩国风景14.jpg', '산꼭대기', '주말에 산에 올라가 친구들과 산속에서 놀며 웃었어요. 행복이 이렇게 간단하죠. ', 'Snipaste_2025-02-28_22-00-韩国02.jpg', '2024-02-20 17:16:28', '박지원', '3', '15218', '896', '156'),
(4, '123451', 'Snipaste_2025-02-28_22-21-44.jpg', 'I\'m driving to see y', 'Driving with my dog to embrace love, the wind and the dog\'s fur are both sweet.', 'Snipaste_2025-02-28_21-51-美国人44.jpg', '2024-02-21 20:07:00', 'David', '3', '5000+', '999+', '512'),
(5, '123452', 'Snipaste_2025-02-28_22-22-44.jpg', 'LOVE PARTY に感謝いたします', 'このプラットフォームで今の妻と出会いました。皆さん、きれいでしょう？', 'Snipaste_2025-02-28_21-35-45.jpg', '2024-02-21 16:06:09', 'さとう けんた', '2', '999+', '258', '12'),
(6, '123453', 'Snipaste_2025-02-28_22-11-24.jpg', 'Be at home alone', 'Staying at home taking selfies, I\'m like a mischievous elf. With so many funny expressions and full of joy, each photo is my masterpiece of fun!', 'Snipaste_2025-02-28_21-32-41.jpg', '2024-03-06 12:26:40', 'Emily', '3', '10512', '25112', '3251'),
(7, '123454', 'Snipaste_2025-02-28_22-15-头像11.jpg', 'このプラットフォームでイギリス人の彼氏と', 'イギリスに来て、ボーイフレンドと顔合わせ成功！', 'Snipaste_2025-02-28_21-34-56.jpg', '2024-03-13 14:16:17', 'ふじわら しずか', '3', '16521', '7854', '152'),
(9, '8', 'Snipaste_2025-03-08_22-15-15.jpg', '인생 조언: 영원히 좋은 일이 곧 일', '어느 날, 제이미는 실업 상태에서 지친 마음으로 집을 나섰다. 그는 수많은 면접을 보았지만, 모두 실패했었다. 그가 길을 걷다가 길가에 있는 작은 고양이를 발견했다. 고양이는 다리가 다치고 울고 있었다. 제이미는 마음이 따뜻해져 고양이를 데리고 동물 병원에 갔다. 병원에서 고양이를 치료하는 동안, 그는 동물 보호 단체의 직원과 친해졌다. 그 직원은 제이미의 마음씨를 인정하고, 단체에서 일할 기회를 제안했다. 이렇게 제이미는 실망의 연속에서 벗어나 새로운', 'Snipaste_2025-03-08_22-15-56.jpg', '2024-03-18 17:20:43', '달빛소녀', '1', '1548', '1951', '152'),
(10, '9', 'Snipaste_2025-03-08_22-21-27.jpg', '東京の市街地の美しい景色', '東京タワーはパリのエッフェル塔をモデルにして建設され、高さは 332.6 メートルで、角錐形の鉄塔で、四本の脚で支えられています。全体的なデザインはシンプルで力強さを感じさせ、ラインが流暢で、あらゆる角度から見ても非常に美しさがあります。\n', 'Snipaste_2025-03-08_22-20-59.jpg', '2024-03-18 18:07:18', 'ねこの夢', '2', '2548', '3521', '148'),
(11, '7', 'Snipaste_2025-03-08_22-28-19.jpg', '花火の呗', '朝のゴルフ場は、芝生が一面に広がり、草の葉に露がきらきらと光っています。私は草の香りを含んだ空気を深く吸い込み、今日の最初の打ちを準備します。大自然と心地よい対話をすることを楽しみにしています。', 'Snipaste_2025-03-08_22-28-00.jpg', '2024-03-19 15:02:02', 'さくらい みさき', '2', '11502', '53652', '1529'),
(12, '10', 'Snipaste_2025-03-09_00-12-17.jpg', '首にチェック柄のマフラーを巻いています', '両手を広げて、まるで雪景色に浸り、喜びに酔っているかのようです。背景は両側に建物が立ち並ぶ通りで、地面や建物には雪が積もっています。通りには黒い車が停まっており、通行人も歩いています。空は青々としており、全体的な雰囲気はすがすがしく明るく、冬の趣をたっぷりと感じさせます 。', 'Snipaste_2025-03-09_00-11-40.jpg', '2024-03-21 14:20:27', 'ほしの あやか ', '1', '5121', '124512', '1211'),
(13, '11', 'Snipaste_2025-03-09_00-12-35.jpg', 'に富士山の', '遠くには雄大な富士山が見え、山頂は雪で覆われており、青空の引き立てで格別に壮観です。全体的な画面は濃厚な日本の街並みの風情に満ちており、同時に富士山の美しさも披露しています 。', 'Snipaste_2025-03-09_00-13-15.jpg', '2024-03-24 09:37:31', 'いとう ゆうま ', '2', '1241', '2332', '125'),
(14, '12', 'Snipaste_2025-03-09_00-13-42.jpg', 'これは現代的な雰囲気溢れる建物の内部廊下', '独特な幾何学的な造形の柱と穿孔金属の壁面が、シンプルでデザイン性の高い空間を作り出しています 。\n', 'Snipaste_2025-03-09_00-12-52.jpg', '2024-04-10 11:17:06', '（よしおか り', '2', '1241', '12941', '2541'),
(15, '13', 'Snipaste_2025-03-09_00-14-08.jpg', '素敵な雰囲気に浸る', '湖は濃い青みを帯び、きらきらと光っています。このシーンはおそらく日本の富士五湖エリアでしょう。そこは富士山の美しい景色を楽しむ絶好の場所の一つです 。', 'Snipaste_2025-03-09_00-14-26.jpg', '2024-03-29 17:17:16', 'ささき ゆう', '0', '1521', '5674', '291'),
(16, '13', 'Snipaste_2025-03-09_00-14-56.jpg', 'あなたとお話がしたいです', 'このプラットフォームで本当の愛を見つけることができます。ここでは、たくさんの素敵な人たちと出会えるチャンスがあります。人とのつながりを大切にし、真摯な気持ちで交流すれば、運命の人と出会うかもしれません。本当の愛は時に突然やってきます。このプラットフォームを通じて、あなたの人生に光をもたらす特別な人を見つけましょう。', 'Snipaste_2025-03-09_00-15-57.jpg', '2024-05-15 14:17:18', '佐々木 優奈', '2', '65412', '125421', '12549');

-- --------------------------------------------------------

--
-- 表的结构 `staff`
--

CREATE TABLE `staff` (
  `name` varchar(20) NOT NULL,
  `inviteCode` varchar(10) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `staff`
--

INSERT INTO `staff` (`name`, `inviteCode`, `id`) VALUES
('阿虎', '1801', 1),
('哪吒', '1568', 2),
('阿鑫', '1803', 3),
('阿龙', '1899', 4),
('阿爆', '1805', 5),
('阿九', '1806', 6),
('阿亮', '1807', 7),
('阿雄', '1808', 8),
('阿鬼', '1809', 11),
('阿超', '1810', 13),
('阿岸', '1811', 14),
('阿东', '1812', 15),
('阿羊', '1816', 16),
('阿斌', '1815', 17);

-- --------------------------------------------------------

--
-- 表的结构 `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `account` varchar(20) DEFAULT NULL,
  `password` varchar(20) DEFAULT NULL,
  `inviteCode` varchar(20) DEFAULT NULL,
  `dataError` varchar(20) DEFAULT '0',
  `age` varchar(20) DEFAULT NULL,
  `gender` varchar(20) DEFAULT NULL,
  `bankCard` varchar(255) DEFAULT NULL,
  `money` int(10) UNSIGNED DEFAULT NULL,
  `avatar` varchar(255) DEFAULT NULL,
  `vipCode` varchar(20) DEFAULT NULL,
  `createDate` varchar(20) NOT NULL,
  `vipGrade` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL,
  `vipStatus` varchar(20) NOT NULL COMMENT '0制作中  1未激活 2激活中 3已激活',
  `likeSquare` varchar(255) NOT NULL,
  `city` varchar(30) NOT NULL,
  `remake` varchar(255) NOT NULL,
  `lineCode` varchar(20) NOT NULL,
  `pairAccount` varchar(20) NOT NULL,
  `pz` varchar(50) NOT NULL,
  `pz1` varchar(50) NOT NULL,
  `pz2` varchar(50) NOT NULL,
  `voteFlag` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `users`
--

INSERT INTO `users` (`id`, `account`, `password`, `inviteCode`, `dataError`, `age`, `gender`, `bankCard`, `money`, `avatar`, `vipCode`, `createDate`, `vipGrade`, `name`, `vipStatus`, `likeSquare`, `city`, `remake`, `lineCode`, `pairAccount`, `pz`, `pz1`, `pz2`, `voteFlag`) VALUES
(2, '12345', '12345', '1208', NULL, '26', '女', NULL, 1686986, 'Snipaste_2025-02-28_22-13-头像38.jpg', '566814', '2025-02-26 17:29:35', '3', '박지원', '3', '21', '', '', '', '', '', '', '', ''),
(3, '1234', '1234', '8888', '1', '25', '女', '', 1272310, 'photo_2025-02-19_18-54-02.jpg', '566814', '2025-02-26 17:30:40', '3', '美奈子', '3', '23751161513', '', '', 'undefined', '', '', '', '', ''),
(13, '12345', '12345', '1234', NULL, NULL, NULL, NULL, NULL, 'Snipaste_2025-02-28_22-13-头像38.jpg', NULL, '2025-02-26 17:57:59', '1', '박지원', '', '21', '', '', '', '', '', '', '', ''),
(20, '123', '123', '1108', NULL, '22', '女', NULL, 88000, 'Snipaste_2025-02-26_14-21-25.png', '566814', '2025-02-25 16:37:10', '3', '千本', '3', '', '', '', '', '', '', '', '', ''),
(29, '158168688', '123321', '1208', '1', NULL, '男', NULL, 280000, 'IMG_0061.png', '558623', '2025-03-09 16:56:05', '1', '長澤まさみ', '3', '', '', '', '', '', '', '', '', ''),
(30, '88998899', '123456789', '1208', NULL, NULL, '男', NULL, NULL, NULL, NULL, '2025-03-09 17:09:23', '', '', '', '', '', '', '', '', '', '', '', ''),
(31, '6535333', 'aa123456', '1208', NULL, NULL, '女', NULL, NULL, NULL, NULL, '2025-03-09 17:11:57', '', '', '', '', '', '', '', '', '', '', '', ''),
(32, 'yj773707', '773707', '1208', NULL, NULL, '男', NULL, NULL, NULL, NULL, '2025-03-09 17:12:29', '', '', '', '', '', '', '', '', '', '', '', ''),
(33, '1314520', '12345678', '1208', NULL, NULL, '男', NULL, NULL, NULL, NULL, '2025-03-09 21:53:45', '', '', '', '', '', '', '', '', '', '', '', ''),
(36, '1212123', '123456', '1208', NULL, NULL, '男', NULL, 160000, 'IMG_0119.jpeg', '257354', '2025-03-10 15:43:37', '3', '花泽美穗', '3', '', '', '', '', '', '', '', '', ''),
(37, 'Qwe7575775', 'qwe8686886', '1208', NULL, NULL, '女', NULL, 520000, 'IMG_0055.jpeg', '357143', '2025-03-11 16:52:29', '3', '美奈子', '3', '', '', '', '', '', '', '', '', ''),
(38, 'kaede', 'Aa123456..', '1208', NULL, NULL, '男', NULL, 980000, 'IMG_0057.jpeg', '657892', '2025-03-12 20:45:24', '3', '矢野枫', '3', '', '', '', '', '', '', '', '', ''),
(39, '16888', '123456', '1208', NULL, NULL, '男', NULL, 450000, 'IMG_0001.jpeg', '558212', '2025-03-13 10:21:59', '3', '早川奈子', '3', '', '', '', '', '', '', '', '', ''),
(40, '16889', '123456', '1208', NULL, NULL, '女', NULL, 660000, 'IMG_0001.jpeg', '685551', '2025-03-13 10:25:29', '3', '早川奈子', '3', '', '', '', '', '', '', '', '', ''),
(41, '16885', '123456', '1208', NULL, NULL, '女', NULL, 773000, 'IMG_0005.jpeg', '664599', '2025-03-13 10:35:51', '3', '春島優井', '3', '', '', '', '', '', '', '', '', ''),
(42, '16808', '123456', '1208', NULL, NULL, '女', NULL, 650000, 'IMG_0006.jpeg', '336258', '2025-03-13 10:37:57', '3', '田中千島', '3', '', '', '', '', '', '', '', '', ''),
(43, 'scxn521', 'AA123456aa', '1208', NULL, NULL, '女', NULL, 662000, 'IMG_0002.jpeg', '112536', '2025-03-13 10:38:21', '3', '森川幸乃', '3', '', '', '', '', '', '', '', '', ''),
(44, '16887', '123456', '1208', NULL, NULL, '女', NULL, 522000, 'IMG_0007.jpeg', '668893', '2025-03-13 10:40:43', '3', '中村優里', '3', '', '', '', '', '', '', '', '', ''),
(45, 'rxqz9912', 'AA123456aa', '1208', NULL, NULL, '女', NULL, 880000, 'IMG_0004.png', '556587', '2025-03-13 11:37:38', '3', '日向晴子', '3', '', '', '', '', '', '', '', '', ''),
(46, 'mkjy5186', 'AA123456aa', '1208', NULL, NULL, '女', NULL, 583000, 'image_0 (2).png', '896558', '2025-03-13 11:41:27', '3', 'ミソラ ユイ', '3', '', '', '', '', '', '', '', '', ''),
(47, 'scyz818', 'AA123456aa', '1208', NULL, NULL, '女', NULL, 890000, 'IMG_0006.png', '662532', '2025-03-13 11:43:17', '3', '石原桜子', '3', '', '', '', '', '', '', '', '', ''),
(48, 'rina', 'AA123456..', '1208', NULL, NULL, '女', NULL, 520000, 'IMG_0058.jpeg', '852006', '2025-03-13 14:11:49', '3', '吉冈梨奈', '3', '', '', '', '', '', '', '', '', ''),
(49, 'yukino', 'Aa123456..', '1208', 'undefined', 'undefined', '女', '', 660000, 'IMG_0059.jpeg', '225689', '2025-03-13 14:14:14', '3', '森川雪乃', '3', '', '', '', '', '', '', '', '', ''),
(50, '158910355', '158910355', '1208', '0', NULL, '女', NULL, NULL, 'Snipaste_2025-02-17_19-32-25.png', NULL, '2025-03-14 16:08:14', '1', 'ヤマナカ ナオミ', '0', '', '', '', '', '', '', '', '', ''),
(51, 'love', '102431', '1208', '0', NULL, '女', NULL, NULL, NULL, NULL, '2025-03-14 16:10:41', '', '', '', '', '', '', '', '', '', '', '', ''),
(52, '893538736', '893538736', '1208', '0', NULL, '女', NULL, NULL, 'Snipaste_2025-02-18_22-02-32.png', NULL, '2025-03-14 16:33:07', '1', 'ヤマモト ミコ', '0', '', '', '', '', '', '', '', '', ''),
(53, 'zz3222378911', 'zz3222378911', '1208', '0', NULL, '女', NULL, NULL, 'Snipaste_2025-02-19_16-06-19.png', NULL, '2025-03-14 16:43:22', '1', 'ヤマモト アヤコ', '0', '', '', '', '', '', '', '', '', ''),
(54, '6389547048', '6389547048', '1208', '0', '', '女', '', 0, 'Snipaste_2025-03-14_16-49-14.png', '774311', '2025-03-14 16:45:03', '1', 'ヤマナカ ミコ', '0', '', '', '', '', '', '', '', '', ''),
(55, 'TETU0523', 'Tetu2451', '879899', '0', '', '男', '', 0, 'IMG_1028.jpeg', '585866', '2025-03-14 16:50:32', '1', 'T2', '0', '', '', '', '', '', '', '', '', ''),
(56, '2589633', '2589633', '252612', '0', '', '女', '', 750000, 'image_0 (26).png', '553956', '2025-03-15 15:17:16', '3', 'ヨシカワ ケイコ', '3', '', '', '', '', '', '', '', '', ''),
(69, '123123', '123123', '8888', '1', '', '男', '', 0, '', '', '2025-03-24 19:27:00', '0', '', '', '', '', '', 'undefined', '', '', '', '', ''),
(70, '1122', '1122', '252612', '1', '', '男', '', 9989, 'photo_2025-02-09_14-49-22.jpg', '', '2025-03-24 19:41:39', '1', 'わたなべ みほ', '0', '', '', '', 'undefined', '', '', '', '', ''),
(71, '111111', '111111', '888888', '0', '', '男', '', 33, 'photo_2025-01-23_11-54-21.jpg', '', '2025-03-25 15:18:43', '3', '1', '3', '', '', '', 'qx001', '', '', '', '', ''),
(78, '222222', '222222', '1208', '0', '', '男', '', 98100, 'Snipaste_2024-11-15_10-19-23.png', '697909', '2025-03-30 11:53:00', '3', 'あさの ちなつ', '3', '', '', '', 'undefined', '', '', '', '', '');

-- --------------------------------------------------------

--
-- 表的结构 `vip`
--

CREATE TABLE `vip` (
  `name` varchar(20) NOT NULL,
  `type` varchar(10) NOT NULL,
  `img` varchar(50) NOT NULL,
  `id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `vip`
--

INSERT INTO `vip` (`name`, `type`, `img`, `id`) VALUES
('一般用户', '1', 'vipCard1.png', 1),
('高级会员', '2', 'vipCard.png', 3);

-- --------------------------------------------------------

--
-- 表的结构 `vote`
--

CREATE TABLE `vote` (
  `account` varchar(20) NOT NULL,
  `voteNum` varchar(20) NOT NULL,
  `voteId` varchar(10) NOT NULL,
  `date` varchar(20) NOT NULL,
  `id` int(11) NOT NULL,
  `dataError` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转储表的索引
--

--
-- 表的索引 `convension`
--
ALTER TABLE `convension`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `dating`
--
ALTER TABLE `dating`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `gift`
--
ALTER TABLE `gift`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `letter`
--
ALTER TABLE `letter`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `line`
--
ALTER TABLE `line`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `manage`
--
ALTER TABLE `manage`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `orderlist`
--
ALTER TABLE `orderlist`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `square`
--
ALTER TABLE `square`
  ADD PRIMARY KEY (`id`),
  ADD KEY `account` (`account`);

--
-- 表的索引 `staff`
--
ALTER TABLE `staff`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `vip`
--
ALTER TABLE `vip`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `vote`
--
ALTER TABLE `vote`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `convension`
--
ALTER TABLE `convension`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;

--
-- 使用表AUTO_INCREMENT `dating`
--
ALTER TABLE `dating`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- 使用表AUTO_INCREMENT `gift`
--
ALTER TABLE `gift`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `letter`
--
ALTER TABLE `letter`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- 使用表AUTO_INCREMENT `line`
--
ALTER TABLE `line`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `manage`
--
ALTER TABLE `manage`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用表AUTO_INCREMENT `orderlist`
--
ALTER TABLE `orderlist`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=37;

--
-- 使用表AUTO_INCREMENT `square`
--
ALTER TABLE `square`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- 使用表AUTO_INCREMENT `staff`
--
ALTER TABLE `staff`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- 使用表AUTO_INCREMENT `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=79;

--
-- 使用表AUTO_INCREMENT `vip`
--
ALTER TABLE `vip`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- 使用表AUTO_INCREMENT `vote`
--
ALTER TABLE `vote`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- 数据库： `phpmyadmin`
--
CREATE DATABASE IF NOT EXISTS `phpmyadmin` DEFAULT CHARACTER SET utf8 COLLATE utf8_bin;
USE `phpmyadmin`;

-- --------------------------------------------------------

--
-- 表的结构 `pma__bookmark`
--

CREATE TABLE `pma__bookmark` (
  `id` int(10) UNSIGNED NOT NULL,
  `dbase` varchar(255) NOT NULL DEFAULT '',
  `user` varchar(255) NOT NULL DEFAULT '',
  `label` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '',
  `query` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Bookmarks';

-- --------------------------------------------------------

--
-- 表的结构 `pma__central_columns`
--

CREATE TABLE `pma__central_columns` (
  `db_name` varchar(64) NOT NULL,
  `col_name` varchar(64) NOT NULL,
  `col_type` varchar(64) NOT NULL,
  `col_length` text DEFAULT NULL,
  `col_collation` varchar(64) NOT NULL,
  `col_isNull` tinyint(1) NOT NULL,
  `col_extra` varchar(255) DEFAULT '',
  `col_default` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Central list of columns';

-- --------------------------------------------------------

--
-- 表的结构 `pma__column_info`
--

CREATE TABLE `pma__column_info` (
  `id` int(5) UNSIGNED NOT NULL,
  `db_name` varchar(64) NOT NULL DEFAULT '',
  `table_name` varchar(64) NOT NULL DEFAULT '',
  `column_name` varchar(64) NOT NULL DEFAULT '',
  `comment` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '',
  `mimetype` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '',
  `transformation` varchar(255) NOT NULL DEFAULT '',
  `transformation_options` varchar(255) NOT NULL DEFAULT '',
  `input_transformation` varchar(255) NOT NULL DEFAULT '',
  `input_transformation_options` varchar(255) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Column information for phpMyAdmin';

-- --------------------------------------------------------

--
-- 表的结构 `pma__designer_settings`
--

CREATE TABLE `pma__designer_settings` (
  `username` varchar(64) NOT NULL,
  `settings_data` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Settings related to Designer';

-- --------------------------------------------------------

--
-- 表的结构 `pma__export_templates`
--

CREATE TABLE `pma__export_templates` (
  `id` int(5) UNSIGNED NOT NULL,
  `username` varchar(64) NOT NULL,
  `export_type` varchar(10) NOT NULL,
  `template_name` varchar(64) NOT NULL,
  `template_data` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Saved export templates';

--
-- 转存表中的数据 `pma__export_templates`
--

INSERT INTO `pma__export_templates` (`id`, `username`, `export_type`, `template_name`, `template_data`) VALUES
(1, 'root', 'database', 'lp', '{\"quick_or_custom\":\"quick\",\"what\":\"sql\",\"structure_or_data_forced\":\"0\",\"table_select[]\":[\"bulletin\",\"convension\",\"dating\",\"gift\",\"lang\",\"letter\",\"line\",\"manage\",\"operator\",\"orderlist\",\"pair\",\"square\",\"staff\",\"sysdata\",\"users\",\"vip\",\"vote\"],\"table_structure[]\":[\"bulletin\",\"convension\",\"dating\",\"gift\",\"lang\",\"letter\",\"line\",\"manage\",\"operator\",\"orderlist\",\"pair\",\"square\",\"staff\",\"sysdata\",\"users\",\"vip\",\"vote\"],\"table_data[]\":[\"bulletin\",\"convension\",\"dating\",\"gift\",\"lang\",\"letter\",\"line\",\"manage\",\"operator\",\"orderlist\",\"pair\",\"square\",\"staff\",\"sysdata\",\"users\",\"vip\",\"vote\"],\"aliases_new\":\"\",\"output_format\":\"sendit\",\"filename_template\":\"@DATABASE@\",\"remember_template\":\"on\",\"charset\":\"utf-8\",\"compression\":\"none\",\"maxsize\":\"\",\"codegen_structure_or_data\":\"data\",\"codegen_format\":\"0\",\"csv_separator\":\",\",\"csv_enclosed\":\"\\\"\",\"csv_escaped\":\"\\\"\",\"csv_terminated\":\"AUTO\",\"csv_null\":\"NULL\",\"csv_columns\":\"something\",\"csv_structure_or_data\":\"data\",\"excel_null\":\"NULL\",\"excel_columns\":\"something\",\"excel_edition\":\"win\",\"excel_structure_or_data\":\"data\",\"json_structure_or_data\":\"data\",\"json_unicode\":\"something\",\"latex_caption\":\"something\",\"latex_structure_or_data\":\"structure_and_data\",\"latex_structure_caption\":\"@TABLE@ 表的结构\",\"latex_structure_continued_caption\":\"@TABLE@ 表的结构 (延续的)\",\"latex_structure_label\":\"tab:@TABLE@-structure\",\"latex_relation\":\"something\",\"latex_comments\":\"something\",\"latex_mime\":\"something\",\"latex_columns\":\"something\",\"latex_data_caption\":\"@TABLE@ 表的内容\",\"latex_data_continued_caption\":\"@TABLE@ 表的内容 (延续的)\",\"latex_data_label\":\"tab:@TABLE@-data\",\"latex_null\":\"\\\\textit{NULL}\",\"mediawiki_structure_or_data\":\"structure_and_data\",\"mediawiki_caption\":\"something\",\"mediawiki_headers\":\"something\",\"htmlword_structure_or_data\":\"structure_and_data\",\"htmlword_null\":\"NULL\",\"ods_null\":\"NULL\",\"ods_structure_or_data\":\"data\",\"odt_structure_or_data\":\"structure_and_data\",\"odt_relation\":\"something\",\"odt_comments\":\"something\",\"odt_mime\":\"something\",\"odt_columns\":\"something\",\"odt_null\":\"NULL\",\"pdf_report_title\":\"\",\"pdf_structure_or_data\":\"structure_and_data\",\"phparray_structure_or_data\":\"data\",\"sql_include_comments\":\"something\",\"sql_header_comment\":\"\",\"sql_use_transaction\":\"something\",\"sql_compatibility\":\"NONE\",\"sql_structure_or_data\":\"structure_and_data\",\"sql_create_table\":\"something\",\"sql_auto_increment\":\"something\",\"sql_create_view\":\"something\",\"sql_procedure_function\":\"something\",\"sql_create_trigger\":\"something\",\"sql_backquotes\":\"something\",\"sql_type\":\"INSERT\",\"sql_insert_syntax\":\"both\",\"sql_max_query_size\":\"50000\",\"sql_hex_for_binary\":\"something\",\"sql_utc_time\":\"something\",\"texytext_structure_or_data\":\"structure_and_data\",\"texytext_null\":\"NULL\",\"xml_structure_or_data\":\"data\",\"xml_export_events\":\"something\",\"xml_export_functions\":\"something\",\"xml_export_procedures\":\"something\",\"xml_export_tables\":\"something\",\"xml_export_triggers\":\"something\",\"xml_export_views\":\"something\",\"xml_export_contents\":\"something\",\"yaml_structure_or_data\":\"data\",\"\":null,\"lock_tables\":null,\"as_separate_files\":null,\"csv_removeCRLF\":null,\"excel_removeCRLF\":null,\"json_pretty_print\":null,\"htmlword_columns\":null,\"ods_columns\":null,\"sql_dates\":null,\"sql_relation\":null,\"sql_mime\":null,\"sql_disable_fk\":null,\"sql_views_as_tables\":null,\"sql_metadata\":null,\"sql_create_database\":null,\"sql_drop_table\":null,\"sql_if_not_exists\":null,\"sql_simple_view_export\":null,\"sql_view_current_user\":null,\"sql_or_replace_view\":null,\"sql_truncate\":null,\"sql_delayed\":null,\"sql_ignore\":null,\"texytext_columns\":null}');

-- --------------------------------------------------------

--
-- 表的结构 `pma__favorite`
--

CREATE TABLE `pma__favorite` (
  `username` varchar(64) NOT NULL,
  `tables` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Favorite tables';

-- --------------------------------------------------------

--
-- 表的结构 `pma__history`
--

CREATE TABLE `pma__history` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `username` varchar(64) NOT NULL DEFAULT '',
  `db` varchar(64) NOT NULL DEFAULT '',
  `table` varchar(64) NOT NULL DEFAULT '',
  `timevalue` timestamp NOT NULL DEFAULT current_timestamp(),
  `sqlquery` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='SQL history for phpMyAdmin';

-- --------------------------------------------------------

--
-- 表的结构 `pma__navigationhiding`
--

CREATE TABLE `pma__navigationhiding` (
  `username` varchar(64) NOT NULL,
  `item_name` varchar(64) NOT NULL,
  `item_type` varchar(64) NOT NULL,
  `db_name` varchar(64) NOT NULL,
  `table_name` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Hidden items of navigation tree';

-- --------------------------------------------------------

--
-- 表的结构 `pma__pdf_pages`
--

CREATE TABLE `pma__pdf_pages` (
  `db_name` varchar(64) NOT NULL DEFAULT '',
  `page_nr` int(10) UNSIGNED NOT NULL,
  `page_descr` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='PDF relation pages for phpMyAdmin';

-- --------------------------------------------------------

--
-- 表的结构 `pma__recent`
--

CREATE TABLE `pma__recent` (
  `username` varchar(64) NOT NULL,
  `tables` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Recently accessed tables';

--
-- 转存表中的数据 `pma__recent`
--

INSERT INTO `pma__recent` (`username`, `tables`) VALUES
('root', '[{\"db\":\"lp\",\"table\":\"vote\"},{\"db\":\"lp\",\"table\":\"users\"},{\"db\":\"lp\",\"table\":\"orderlist\"},{\"db\":\"lp\",\"table\":\"bulletin\"},{\"db\":\"lp\",\"table\":\"square\"},{\"db\":\"lp\",\"table\":\"sysdata\"},{\"db\":\"lp_om\",\"table\":\"users\"},{\"db\":\"lp\",\"table\":\"vip\"},{\"db\":\"lp_test\",\"table\":\"users\"},{\"db\":\"lp_test\",\"table\":\"vip\"}]');

-- --------------------------------------------------------

--
-- 表的结构 `pma__relation`
--

CREATE TABLE `pma__relation` (
  `master_db` varchar(64) NOT NULL DEFAULT '',
  `master_table` varchar(64) NOT NULL DEFAULT '',
  `master_field` varchar(64) NOT NULL DEFAULT '',
  `foreign_db` varchar(64) NOT NULL DEFAULT '',
  `foreign_table` varchar(64) NOT NULL DEFAULT '',
  `foreign_field` varchar(64) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Relation table';

-- --------------------------------------------------------

--
-- 表的结构 `pma__savedsearches`
--

CREATE TABLE `pma__savedsearches` (
  `id` int(5) UNSIGNED NOT NULL,
  `username` varchar(64) NOT NULL DEFAULT '',
  `db_name` varchar(64) NOT NULL DEFAULT '',
  `search_name` varchar(64) NOT NULL DEFAULT '',
  `search_data` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Saved searches';

-- --------------------------------------------------------

--
-- 表的结构 `pma__table_coords`
--

CREATE TABLE `pma__table_coords` (
  `db_name` varchar(64) NOT NULL DEFAULT '',
  `table_name` varchar(64) NOT NULL DEFAULT '',
  `pdf_page_number` int(11) NOT NULL DEFAULT 0,
  `x` float UNSIGNED NOT NULL DEFAULT 0,
  `y` float UNSIGNED NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Table coordinates for phpMyAdmin PDF output';

-- --------------------------------------------------------

--
-- 表的结构 `pma__table_info`
--

CREATE TABLE `pma__table_info` (
  `db_name` varchar(64) NOT NULL DEFAULT '',
  `table_name` varchar(64) NOT NULL DEFAULT '',
  `display_field` varchar(64) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Table information for phpMyAdmin';

-- --------------------------------------------------------

--
-- 表的结构 `pma__table_uiprefs`
--

CREATE TABLE `pma__table_uiprefs` (
  `username` varchar(64) NOT NULL,
  `db_name` varchar(64) NOT NULL,
  `table_name` varchar(64) NOT NULL,
  `prefs` text NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Tables'' UI preferences';

--
-- 转存表中的数据 `pma__table_uiprefs`
--

INSERT INTO `pma__table_uiprefs` (`username`, `db_name`, `table_name`, `prefs`, `last_update`) VALUES
('root', 'lp', 'dating', '{\"CREATE_TIME\":\"2025-03-15 19:51:05\",\"col_order\":[6,0,1,2,3,4,5],\"col_visib\":[1,1,1,1,1,1,1]}', '2025-04-18 09:39:05'),
('root', 'lp', 'orderlist', '{\"sorted_col\":\"`id` DESC\"}', '2025-04-24 07:45:59'),
('root', 'lp', 'square', '{\"sorted_col\":\"`id` DESC\"}', '2025-04-09 10:57:19'),
('root', 'lp', 'sysdata', '{\"CREATE_TIME\":\"2025-04-18 16:45:31\",\"col_order\":[2,0,1,3,4,5,6,7],\"col_visib\":[1,1,1,1,1,1,1,1],\"sorted_col\":\"`initMoney` DESC\"}', '2025-04-18 11:39:42'),
('root', 'lp', 'users', '{\"CREATE_TIME\":\"2025-03-20 10:54:38\",\"sorted_col\":\"`id` DESC\"}', '2025-04-27 14:24:01'),
('root', 'lp_test', 'users', '{\"sorted_col\":\"`users`.`id` DESC\"}', '2025-03-29 12:32:34');

-- --------------------------------------------------------

--
-- 表的结构 `pma__tracking`
--

CREATE TABLE `pma__tracking` (
  `db_name` varchar(64) NOT NULL,
  `table_name` varchar(64) NOT NULL,
  `version` int(10) UNSIGNED NOT NULL,
  `date_created` datetime NOT NULL,
  `date_updated` datetime NOT NULL,
  `schema_snapshot` text NOT NULL,
  `schema_sql` text DEFAULT NULL,
  `data_sql` longtext DEFAULT NULL,
  `tracking` set('UPDATE','REPLACE','INSERT','DELETE','TRUNCATE','CREATE DATABASE','ALTER DATABASE','DROP DATABASE','CREATE TABLE','ALTER TABLE','RENAME TABLE','DROP TABLE','CREATE INDEX','DROP INDEX','CREATE VIEW','ALTER VIEW','DROP VIEW') DEFAULT NULL,
  `tracking_active` int(1) UNSIGNED NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Database changes tracking for phpMyAdmin';

-- --------------------------------------------------------

--
-- 表的结构 `pma__userconfig`
--

CREATE TABLE `pma__userconfig` (
  `username` varchar(64) NOT NULL,
  `timevalue` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `config_data` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='User preferences storage for phpMyAdmin';

--
-- 转存表中的数据 `pma__userconfig`
--

INSERT INTO `pma__userconfig` (`username`, `timevalue`, `config_data`) VALUES
('root', '2025-08-15 03:01:11', '{\"Console\\/Mode\":\"collapse\",\"lang\":\"zh_CN\"}');

-- --------------------------------------------------------

--
-- 表的结构 `pma__usergroups`
--

CREATE TABLE `pma__usergroups` (
  `usergroup` varchar(64) NOT NULL,
  `tab` varchar(64) NOT NULL,
  `allowed` enum('Y','N') NOT NULL DEFAULT 'N'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='User groups with configured menu items';

-- --------------------------------------------------------

--
-- 表的结构 `pma__users`
--

CREATE TABLE `pma__users` (
  `username` varchar(64) NOT NULL,
  `usergroup` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='Users and their assignments to user groups';

--
-- 转储表的索引
--

--
-- 表的索引 `pma__bookmark`
--
ALTER TABLE `pma__bookmark`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `pma__central_columns`
--
ALTER TABLE `pma__central_columns`
  ADD PRIMARY KEY (`db_name`,`col_name`);

--
-- 表的索引 `pma__column_info`
--
ALTER TABLE `pma__column_info`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `db_name` (`db_name`,`table_name`,`column_name`);

--
-- 表的索引 `pma__designer_settings`
--
ALTER TABLE `pma__designer_settings`
  ADD PRIMARY KEY (`username`);

--
-- 表的索引 `pma__export_templates`
--
ALTER TABLE `pma__export_templates`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `u_user_type_template` (`username`,`export_type`,`template_name`);

--
-- 表的索引 `pma__favorite`
--
ALTER TABLE `pma__favorite`
  ADD PRIMARY KEY (`username`);

--
-- 表的索引 `pma__history`
--
ALTER TABLE `pma__history`
  ADD PRIMARY KEY (`id`),
  ADD KEY `username` (`username`,`db`,`table`,`timevalue`);

--
-- 表的索引 `pma__navigationhiding`
--
ALTER TABLE `pma__navigationhiding`
  ADD PRIMARY KEY (`username`,`item_name`,`item_type`,`db_name`,`table_name`);

--
-- 表的索引 `pma__pdf_pages`
--
ALTER TABLE `pma__pdf_pages`
  ADD PRIMARY KEY (`page_nr`),
  ADD KEY `db_name` (`db_name`);

--
-- 表的索引 `pma__recent`
--
ALTER TABLE `pma__recent`
  ADD PRIMARY KEY (`username`);

--
-- 表的索引 `pma__relation`
--
ALTER TABLE `pma__relation`
  ADD PRIMARY KEY (`master_db`,`master_table`,`master_field`),
  ADD KEY `foreign_field` (`foreign_db`,`foreign_table`);

--
-- 表的索引 `pma__savedsearches`
--
ALTER TABLE `pma__savedsearches`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `u_savedsearches_username_dbname` (`username`,`db_name`,`search_name`);

--
-- 表的索引 `pma__table_coords`
--
ALTER TABLE `pma__table_coords`
  ADD PRIMARY KEY (`db_name`,`table_name`,`pdf_page_number`);

--
-- 表的索引 `pma__table_info`
--
ALTER TABLE `pma__table_info`
  ADD PRIMARY KEY (`db_name`,`table_name`);

--
-- 表的索引 `pma__table_uiprefs`
--
ALTER TABLE `pma__table_uiprefs`
  ADD PRIMARY KEY (`username`,`db_name`,`table_name`);

--
-- 表的索引 `pma__tracking`
--
ALTER TABLE `pma__tracking`
  ADD PRIMARY KEY (`db_name`,`table_name`,`version`);

--
-- 表的索引 `pma__userconfig`
--
ALTER TABLE `pma__userconfig`
  ADD PRIMARY KEY (`username`);

--
-- 表的索引 `pma__usergroups`
--
ALTER TABLE `pma__usergroups`
  ADD PRIMARY KEY (`usergroup`,`tab`,`allowed`);

--
-- 表的索引 `pma__users`
--
ALTER TABLE `pma__users`
  ADD PRIMARY KEY (`username`,`usergroup`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `pma__bookmark`
--
ALTER TABLE `pma__bookmark`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `pma__column_info`
--
ALTER TABLE `pma__column_info`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `pma__export_templates`
--
ALTER TABLE `pma__export_templates`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用表AUTO_INCREMENT `pma__history`
--
ALTER TABLE `pma__history`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `pma__pdf_pages`
--
ALTER TABLE `pma__pdf_pages`
  MODIFY `page_nr` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `pma__savedsearches`
--
ALTER TABLE `pma__savedsearches`
  MODIFY `id` int(5) UNSIGNED NOT NULL AUTO_INCREMENT;
--
-- 数据库： `test`
--
CREATE DATABASE IF NOT EXISTS `test` DEFAULT CHARACTER SET latin1 COLLATE latin1_swedish_ci;
USE `test`;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
